[{"category": "Electronics & Technology", "title": "Very happy", "review": "Laptop was in excellent condition as advertised, battery life is a bit short but it is second hand so only to be expected.Delivery was quick and laptop came in/with all it's original packaging.Very happy with Back Markets price and service.", "stars": 5, "review_id": 30760}, {"category": "Electronics & Technology", "title": " Was sceptical but no need!", "review": "Having never bought a second hand phone before, will admit to being highly sceptical! Went for it and am absolutely delighted. Chose excellent condition and can barely tell from new (couple of very light scratches). Superb communication, quick delivery and excellent product. These guys are A++.", "stars": 5, "review_id": 30761}, {"category": "Electronics & Technology", "title": "Decent company to deal with", "review": "This is the first time I have purchased refurbished and was slightly apprehensive. However, the product was in excellent condition and to all intents and purposes seemed brand new.It was hassle free ordering with a speedy delivery.I would use this company again. ", "stars": 5, "review_id": 30762}, {"category": "Electronics & Technology", "title": "I was so skeptical at first buying not…", "review": "I was so skeptical at first buying not only refurbished phone but over the internet without actually seeing in person as I brought the “fair” grade phone which is the lowest grade however I needn’t be it arrived next day and honestly the phone looks brand new I was actually so shocked at how good it was considering it was only in the fair category. I would 100% order from them again. ", "stars": 5, "review_id": 30763}, {"category": "Electronics & Technology", "title": "More than expected 👌", "review": "More than expected 👌. Price was ok, really quick delivery (considering it was between Christmas and New Year), very happy with new to me iPhone 14 Pro Max ", "stars": 5, "review_id": 30764}, {"category": "Electronics & Technology", "title": "This is my 2nd purchase and the whole…", "review": "This is my 2nd purchase and the whole process was as smooth as the 1st, from ordering to delivery, to the quality of the phone. Will most likely be buying again in the future and would not hesitate to buy from Back Market again.", "stars": 5, "review_id": 30765}, {"category": "Electronics & Technology", "title": "Recent purchase iPhone 15 Pro Max", "review": "Placed an order for an iPhone 15 Pro Max 21/12/24 and had it delivered in time for Christmas. I opted for the excellent condition in the options and wasn’t disappointed it’s in absolute mint condition, everything works as it should and I have a very happy daughter ", "stars": 5, "review_id": 30766}, {"category": "Electronics & Technology", "title": "This is my 5th order from back market", "review": "This is my 5th order from.back market, can't recommend them enough!.. item better than described ( as new ) and well.packaged and delivered quickly 😀 ", "stars": 5, "review_id": 30767}, {"category": "Electronics & Technology", "title": "Problem quickly and easily resolved", "review": "Bought a phone end of Sept - all good until early Dec when phone developed vertical lines on touchscreen and was clearly in need of repair. This was easy to arrange and extremely swift. Phone was repaired and returned within 4 days of posting and is now in great condition again.", "stars": 5, "review_id": 30768}, {"category": "Electronics & Technology", "title": "I had a great experience", "review": "I had a great experience. I selected an iPhone12 mini, the price was good, and the shipping was speedy. The phone is in very good condition and they also provided a case for it, which is a nice touch. The phone works great and the battery lasts a good amount of time. I have no complaints and would recommend.", "stars": 5, "review_id": 30769}, {"category": "Electronics & Technology", "title": "Excellent service", "review": "2nd purchase now, both purchases were easy straightforward and products were exceptional! Will use again for sure. ", "stars": 5, "review_id": 30770}, {"category": "Electronics & Technology", "title": "Great investment!", "review": "I have purchased several devices from Back Market over the past couple of years. So far, everything has been great quality and worked as expected/intended. Prices are brilliant compared to buying new and delivery has always been straightforward and timely. ", "stars": 5, "review_id": 30771}, {"category": "Electronics & Technology", "title": "Iphone", "review": "Bought an iphone from them and it came exactly as described - I opted for the 'very good' quality and there were no blemishes or other aesthetic issues. Despite not paying for a new battery, this one had a battery in it with 100% capacity. That said, it was not an official apple battery replacement, which the phone did have a warning message (that can be dismissed). This was not a concern to me, as it is really just a scare tactic by Apple to get you to use their parts, rather than cheaper third party parts. The phone won't be under warranty from apple, but then no third party refurbished phone will be. If you are looking at saving money, do your bit for the environment, and get a phone which to a layman is indistinguishable from the new version, give these guys a shot. I can't comment on returns policy etc as I have not used this service. ", "stars": 5, "review_id": 30772}, {"category": "Electronics & Technology", "title": "I thought it was a scam", "review": "If I have to write a long review, everything cannot be put down. So I will simply summarise my experience. I ordered an Iphone 16 Pro Max 256GB December 20 around 19:20. Playfully, phone got delivered the next day via DPD at 12:45. This speed was and is still unmatchable. Phone runs normal and performs excellently as would be expected. Battery health, of course 100%. First battery use, November 2024. Cycle count, 1, surprising. Needless to talk about cosmetic condition of phone as it is NEW: no single dent. About the colour: I think black titanium takes the lead for men as it appears mature and elegant.    At a little above 900 quid, it was a great buy. Initially, I thought it was a scam given the above price, but when I checked to see I was in Backmarket’s app, I was confident to go for it. ", "stars": 5, "review_id": 30773}, {"category": "Electronics & Technology", "title": "Galaxy Fold 4", "review": "Ordered a Galaxy Fold 4 in 'Fair' condition from Meelie Mobile on the 18th of December and arrived the next day mid-afternoon. Apart from a few micro scratches and bleam on the cover screen (which are only visible from bright indoor lighting and not visible when the screen is on) and a few minor marks on the body, the device was in solid condition; the inside folding screen is pristine. No problems whatsoever Overall a very good deal and would be from this store again.", "stars": 5, "review_id": 30774}, {"category": "Electronics & Technology", "title": "Got an iphone14 - Fantastic deal.", "review": "Got an iphone14, quick delivery and well packaged. I was delighted to see that the phone was visibly perfect,  and that all settings/data migrated easily from previous iPhone.All works properly, many thanks.", "stars": 5, "review_id": 30775}, {"category": "Electronics & Technology", "title": "Second phone I've bought from BackMarket", "review": "Second phone I've bought from BackMarket along with an iPad whether it's excellent/good/fair condition the products are almost always immaculate!! Any issues and the customer service team sorts it out ASAP and so efficiently without stress, I'm so happy as a customer of this company", "stars": 5, "review_id": 30776}, {"category": "Electronics & Technology", "title": "Purchased two items through back market…", "review": "Purchased two items through back market now and can only say so far reliable. Both items came in excellent condition for their prices and in very good time. Highly recommended ", "stars": 5, "review_id": 30777}, {"category": "Electronics & Technology", "title": "Just purchased a second iPhone", "review": "Just purchased a second iPhone, this time a 12 Pro for my partner (Xmas present) chose Good condition and it’s absolutely mint. Ordered Saturday 14th Dec,arrived 17th.Would not hesitate to get my next piece of tech from here.", "stars": 5, "review_id": 30778}, {"category": "Electronics & Technology", "title": "Great choice of ipads …", "review": "Great choice of ipads at a variety of prices.Arrived as expected, very well packaged.Great condition. Can't talk about battery life yet because haven't used it too much yet. Same for camera.Not expecting any issues as the rest is first rate.Highly recommend ", "stars": 5, "review_id": 30779}, {"category": "Electronics & Technology", "title": "This color appealed to me", "review": "This color appealed to me: only when I connected the phone, I had to wait until the end of December to update to \"One UI 6 Watch\".Plus, there is no original charging cable attached, so naturally it doesn't get full marks.", "stars": 4, "review_id": 30780}, {"category": "Electronics & Technology", "title": "The samsung A54 5G amazing phone comes…", "review": "The samsung A54 5G amazing phone comes in immaculate conditions. I'm not happy with the battery life, unfortunately. I'm using the GPS in the car sometimes, or I stay to Google something important and noticed the battery going flat very quickly. Oderwis the phone worth every penny ", "stars": 4, "review_id": 30781}, {"category": "Electronics & Technology", "title": "Pleased with the phone in general but I…", "review": "Pleased with the iphone 13 in general but I have experienced it going unresponsive a couple of times. I connected it to my imac and itunes to repair the fault and it hasn't done it since. Battery was at 90% health but has since dropped to 89%", "stars": 4, "review_id": 30782}, {"category": "Electronics & Technology", "title": "Excellent website", "review": "Excellent website, great machine, packaged very well and delivered quickly.  Only negative is that I should have been made aware that the machine isn't Windows 11 compatible, not a major issue for me, but it should have been stated.", "stars": 4, "review_id": 30783}, {"category": "Electronics & Technology", "title": "The phone I received was in great…", "review": "The phone I received was in great quality. To be honest I didn't expected it to be in such a good condition. Above all it was delivered on time as marketed by Back Market. ", "stars": 4, "review_id": 30784}, {"category": "Electronics & Technology", "title": "The item was as good as new", "review": "The item was as good as new. The delivery was fast. I will definitely buy from back market again and strongly recommend to my friends and family. ", "stars": 4, "review_id": 30785}, {"category": "Electronics & Technology", "title": "Very prompt delivery ", "review": "Very prompt delivery New phone meets expectations Trade in valuation lower than originalHaving difficulty in getting the refund ", "stars": 4, "review_id": 30786}, {"category": "Electronics & Technology", "title": "Best Purchase", "review": "Phone came in very good condition although battery life lower than anticipated. Works perfectly and absolutely no problems with it.  ", "stars": 4, "review_id": 30787}, {"category": "Electronics & Technology", "title": "Excellent!", "review": "Had a great experience with Back Market! The website is brilliant and very user-friendly, I was able to find what new iPhone I wanted and build it to my specification.The delivery was brilliant too. I placed my order on Friday 20th December, with a complete understanding of the order arriving after Christmas. However my order arrived on Christmas Eve! I was delighted, a lovely early Christmas present.My only criticism would be the accessory that was provided with my order. I believe I have been provided with an incorrect charging cable, as one end of the cable is not USB but I think the specification for an iPhone 15/16. Luckily, my current charging cable is in full working order and compatible with my new iPhone 14, so it’s not a big deal. I do feel it’s worth mentioning for future customers and to avoid any disappointment.Many thanks Back Market! You will be my first port of call for any brilliantly refurbished goods.", "stars": 4, "review_id": 30788}, {"category": "Electronics & Technology", "title": "Great sale", "review": "Great sale. Need to use a courier that doesn't leave a phone in a bin for me to happen upon. ", "stars": 4, "review_id": 30789}, {"category": "Electronics & Technology", "title": "Got a phone for my granddaughter and…", "review": "Got a phone for my granddaughter and she’s very happy with it. Sorry can’t tell you more as I’m not technically minded, but as she likes it I’m happy with that ", "stars": 4, "review_id": 30790}, {"category": "Electronics & Technology", "title": "The condition of the phone exceeded my…", "review": "The condition of the phone exceeded my expectations. Well done guys!", "stars": 4, "review_id": 30791}, {"category": "Electronics & Technology", "title": "A good deal", "review": "A good deal, could be better when not sold a UK product . Ie Selling a phone made for overseas market and then resold in the UK should not be allowed. They have certain missing parts, ie card sales use missing.", "stars": 4, "review_id": 30792}, {"category": "Electronics & Technology", "title": "The products was as described ", "review": "The products was as described , however I was unaware of the battery life.", "stars": 4, "review_id": 30793}, {"category": "Electronics & Technology", "title": "reliable mostly", "review": "Backmarket did not disappoint. products bought (2 phone and a laptop) were good as mentioned. I am happy. Highly recommend. Buy second-hand and refurbished and save the planet. ", "stars": 4, "review_id": 30794}, {"category": "Electronics & Technology", "title": "Very happy with Back Market and condition of products", "review": "Very happy with Back Market and their suppliers.  This was our second purchase both dispatched promptly by either Royal Mail Track 24 or 48 so reliable delivery and tracking.  Also condition as described and both better than expected.  Only problem was this was supposed to be Dual SIM (software says has two IMEI numbers) but the actual phone had the single SIM carrier installed (The downloaded manually clearly shows the difference).  Not a serious problem as my wife's earlier phone was also Dual so when overseas (we buy a local PAYG SIM for data & local calls) will work fine for us.", "stars": 4, "review_id": 30795}, {"category": "Electronics & Technology", "title": "Great product", "review": "Great product, and prices along with excellent  service ", "stars": 4, "review_id": 30796}, {"category": "Electronics & Technology", "title": "Good range at great prices", "review": "Was able to find the product I needed at a good price. Could do some comparisons but needed to head elsewhere to get detailed features and the full pros and cons of the product. Sold a previous phone and the information was good and reminders helpful regarding next steps. Second phone from Back Market and would recommend using them.", "stars": 4, "review_id": 30797}, {"category": "Electronics & Technology", "title": "The phone is in perfect condition and…", "review": "The phone is in perfect condition and arrived quickly. The only downside is that Apple have built in obsolescence to their phones, since the phone is too old to receive the latest iOS updates, and therefore we are unable to download some apps (like Audible from Amazon) onto the phone.  ", "stars": 4, "review_id": 30798}, {"category": "Electronics & Technology", "title": "Good service ", "review": "Condition of phone was as described, refurbished parts were not genuine but fit for purpose. The battery is lacking especially for someone who rarely streams, only has a hand full of apps and a few messages a day would be a busy day. The case and screen protector were ordered for convenience and can be found much cheaper elswhere. ", "stars": 4, "review_id": 30799}, {"category": "Electronics & Technology", "title": "Below expectations", "review": "I don’t know how to locate my original review to edit it. I’m posting this one month after purchase and 1 week of proper and consistent use…All looks good and works well except the battery, it doesn’t seem to last after a full charge, 3hrs or so after a full charge and use the battery is at 4%….also the volume button are not on correctly. Volume up does the opposite and vice versa. For the condition I requested and paid for I didn’t expect this.", "stars": 3, "review_id": 30800}, {"category": "Electronics & Technology", "title": "OK, but some major issues not picked up during quality check ", "review": "I would be a little bit careful as quality assurance needs to be improved. I ordered a refurbished phone and when I turned it on there was a notification saying that the phone 'no longer could detect liquid in the charging port'. The phone had clearly been submerged previously but this passed inspection.Was originally going for 1-star but I was given a no quibble refund (shows that they expect a level of issues) and I did buy some headphones which are fine.  Overall, supplier is probably OK if you are lucky enough to have your tech sold by someone who gives an honest view of issues but some major issues don't seem to be filtered out during processing.", "stars": 3, "review_id": 30801}, {"category": "Electronics & Technology", "title": "Sale of Samsung galaxy S21G ", "review": "Tried to sell a used mobile phone to Backmarket. Had a problem caused by myself, lesson learned by me. Did not know about the problem till I had word from music magpie regarding the issue. All sorted, however the return of my phone was not straightforward as it could have been from Backmarket. Hence the 3 star reviews. Made me think about using another company to sell my phone to.", "stars": 3, "review_id": 30802}, {"category": "Electronics & Technology", "title": "Postage was amazing", "review": "Postage was amazing. Cam way sooner than the estimated but how it was sent to me was unacceptable, I've made a number of purchases from back market all being great, this one was my most expensive and the packaging was awful one simple cardboard box and the item rattling round with only a bubble wrap sleeve over it. For the money spent this is unacceptable. ", "stars": 3, "review_id": 30803}, {"category": "Electronics & Technology", "title": "3 orders cancelled", "review": "I have ordered 4 items from backmarket in the last 3 months. First phone arrived and I was very pleased with it.I have made 3 more orders for an iphone SE in the last 2 months. Those 3 orders have all been cancelled due stock problems. I cannot contact anyone because their website does not allow you to send a message even though there are contact us tabs…. very poor service!!", "stars": 3, "review_id": 30804}, {"category": "Electronics & Technology", "title": "Unreliable condition ratings", "review": "I bought a smartwatch on a special deal advertised as “Excellent” condition for the price of “Good”. When I received the watch it had noticeable scratches on the body so it felt like I was deceived by the offer as I was expecting to receive an excellent condition product with almost no signs of use as their condition categories state.", "stars": 3, "review_id": 30805}, {"category": "Electronics & Technology", "title": "Korean phone", "review": "Ordered a S21 from them and when it came it was in Korean so the phone was not a uk model, took a while to sort it out but got there will not buy from them again as you don't know what you are getting or from what country ", "stars": 3, "review_id": 30806}, {"category": "Electronics & Technology", "title": "Poorer condition than ordered grade", "review": "Received two different iphone 13’s that were not in the condition I paid for. Although backmarket did offer refund or replacement, I would like to receive a phone in the condition that I pay for.Grades do not really mean anything to the company and there seems to be poor vetting on condition of devices sold. It’s basically a lottery draw as to whether or not the device you receive will be in good condition. ", "stars": 3, "review_id": 30807}, {"category": "Electronics & Technology", "title": "Phone is not for UK & EU users", "review": "Very fast turnaround. Good product description and affordable price. Unfortunately phone I purchased is meant to be used in US instead of UK and EU, therefore it doesn't have full system Lithuanian language package. It was a present to my family member who doesn't speak English. It is very disappointing and it is affecting experience having phone and not being able to understand basic settings.", "stars": 3, "review_id": 30808}, {"category": "Electronics & Technology", "title": "Purchased a refurbished Samsung in…", "review": "Purchased a refurbished Samsung in supposedly good condition,,,,,it took 18 hours to do a full charge and wanted to do continual software updates,,,,sent back for refund!   It's hit and miss as to whether you will strike lucky and get a decent running phone,", "stars": 3, "review_id": 30809}, {"category": "Electronics & Technology", "title": "When you pay peanuts you sometimes attract careless monkeys", "review": "The good parts... Very competitive price, fast delivery, physical condition of the device was far better than I was expecting.The mediocre part... The charging cable was about as useful as a chocolate fireguard. I haven't used a USB-A charger in 4 years. I have plenty of USB-C cables around so it's not a biggy, just annoying. The real pains in the bum.... The SIM tray was broken. It had either not been checked or whoever checked it broke it and thought \"Sod it, it's Christmas, I'm going home early...\" A replacement is easily sourced but it costs another £5.The phone was stuck in a boot loop. The sort of thing that happens when the battery runs out during an update. Having seen this sort of thing before it was sortable but took 20 mins to get to the firmware boot menu to do a factory reset. Edit: Corrected typos", "stars": 3, "review_id": 30810}, {"category": "Electronics & Technology", "title": "Love my laptop but phone went wrong and refused repair...", "review": "Bought a laptop (Dell Lattitude 5400) and it is awesome! However I also bought a phone (samsung galaxy S10), which came with a very tiny chip in the edge of screen. I decided to leave as I thought that was because I bought the lowest quality of product... Yet within 24 hours cracks had emerged across the entire phone... Was told I wasnt eligable for a refund by Backmarket after returning the device... Complete Waste of over £100 and they are not helping me with this anymore now... so not sure how I am meant to resolve the issue. ", "stars": 3, "review_id": 30811}, {"category": "Electronics & Technology", "title": "The phone iPhone 6s is always going off…", "review": "The phone iPhone 6s is always going off between 30mins to 60mins, I regretted buying it. Can you look into this for me ", "stars": 3, "review_id": 30812}, {"category": "Electronics & Technology", "title": "It didn't arrive on time", "review": "It didn't arrive on time or it wasn't given to the assigned neighbor and I lost the shipment to Argentina", "stars": 3, "review_id": 30813}, {"category": "Electronics & Technology", "title": "Samsung mobile phone", "review": "Lovely phone. Well packaged and arrived when expected the only thing was it came in a foreign language (Japanese ) and took me a while to work out how to set up in English.", "stars": 3, "review_id": 30814}, {"category": "Electronics & Technology", "title": "Wrong colour phone received ", "review": "4th time using BackMarket and 1st time not giving 5 stars. However I ordered an Orange Samsung phone and the one I received was the same model but Blue. My daughter specifically chose this phone as it came in orange and was disappointed that what she received wasn't what was ordered.", "stars": 3, "review_id": 30815}, {"category": "Electronics & Technology", "title": "I’ve been dying to get a MacBook Pro…", "review": "I’ve been dying to get a MacBook Pro laptop for years after my last MacBook stopped working, but they’re just so expensive. The Back Market made this possible for me! The only downside is the battery doesn’t last long and when I change the wallpaper of the screensaver, the Lock Screen refuses to change with it. That’s a bummer :-(", "stars": 3, "review_id": 30816}, {"category": "Electronics & Technology", "title": "As described", "review": "As described! The unit was not very good but good, the cable for charging nearly burned the house in the first charge, very cheap and cheerful charger, make sure you purchase your own charger if you purchase any product from Back market.", "stars": 3, "review_id": 30817}, {"category": "Electronics & Technology", "title": "Charging cables not working ", "review": "I bought 2 Apple Watches less than 3weeks ago. Both the cables for charging that came with the watches are not working. It’s really frustrating because I chose those watches because they were coming with cables ", "stars": 3, "review_id": 30818}, {"category": "Electronics & Technology", "title": "Insufficient protection of phone during shipping", "review": "I bought a smartphone model that has been out for 1 year. I selected the highest quality rating but was unpleasantly surprised by the packaging. It didn't arrive in the original box and included a low-quality charger. The phone was placed in a single layer of bubble wrap, and then inserted into a thin cardboard envelope. Though the phone wasn't cracked, I'm not particularly happy with the level of protection during shipping. From the information on the website, I thought it would come in original packaging with a higher-quality charger (I understand they don't actually commit to this - my point is that it was misleading to me). It seems that BackMarket doesn't have much control over its suppliers, so the quality and customer experience may vary. The support line was very fast to respond, but my only option was to return the phone. I would have preferred a discount or new charger given the quality was not what I expected. I would not buy from BackMarket again.", "stars": 3, "review_id": 30819}, {"category": "Electronics & Technology", "title": "We have ordered several items from…", "review": "We have ordered several items from BackMarket over three years.X2 iPads which arrived broken and had to be sent back to be fixed. One iPad came back fixed the other came back and has terrible battery life that only lasts an hour or so.This year we (stupidly) ordered AirPods for your ten year olds Christmas gift. Only one airbud works. We aren’t confident enough that the item will be repaired to a high standard so have opted for a refund and a lesson to not buy anything from BackMarket again. Customer services has never been an issues however the quality of their items has been the big let down. Be careful as you cannot be assured the quality of what you are ordering. ", "stars": 2, "review_id": 30820}, {"category": "Electronics & Technology", "title": "Outcome is hit and miss", "review": "Thought I'd give Backmarket a try as my phone broke so needed a cheap alternative. Ordered a Pixel 7 Pro described as \"excellent\". Phone arrived after some delays and came in a cardboard box with a charging cable. Condition of the phone was in no way excellent, scratches everywhere, dirt in all of the buttons and in the charging socket. Requested a refund, BM sent a postage label but wouldn't send a QR code meaning I needed to source a printer to return. Eventually managed to achieve this and everything refunded. Overall thought the idea was better than the product/service, wouldn't bother again and would just get something brand new. A lot of faff for a gamble of outcome. ", "stars": 2, "review_id": 30821}, {"category": "Electronics & Technology", "title": "Ordered new iPhone and went to transfer…", "review": "Ordered new iPhone and went to transfer but Bluetooth was turned off causing difficulty in transferring from our old phone. AVOID. Also paid for 24 hour delivery and didn’t arrive within that period either. Try UR dot com. Much better service! ", "stars": 2, "review_id": 30822}, {"category": "Electronics & Technology", "title": "Make sure you cover all bases ", "review": "I have used backmarket several times. I bought a ‘good’ iPhone (received May 24). The initial one was below advertised battery life, customer services were good and no problem rectifying this issue. I have always looked after my phones, and immediately put on a tempered glass protector and case as soon as I received it. A couple of blemishes were apparent but was in line with the ‘good’ description. I was fortunate to receive a brand new phone, so traded this one that I had for less than 7 months in. It had incurred no further damage and it had been well protected, therefore I expected the same category price for trade in. Packaged and photographed as requested, so was not happy to be shown a load of scratches and told it was not good but used and therefore a 20% deduction in offer made. I had photos to show how I had kept and packaged it, but be warned-you need to reflect light off the screen at all angles. I could not efficiently prove that the new scratches were not there prior to return, and therefore could either have the phone returned or take the lower offer. I did not damage the phone, but was backed into a corner as now it showed a scratch to the screen, nothing would be done as was one word against another (kicking myself my photos were not more comprehensive). Had several of the screen but not with the same light reflecting angle as provided back to me. Either I was sold the wrong grade phone originally (the other marks originally received had also been mentioned in counter offer) but also damage out of my control had been added. Two stars was for my previous experiences which were good, however this time I feel very duped! ", "stars": 2, "review_id": 30823}, {"category": "Electronics & Technology", "title": "Merry Christmas! ", "review": "Brought two refurbished iPads for the kids for Christmas. Each were fulfilled by two different suppliers. The one brilliant. The other fulfilled by clove technology was shocking! My daughter had opened it, turned it on, tried to charge it and it’s not not charging! Had it for all of 3 hours and now I’ve got to go through the process of sending it back and sorting it! Check who is fulfilling the order! Merry Christmas! ", "stars": 2, "review_id": 30824}, {"category": "Electronics & Technology", "title": "Warranty is worthless", "review": "The phone arrived quickly and worked as it should for 9 months. Then a fault appeared on the screen, a line or two of pixels stopped working. The phone had been kept in a case with a screen protector. On returning the phone  in my attempt to have it repaired under the warranty, backmarket advise that the phone is not covered without any explanation as to why. I would therefore say that the warranty is not worth anything so factor that into any decision on whether to buy from this company.", "stars": 2, "review_id": 30825}, {"category": "Electronics & Technology", "title": "TIME WASTERS", "review": "TIME WASTERSOrdered an iPhone 13 pink as a Christmas present for my daughter in a good condition. Was sent the midnight colour in a fair condition was all scratched around the lens of camera.Asked for replacement thinking they had possibly sent the wrong phone to receive a message that they could not do this and instead gave me a refund.Why advertise you have iPhone 13 pink in stock if you don’t?  They have wasted my time and I now need to find my 12 year old daughter another phone 5 days before Christmas not impressed ", "stars": 2, "review_id": 30826}, {"category": "Electronics & Technology", "title": "Not very consistant", "review": "Sadly the first order was a disaster. Customer service seemed to be more a robot with prepped answers rather than a human being. Wasn't much help at all. The first computer arrived non functional and two days later than it should have. Very badly packed, as if whoever sent it did not give one toss about how it would arrive. Pretty bad service for alot of money. It took two days of consistantly telling the customer service that I would like to send it back and have a refund. The customer service kept giving the same answer, that they would give me a replacement as soon as possible. I then after not receiving the help from the customer service, found where to demand a refund. As soon as I gave everything in, the customer service then replied. Again giving off the impression there was some jobsworth of a robot behind the customer service, and not a human being.The second order however arrived on time and actually works fine. The computer was correctly and carefully packed and I didn't have to wait on an unreliable customer service, so the second order was fine.So 50% hit or miss with the computer and not very helpful customer service.", "stars": 2, "review_id": 30827}, {"category": "Electronics & Technology", "title": "I bought a google pixel 7 pro phone…", "review": "I bought a google pixel 7 pro phone according to the title of the expensive website.The phone shows itself as pixel 7, I used the pixel 7 pro criteria when I went online to buy a phone case, I found that the product sent was bigger than me  The mobile phone🥲What is smaller than the pixel 7 pro and bigger than the pixel 7?  Why can't you, such a large website platform, be more careful and clear to tell customers exactly what product model shipments you are selling?", "stars": 2, "review_id": 30828}, {"category": "Electronics & Technology", "title": "Something seemed fishy. ", "review": "Actual laptop itself looks well and hopefully works well (will find out on girlfriend's birthday) but the order process was abysmal. I received an email a few days after ordering telling me my item had been dispatched - great! However, it didn't arrive when it said it would and I checked the tracking and it said it was delivered. It had not been.I waited a little longer and after about 2 weeks, I got in touch with customer service.After a few days of back and forth, they told me that the wrong tracking link had been applied to my order and then they provided me with a new one.Guess what? The new tracking link showed the parcel was only dispatched AFTER I got in touch with them to say my order had not arrived.I fear that if I had not actively chased this up, my order would have never been dispatched and I would be £500 down.Not good enough for such a large company. ", "stars": 2, "review_id": 30829}, {"category": "Electronics & Technology", "title": "The order and delivery of the Iphone 12…", "review": "The order and delivery of the Iphone 12 went very smoothly. The problem was that I had paid for a Premium condition phone as a new battery (100%) was important for me. When I had a minor problem on the day of receipt, I asked my local mobile shop for advice and found out that the battery actually had a 76% capacity despite settings showing 100%. I would like to point out that Jq Solutions had done the refurbishment for Back Market. Additionally the Iphone I received hadn't been reset fully and so I had problems doing the quick start from my old phone. Jq solutions did however refund the payment as requested without any query. It just was a hassle and I feel misled. ", "stars": 2, "review_id": 30830}, {"category": "Electronics & Technology", "title": "I spent £1,500 on a MacBook Pro Max…", "review": "I spent £1,500 on a MacBook Pro Max, and their customer service has been absolutely appalling. On day one, I already noticed battery issues, and after troubleshooting, I realized the charger they provided isn’t adequate for the machine—it simply can’t keep up with the power demands because the wattage is too low.When I reached out to their support team and explained the issue, I asked for a higher-wattage charger that would actually work with the device. Incredibly, they refused, saying, “We can’t guarantee the wattage type you will be sent.” How does that even make sense? If they’re selling a high-end product, they should ensure the included accessories are fully compatible.Instead of resolving the issue, they offered me a £25 voucher—which barely covers the cost of their lowest-wattage chargers. For a device like this, I need a charger rated at 100W or more, but they seem unwilling or unable to provide one. It’s unacceptable that they are advertising and selling such an expensive product without supplying accessories that actually support its functionality. This level of service is disgraceful.", "stars": 2, "review_id": 30831}, {"category": "Electronics & Technology", "title": "Phone was in a poor condition, refunded partly received so far", "review": "Phone was in a poor condition - case and screen scratched, old make up stuck in earpiece, battery health below 80%. Returned for refund but only part received so far as still waiting for buyers fees to be refunded. Not a great experience and wouldn’t use again as the gamble of getting a poor phone isn’t worth the time taken. Fast postage though! ", "stars": 2, "review_id": 30832}, {"category": "Electronics & Technology", "title": "Battery on I phone lost 10% within 2…", "review": "Battery on I phone lost 10% within 2 weeks from 92 to 82. The process of having to send your phone back is not great. What do they expect you to use in the meantime?They shouldn’t be sending phones out with poor batteries that fail within weeks.If you could take somewhere local for battery replacement within a few hours then that’s better service The phone is in good condition, but one of the leads provided is faulty aswell.If backmarket can offer a practical solution for the defective battery, then I’d be happy to write a new review ", "stars": 2, "review_id": 30833}, {"category": "Electronics & Technology", "title": "Back Market is now a very bad company to deal with.", "review": "I have previously purchased four refurbished iPhones, from Back Market, since June 2021, without any problems, but things have definitely got worse, this year.I recently purchased a refurbished iPhone 14 Pro, and traded-in my iPhone XR, for £69.00. All previous trade-ins have been paid into my credit card account, but this year, they are insisting on me providing my personal bank account details, and for some inexplicable reason, my date of birth.As I have never given them my date of birth, how can they possibly verify it?With so many scams going around, I am not willing to provide my personal bank account details, and have therefore insisted that the refund my £69.00 into my credit card account, from which they deducted all payments, from my previous purchases.They send me text messages, and emails from addresses that are not valid to respond to, and they keep bouncing back, unanswered, making it impossible to communicate my concerns to them.I will never use Back Market, EVER AGAIN. And I only write this review, to hopefully warn others from doing so, and suffering the same problems.", "stars": 2, "review_id": 30834}, {"category": "Electronics & Technology", "title": "Refused my bank cards for a purchase…", "review": "Refused my bank cards for a purchase and asked for ID documents to 'unblock' instead of using the 3D secure systems implemented by the bank... yeah right scammers you're not stealing my data", "stars": 2, "review_id": 30835}, {"category": "Electronics & Technology", "title": "Awful customer service and will not be…", "review": "Awful customer service and will not be using again.  Too many providers who over estimate damage and condition and any refunds magically have disappeared.  Not good been given the run around and not good to have any complaints system or redress.  If you do buy do not use Klarna and ensure it is on your credit card so that the banks can help you and assist. ", "stars": 2, "review_id": 30836}, {"category": "Electronics & Technology", "title": "Hardware fault on the device", "review": "Ordered an iphone 13 for my daughter's birthday, set it it all up but then there was an error connecting to the network for calls and data. Needed a software update which stuck on verifying update.  Had to spend over an hour on the phone to apple diagnosing the issue which turns out to be a hardware fault on the device so I've had to return it and see what happens.  ", "stars": 2, "review_id": 30837}, {"category": "Electronics & Technology", "title": "Frustrating returns policy!", "review": "Happy enough with my purchase, but I cannot get a refund on my old phone (which they agreed WAS worth something!) without giving over SO much personal information. Frustrating!", "stars": 2, "review_id": 30838}, {"category": "Electronics & Technology", "title": "Not a good experience of a Samsung watch ", "review": "I didn't really expect a watch that cost a bit to need charging every 18 hours, it also looses connection with my mobile and therefore is useless until I reconnect. Should have done more research before I bought.", "stars": 2, "review_id": 30839}, {"category": "Electronics & Technology", "title": "Disappointed with battery quality.", "review": "Disappointed with battery quality.Present bought for Christmas, and the cosmetics of the phone is very good.Battery health was less than 80% which if I was to sell would be a faulty phone but sold to me as excellent.There is an option to pay for a new battery which I will now have to source elsewhere, but it's a little cheeky to sell a device as excellent that would be classed as faulty.", "stars": 1, "review_id": 30840}, {"category": "Electronics & Technology", "title": "Avoid at all costs", "review": "Avoid at all costs. This company pretends to be friendly and fun with their sickening copy; however beneath if they’re just a dodgy company selling broken gear. Spent £800 on a MacBook only for it to break as soon aa its “warranty” expired. A one year warranty is all the confidence they have for their cobbled together damaged goods. Please avoid at all costs. ", "stars": 1, "review_id": 30841}, {"category": "Electronics & Technology", "title": "So far selling my devices to backmarket…", "review": "So far selling my devices to backmarket is an absolute s…show. Selected send it with their kit that hasn’t arrived after few days, ok bought packing went to post office to send it with prepaid label to find out I need to print it myself as they are to cheap to send you a bar code so they can print label for you in post office. Instructions are not clear enough.", "stars": 1, "review_id": 30842}, {"category": "Electronics & Technology", "title": "Professional thieves(Back Market)", "review": "Fraudulent sale. Sold MacBook to me without permission previous owner. MacBook blocked as soon as i used my Apple ID, contacted back market to resolve this issue. They refused to take action as they have no solution. Because they didn’t ask proof of purchase from previous owner. My money and time waisted. Now no one here to help. Contact CEO of Back market. Since two months. He didn’t even bother to reply. Beware from these professional thieves ", "stars": 1, "review_id": 30843}, {"category": "Electronics & Technology", "title": "I recently bought an iPhone 13pro…", "review": "I recently bought an iPhone 13pro excellent condition. When you come to external part it looks good but guys inside is a mess like everything is touched and works only for a couple months then you will start seeing stopped working camera stoped working a couple moth ago and the screen gone today and I paid 100£ to fix and what a waste of money, I also get some pictures of their experts working at home( seriously) it basically refurnished in a small repair shop  ", "stars": 1, "review_id": 30844}, {"category": "Electronics & Technology", "title": "Flouting GDPR rules", "review": "I purchased a phone. A few weeks later I started to receive marketing emails from Back Market. I specifically recall making sure I didn’t sign up to receive marketing emails or sign up to any mailing lists. The marketing emails don’t even contain an unsubscribe link, which is very frustrating. Automatically adding a customer to your mailing list is a breach of GDPR. Not including an unsubscribe link in your promotional emails is also a breach of GDPR. Learn the rules guys! I don’t want your promotional emails, that’s why I didn’t sign up! Respect your customers’ privacy.", "stars": 1, "review_id": 30845}, {"category": "Electronics & Technology", "title": "Awful!", "review": "Having bought two products from Back Market, and both being in awful condition (despite selecting excellent condition in both cases), I urge users not to purchase from Back Market.To make matters worse, the latter product (an iPhone 14) appeared fine on arrival, only to gradually discover internal faults. But because I have issued an official repair on the back screen, both Back Market and Click 2 Go have wiped their hands of me and the warranty, resulting in me having a rather expensive paperweight. For added context, the reported issues were discovered by Apple themselves and are in no way linked to the minor crack of glass I had replaced on the reverse of the device.Whilst I'm convinced my opinion is nothing for a company of the likes of Back Market, I will never buy anything from Back Market again. Awful service, awful products and awful experience!", "stars": 1, "review_id": 30846}, {"category": "Electronics & Technology", "title": "Slow and disappointing ", "review": "I ordered a Samsung Galaxy S23 FE. I spent a day trying to trouble shoot a non-functioning camera and also realized the fingerprint scanner wouldn’t work.You have to go through the process of return and go back and forth with a third party seller. For that you have to take pictures of the phone to cover your back, make sure to reset the phone and package it really well to make sure that there are no disputes over the damage.Once all of that was done I didn’t hear from them after the stipulated period. So I had to chase them to find a solution, because the third party seller was radio silent.When I asked them how could I get a guaranteed functional phone from them they told me that there is no such things. So if I wanted to get a similar phone I’d have to buy it with this knowing that this is likely to happen again.To add insult to injury I lost the possibility to buy another phone in payments because this used up my Clearpay credit.I would heavily advice against using Back Market, as their customer support is very poor for such a complicated process. They offered a 5% discount which is even less that the sign up discount.A joke.", "stars": 1, "review_id": 30847}, {"category": "Electronics & Technology", "title": "DO NOT TRADE IN YOUR OLD PHONE - IT'S A SCAM", "review": "Bought new phone which was fine. BUT trade in for old phone is a scam/fraud.  Do not trade in your old phone through them.  They quote a high initial offer and then when they receive your phone derisory counter offer saying there are issues.  There were no issues just an old phone which they know when they provide the initial offer.  My details said on the tracking that I accepted their counter offer - I did not.  It does not even provide a date when this activity happens.  I kept rejecting as was horrified by their appalling counter offer.  They should be sending my old phone back but no response yet - seems to be a concerted effort to not do this due to cost at their end.  With my experience to date I would not trust them and will never purchase anything from them ever again. ", "stars": 1, "review_id": 30848}, {"category": "Electronics & Technology", "title": "POOR SERVICE", "review": "The phone I purchased is fine. However back market did not send out the packaging for the trade in phone or return label. The person who was emailing me Ebru has been so unhelpful and hasn’t answered my questions. He states the only way I can have the packaging sent out if I purchase something else. POOR SERVICE! ", "stars": 1, "review_id": 30849}, {"category": "Electronics & Technology", "title": "We don't know where your phone is !!!", "review": "Ordered a phone for nearly £700 for delivery.No sign of delivery so I chased the company.Response was - it may have been shipped - it may not have been shipped - it may have been shipped but no tracking - well in any case I do not have my phone!So now the option is - we can refund (another 5 day delay) and then you can order again!!!Not a great service and so far extremely poor customer service!", "stars": 1, "review_id": 30850}, {"category": "Electronics & Technology", "title": "Unable to update address or cancel order", "review": "I placed an order, but my computer automatically entered the wrong postal code. Immediately after completing the order, I attempted to update the address or cancel it, but I wasn't allowed to do so. I then requested a refund; however, I cannot apply for the refund until the item is delivered, even though the phone hasn't been shipped yet. The problem is that it will be sent to the wrong address, and I'm unsure if I'll receive it. ", "stars": 1, "review_id": 30851}, {"category": "Electronics & Technology", "title": "I strongly do not recommend this store!", "review": "Hello,I wanted to make a gift for my husband and placed an order for a phone on December 19th. I chose this website only because of the promise to deliver it before Christmas. But since December 20th, the package hasn’t moved.I contacted customer support, but they said I have to wait until December 31st. This means there’s a chance I won’t even receive it by New Year’s.I strongly do not recommend this store!", "stars": 1, "review_id": 30852}, {"category": "Electronics & Technology", "title": "TERRIBLE!!", "review": "TERRIBLE!!! I emailed a million times about getting a faulty phone they sold me either fixed or to get an exchange, finally I requested a refund due to getting incredibly frustrated because no one would answer emails. It's so frustrating  because I've wanted to buy family members refurbished phones and every time I would look for some online it would always be with back market however I refuse to give them any more money as they did so little to help me. With their product. Sold faulty. Fell on deaf ears, incredibly frustrating experience lasting months as I would try again every few weeks. ", "stars": 1, "review_id": 30853}, {"category": "Electronics & Technology", "title": "AVOID AT ALL COST", "review": "AVOID AT ALL COST - absolutely miserable company with no existent customer service help . Two phones as Christmas gift for my kids - one was changed to lower grade after the purchase , for the same price - when I complained they said everything is fine I did purchase the wrong grade 👊🏻. However the phones never arrived, despite sent by 24hrs RM service, tracking freezed from 19 to 29 dec , goods at Romford RM but on 29.12 it changed to delivered on 20.12!!! Response from these misfits is : it is on the way to you wait if the tracking change in next 6 working days and if not we will look into it ! It is 2 weeks already!!! So my kids have no phones no Christmas presents and I dont have my £300 to buy the phones elsewhere. Thank you miserable low life people!!!AVOID-AVOID-AVOID-AVOID-AVOID-AVOID ", "stars": 1, "review_id": 30854}, {"category": "Electronics & Technology", "title": "You'd better hope your product isn't faulty...", "review": "I bought a phone in October 2024 and by November 2024 the screen had broken while I wasn't touching it. I had set it aside to use as a timer, came back to it and a chip had appeared, damaging the top half of the screen. I returned it for repair under warranty and they refused to fix it, saying I had damaged it and essentially  accused me of lying about how it was damaged. It seems they will say anything to worm out of a warranty. They then suggested I use their partner company to get it fixed (what a suprise), and gave me a very small 5% discount to buy more things from them! If they think they are getting any more money off me then they have their wires crossed. Seeing as their warranty means nothing to them, I got it fixed elsewhere, who confirmed that the damage was on the inside of the screen and more importantly believed me in how the damage happened, and now I have it insured so I never have to have anything to do with them again.", "stars": 1, "review_id": 30855}, {"category": "Electronics & Technology", "title": "Delivered me a broken phone and refuse…", "review": "Delivered me a broken phone and refuse to replace or refund.Use music magpie instead, they are much safer.", "stars": 1, "review_id": 30856}, {"category": "Electronics & Technology", "title": "Supposed to be A grade, but it’s broken ", "review": "Ordered phone to be as Christmas gift, paid quite a lot of money for phone which supposed to be in excellent condition. When transferring data, phone frozen first time and snow subsequently frozen multiple times within last 24 hrs with same issue. Absolute rip off, never again.", "stars": 1, "review_id": 30857}, {"category": "Electronics & Technology", "title": "Shite", "review": "2020 macbook came in the space bar along with the caps lock do not work.Item is terribly dirty with crumbs completely engulfing the keyboard. Hopefully i can get a worthy replacement.", "stars": 1, "review_id": 30858}, {"category": "Electronics & Technology", "title": "i have placed the phone order on 21st…", "review": "i have placed the phone order on 21st Dec and pay for  express delivery & haven't received till 27th December.  called the DPD delivery and they advised that the parcel will be delivered today but nothing came. called them back again and this time they said that the parcel went back to depot!!!!  and also send  a message to back market and they cant help either..... worse customer service... AVOID", "stars": 1, "review_id": 30859}]