[{"category": "Media & Publishing", "title": "Bought a new phone with number", "review": "Bought a new phone with number.   Now locked out of my Amazon because I cannot verify my account with the two stage process due to no longer having my old number.  Rang Amazon to help.  Told me they would call back within 24 hours, they didn't bother!  That's fine.  It prob does me a favour as they are massively over priced on everything.   Goodbye Amazon.  I was a big shopper with you.  Dumb move on your part.  P.s.  because you didn't value my custom I have now cancelled my years old prime account.   See ya! ", "stars": 5, "review_id": 81520}, {"category": "Media & Publishing", "title": "Great delivery drivers ", "review": "I have been ordering from Amazon for several years, usually receiving 2 to 3 deliveries a week. The delivery drivers always deliver with care and ensure that they close the gate behind them. I see many bad reviews on this site however my experience is the opposite. Amazon is a favourite shop of mine and I am happy to continue buying from them.", "stars": 5, "review_id": 81521}, {"category": "Media & Publishing", "title": "I have been a happy business customer for over 6 years.", "review": "I have been a business customer for over 6 years. Impeccable service, when a problem occurred, I called customer service and the problem has been solved instantly. ", "stars": 5, "review_id": 81522}, {"category": "Media & Publishing", "title": "Best support you can expect!", "review": "Best support you can expect!There have been several times that I received services from them, more than what I needed. ", "stars": 5, "review_id": 81523}, {"category": "Media & Publishing", "title": "No issues with Amazon", "review": "No issues with Amazon. Any problems I have are usually rectified right away, like I just ordered an Air Mattress that wouldn't inflate, I asked Amazon and it was an instant \"hey send it back and we'll give your money back\", which they did. Thank you!", "stars": 5, "review_id": 81524}, {"category": "Media & Publishing", "title": "Amazon is amazing", "review": "Amazon is amazing! I have Amazon prime and I cannot fault them for the value for money I get from Amazon Prime and also the customer service! It is second to none. I’ve had to return 2 items in 2 days but no questions asked and money returned. Love you guys ❤️", "stars": 5, "review_id": 81525}, {"category": "Media & Publishing", "title": "Excellent delivery times to correct…", "review": "2 No. products ordered, kept informed throughout of delivery time, date etc, etc. 1 No. to home address, product carefully left, out of sight, safe at top of steps (Nb. Upstairs flat), the other in a \"storage type\" delivery unit, a 10 minute walk away, FOC.  Both delivered within 48 Hr's, no issue", "stars": 5, "review_id": 81526}, {"category": "Media & Publishing", "title": "Their customer service is second to none ", "review": "Their customer service is second to none, sorted my problem out within 24hrs.Redelivered package by amazon prime after evri messed up.Fully recommended ", "stars": 5, "review_id": 81527}, {"category": "Media & Publishing", "title": "Accidental refund with carlos", "review": "When I called because I got an accidental refund, a very nice man named Carlos answered and was very patient, aware, and willing to help. He sounded very humble and human whilst other customer service numbers are mainly people who sound like their on auto-pilot. Still nice, but not very engaged. Carlos helped me figure it out, while being respectful and helpful. He had lots of nice energy even though its 9 at night, and he had most likely been answering phones all day", "stars": 5, "review_id": 81528}, {"category": "Media & Publishing", "title": "Exceptional Service and Fast Delivery", "review": "I’ve had a consistently great experience with Amazon. Their delivery is always fast and reliable, and the packaging keeps my items safe. I appreciate the variety of products available and the convenience of shopping from home. Customer service has been excellent whenever I’ve needed help, resolving any issues quickly and efficiently. ", "stars": 5, "review_id": 81529}, {"category": "Media & Publishing", "title": "My go to for fast deliveries", "review": "Ordered so much with Amazon over the years using the prime service. Very rarely have a bad experience with deliveries. Returned a few items with ease and always refunded quickly.", "stars": 5, "review_id": 81530}, {"category": "Media & Publishing", "title": "Top Rating", "review": "I give Amazon a top rating for their professional service and empathy.However, 3rd party sellers are advertising 190gr Baileys Original Irish Cream Chocolates through Amazon, but if you order from them, you will not receive what you ordered, instead, as i have experienced twice in one week, cheaper Baileys chocolate collection. Jolafunbs sent 175gr of cheap chocolates, and Bargain Depot sent 190gr of the same cheaper ones. I urge you to avoid these two, there might be more out there, at all cost. The chocolates are non returnable. No matter how tempted you are, don't touch them!", "stars": 5, "review_id": 81531}, {"category": "Media & Publishing", "title": "Amazon have been great and a life saver…", "review": "Amazon have been great and a life saver for me. I have been ill not able to leave the house so have ordered lots in the run up to Christmas. Always notified of deliveries and have always turned up. Only had one issue with a beauty product which was sorted straight away.", "stars": 5, "review_id": 81532}, {"category": "Media & Publishing", "title": "Great Experiences with Amazon", "review": "I cannot say enough about Amazon.  I have had a membership there for many years and while it was challenging at first, there is nothing I have experienced that has been problematic.  There have been a few glitches and this is a part of life and learning.  But overall I am grateful for the service (despite rising membership fees :() and for the products.  At the end of the day, it is always \"buyer beware\" so you have to know what you are purchasing.  ", "stars": 5, "review_id": 81533}, {"category": "Media & Publishing", "title": "Amazon is the best way to purchase in USA, I’m a handicapped and I got anything I need from it, prices are perfect and if I don’t like the item I can returned. Also is free delivery on time with an sm", "review": "Amazon is the best way to purchase in USA, I’m a handicapped and I got anything I need from it, prices are perfect and if I don’t like the item I can returned. Also is free delivery on time with an small monthly payment membership , that same membership allowed me to watch television programs and movies every day . They offered so much for so little money membership that I wonder how they make Bezos a millionaire. ", "stars": 5, "review_id": 81534}, {"category": "Media & Publishing", "title": "I love AMAZON!", "review": "I love AMAZON!Been using them for many years and never had any issues!Vast arrange of products at great prices!Great customer service and no issues at all!Easy to return faulty items etc!All good as far as I am concerned!", "stars": 5, "review_id": 81535}, {"category": "Media & Publishing", "title": "I had an issue with a gaming headset…", "review": "I had an issue with a gaming headset that I purchased for my child. The mic stopped working. I reached out to customer services and was helped by Yuna. Yuna efficiently sorted the issue and had the item replaced. He was very helpful and got this done within a matter of days. Great staff member. Thank you Amazon", "stars": 5, "review_id": 81536}, {"category": "Media & Publishing", "title": "Dont know why it's bad reviewed.", "review": "Dont know why it's bad reviewed.The delivery is always fast, the products are from different sellers, or directly from amazon.Products that I bought directly from amazon, like echos or their basic products, are really high quality.", "stars": 5, "review_id": 81537}, {"category": "Media & Publishing", "title": "I check Amazon for all my needs", "review": "I check Amazon for all my needs, good prices, great products and fast secure delivery options that fit my needs", "stars": 5, "review_id": 81538}, {"category": "Media & Publishing", "title": "I have been using Amazon for a couple…", "review": "I have been using Amazon for a couple of year now and never had a problem. Everything I ordered I got so I can't complain", "stars": 5, "review_id": 81539}, {"category": "Media & Publishing", "title": "I have used amazon in many countries", "review": "I have used amazon in many countries. I mostly use prime items and i'm happy with this. That being said, even with the prime membsership i have noticed that shipping can take almost a week, which i don't think is justified.I also wish they would use more adapted packing box. So much waste.Now, the customer service is great, i have had many issues with broken packages, missing packages, faulty items ... they also act very quickly.", "stars": 4, "review_id": 81540}, {"category": "Media & Publishing", "title": "To long of a wait", "review": "I have enjoyed prime but it takes forever now to receive orders/packages.  But I do love when they take a picture once delivered at your door.  Hopefully they will get better.", "stars": 4, "review_id": 81541}, {"category": "Media & Publishing", "title": "Been using Amazon for many years", "review": "Been using Amazon for many years.  While product reviews are questionable (watch out for low review counts with high star averaged), I'm continually impressed with Amazon's performance (shopping, order, bill, ship, email updates), as well as their shipping partners' performance (UPS, FedEx).  Pay attention to whether the product ships from an Amazon fulfillment center, or instead, remote 2nd party vendors -- delivery experience will be drastically different between these two, even for long time Prime members).  But in all fairness, 2nd party vendors are often just using Amazon for product visibility for selling purposes.  Amazon is not directly responsible for 2nd party vendor performance.  On the other hand, Amazon should be using poor customer reviews for purposes of removing them from the site because it makes Amazon look bad.......just sayin.  If you want the Amazon name to remain untarnished, get ride of bad sellers  or bad products.", "stars": 4, "review_id": 81542}, {"category": "Media & Publishing", "title": "I think you should box all your orders", "review": "We've not really had problems with Amazon before but we ordered my son something for Christmas and it came in its own box, not hidden in an amazon box. I just think with what time of the year it is, you'd be discreet. I was lucky enough to hide the present just as he walked through the door.I've given it 4 stars because we've never had a big problem with Amazon, this isnt a big problem as such but I just think that you should box every parcel, just to be safe.Id of been gutted if he had saw it as he doesn't know we was able to get it. ", "stars": 4, "review_id": 81543}, {"category": "Media & Publishing", "title": "Good delivery schedules", "review": "Made several purchases in the run up to Christmas and have found the deliveries very efficient considering how busy they must be (prime customer). All but one on time.Lots of moans on this site about quality and returns. Do some research on the description and see that yes there is a lot of Chinese c**p. You buy cheap expect cheap!", "stars": 4, "review_id": 81544}, {"category": "Media & Publishing", "title": "Find anything on Amazon", "review": "Still can find anything on Amazon. Shipping is taking longer now.", "stars": 4, "review_id": 81545}, {"category": "Media & Publishing", "title": "It's a great experience such a great…", "review": "It's a great experience such a great things to buy here and get finally some great website..", "stars": 4, "review_id": 81546}, {"category": "Media & Publishing", "title": "I use amazon regularly", "review": "I use amazon regularly, always next day. Only improvement, some delivery driver don't use door bell and put parcels in full display of public. This cause issue on once occasion but amazon sorted it.", "stars": 4, "review_id": 81547}, {"category": "Media & Publishing", "title": "Be careful ", "review": "I have just ordered a product on Amazon which said free delivery.Somehow I was joined up for prime delivery and charged £8.99 for the month.Contacted customer service and got the money back straight away but be careful it has happened before.", "stars": 4, "review_id": 81548}, {"category": "Media & Publishing", "title": "Can't beat reliability - although corporate greed", "review": "Not always the best prices these days, but usually very good. Good selection. Fast delivery and seldom a problem with delivery. Good complaint process. Heard complaints from sellers about making it hard for them to sell and sometimes impossible. And heard about poor employee working conditions.", "stars": 4, "review_id": 81549}, {"category": "Media & Publishing", "title": "No Problems to Date", "review": "No Problems to Date. Never had a problem yet and used many times. Perhaps some just 'moan' for the sake of it or try to get 'something for Nothing' deals. This December Amazon ships out some deliveries, in our case to Royal Mail who have also been very good. Beats trailing round the shops during festive periods, although some people just like going out for the 'hell' of it.", "stars": 4, "review_id": 81550}, {"category": "Media & Publishing", "title": "I purchase a lot of gear off Amazon…", "review": "I purchase a lot of gear off Amazon from electric bikes to screws. I always give an honest review of my purchases so others can gauge the quality. However I’ve noticed lately that Amazon doesn’t  like negative reviews and I’ve been emailed to say my review broke their community guidelines. I do not swear. I am not entirely scathing. I leave them some wriggle room. This has put me right off Amazon as I feel I cannot trust their reviews if people can’t tell the truth. ", "stars": 4, "review_id": 81551}, {"category": "Media & Publishing", "title": "Amazon for the win!!!", "review": "Amazon for the win!!!Now that I no longer work for the Post Office as a rural carrier, I really enjoy online shopping!!  Nice to have everything at your fingertips!", "stars": 4, "review_id": 81552}, {"category": "Media & Publishing", "title": "Airpods nopods", "review": "OK, i use Amazon a lot and 99% of the time no issues at all. Recently we bought some airpods for £179 they sent a £15 copy which we sent back and they sent the right ones, all happy and thought brilliant. Out of the blue an email saying we will be charged as have not sent back original ones. We have proof of postage we have all the evidence but it has taken a ridiculous amount of time and effort to explain the distance selling law to Amazon that if you send the wrong item you have to accept a return and provide the right one. Eventually had to email executive team and even they seem to be righteous saying 'you will not be charged for replacement' So overall a great platform but need to tidy up the customer service end. ", "stars": 4, "review_id": 81553}, {"category": "Media & Publishing", "title": "I find the company to be overall in tune with customers needs", "review": "Speaking purely as a buyer (never sold on the platform), I've found them to be responsive to customer issues and problems, not that I've had many. A few times damaged goods over many many years of using Amazon, in each case it's been resolved promptly and with minimal of fuss.I know it's a bit company and I'd like to see more competition, but I at least feel mostly confident buying items there, v something like eBay which is very mixed in terms of users and sellers, some good ones and some awful ones who sell fake goods etc.I'm mostly happy, though the recent hike to £35 for free delivery is a bit much I think (used to be £25)", "stars": 4, "review_id": 81554}, {"category": "Media & Publishing", "title": "Good service, but a near monopoly", "review": "Amazon has good service, but is a virtual monopoly! Also after seeing what sells well, they compete with those individual sellers with Amazon Basics sales.", "stars": 4, "review_id": 81555}, {"category": "Media & Publishing", "title": "Service seems to be on the decline", "review": "I rarely have issues with buying anything on Amazon and vast majority of the time the item I get is pretty good. That's where I would differ from most people's complaints. I would say the biggest issue is that I think their service might be on the decline. I remember once upon a time I could order an item and usually get it next day, sometimes two days, but now I seem to have to wait more than that. What happens a lot now is that I'll order an item that says it will come tomorrow, just to get an email later saying it'll be delayed for another day or longer. Didn't used to be like that. Amazon might be on the decline.", "stars": 4, "review_id": 81556}, {"category": "Media & Publishing", "title": "Amazon is worthy for all shopping needs!", "review": "the variety, reasonable prices amazon has items robust retro seekers like myself finds the very best of items from retro clothing to their vast amount of other preowned items you can trust. I trust Amazon with my delivery!I dont like that they do not knock on the door as I ask!! Notify the receiver always that the package has been delivered!!", "stars": 4, "review_id": 81557}, {"category": "Media & Publishing", "title": "They offer a great variety of products", "review": "They offer a great variety of products.  I live in a rural area with not many stores (there is just one gas station/store in the town I live in), and Amazon offers quite a bit.  The only problem I have with Amazon is that they do not let me review products anymore after I gave a good review of a health food product a few years ago.  The BBB was not able to do anything about it.  I used to sometimes get a few freebie products (not many, just a few) due to reviews and was one of the top reviewers for dog products.  Being on a budget, I appreciated being a top reviewer.  I still do not understand why they removed me from being a reviewer, their customer service staff could not tell me, and did not reinstate me.", "stars": 4, "review_id": 81558}, {"category": "Media & Publishing", "title": "Prime customer for several years now. I have Generally had a good experience. ", "review": "Been a prime customer for years. Have placed over 60 orders so far and most of the time I have had no problem with them. Next day delivery parcels have arrived safely at my door 90% of the time. The only complaint I have is that a few weeks ago an item was clearly delivered to a wrong address yet when trying to get in touch with customer service I was met with a bot telling me I have to wait 4 days before I can raise a claim or request a replacement/refund. ", "stars": 4, "review_id": 81559}, {"category": "Media & Publishing", "title": "Would have been 5 stars ", "review": "Would have been 5 stars , but now you cant get next day delivery with prime I go to the stores for parts and anything I need in a hurry , Amazon have shot themselves in the foot with prime now taking days to arrive and not next day.", "stars": 3, "review_id": 81560}, {"category": "Media & Publishing", "title": "Next day (get it tomorrow) not reliable", "review": "Amazon is my main source or retail. They have done some amazing things; however, they over promise a lot.  Recently, and several other times before, I get in a rush for things. Maybe a show or a party, in this case, a house warming party.  We could have gotten all the the items from local retailer (which we did) but we first tried filtering by receive tomorrow in Amazon. We only chose our items form items that would be delivered the next day as we must absolutely have them the next day.  Guess what?  They didn’t arrive.  At last minute, they say now arriving the following day. Well we only ordered those products because they were promised to come the next day. We even adjusted our quantify so it would arrive in time. It didn’t. So, I have to say, relying on Amazon for something  you absolutely need now or tomorrow, not a good system. Amazon is still good for those items you don’t need rushed.  But if you need it tomorrow, shop local.  ", "stars": 3, "review_id": 81561}, {"category": "Media & Publishing", "title": "No after sales care", "review": "The delivery times and range of Amazon products are great. However, my biggest complaint is the lack of after care sales by Amazon. You would be under the mercy of third party sellers (usually overseas sellers) who do not wish to comply with Australian Consumer Rights laws. Amazon washes their hands on any responsibility of the products they have sold and made a profit on when problems occur. I don't buy any more expensive electrical or electronic items from Amazon anymore because I have been caught many times.", "stars": 3, "review_id": 81562}, {"category": "Media & Publishing", "title": "Very good when it goes wright but…", "review": "Very good when it goes wright but customer service very poor, complaints do not seem to be ALLOWED.", "stars": 3, "review_id": 81563}, {"category": "Media & Publishing", "title": "Shipping takes forever", "review": "They can never commit to the indicated delivery date. I ordered a package last week, with a promise delivery date of today. When checking my order status on Amazon, it states that it will be delivered today, but when I check the courier website, it mentions that the package will not arrive earlier than thrusday... I used to believe that Amazon was doing a great job delivering packages fast, but seems it's going downhill fast... They should start doing some decent screening of their third party sellers, because they are ruing it for Amazon.", "stars": 3, "review_id": 81564}, {"category": "Media & Publishing", "title": "Eh it’s ok", "review": "A great app however, the customer service is not so great. It’s nice that I can go here for conveniency however, I feel like it’s causing a lot of the world pollution.", "stars": 3, "review_id": 81565}, {"category": "Media & Publishing", "title": "Hundreds of £ refunds never issued!", "review": "I love the service generally, but really disappointed to find that I had to look through all my refunds to make sure they've actually given me the money back. I found £400 of stuff they they're received but never sent me the money for! God only knows what else they've not actually refunded me for.", "stars": 3, "review_id": 81566}, {"category": "Media & Publishing", "title": "Need to invest in better customer service ", "review": "When things are going well, then Amazon is good. But, once things go wrong, you can find yourself catapulted into a nightmare world where the system does everything it can to stop you talking to someone who might help. If you do actually get through to a human being, they keep going round the loop of verifying your account and then inexplicably can't do it so can't help. .", "stars": 3, "review_id": 81567}, {"category": "Media & Publishing", "title": "Amazon will tell you lies", "review": "Ordered via Amazon a unit. They supplied it through a third party. The third party didn't actually have a unit to send but Amazon gave me a delivery date. I queried this with the courier EVRI. they did not have the item. Contacted Amazon twice on the day of supposedly delivery. The second time their agent stated\" it's on the van and is only a short distance from your home\" a total lie, confirmed later by another agent. Offered £10 for the \" inconvenience\" no unit, the third party refused to communicate either. Not what you expect from a company the size of Amazon.", "stars": 3, "review_id": 81568}, {"category": "Media & Publishing", "title": "Amazon as a service concept is awesome…", "review": "Amazon as a service concept is awesome and he (Bezos) often meets expectations. My suggestion here is that their Customer Reviews of products are misleading as heck. I looked at a digital atomic self-setting wall clock which had a star rating of 4.7 out of 5. But reading the reviews reveals that dozens of them reported that the clock does not keep time reliably. A common theme of Amazon reviews is that they are not reliable. Reviewers often have no competence in understanding their product. I would be much more impressed if he implemented a department of independent professional reviewers, much like Consumer Reports used to be (I believe they are no longer completely independent & unbiased!) I need unbiased, competent assessments of products.", "stars": 3, "review_id": 81569}, {"category": "Media & Publishing", "title": "Overall a good experience", "review": "Overall a good experience. I accidentally paid for 2 prime accounts and contacted their customer service to have it solved. The communication was not very smooth at first but it got solved at the end. ", "stars": 3, "review_id": 81570}, {"category": "Media & Publishing", "title": "I usually rate Amazon very highly", "review": "I usually rate Amazon very highly. There are a lot of political negatives, but in terms of service I find it staggeringly good. Products I can’t otherwise get arrive the next day. But here I am bringing the score right down on the basis of some recent Amazon Prime changes. Ads are a newish thing, but I can tolerate that. But now also, if you start watching a long series, apparently included with Prime, you can get upto episode 6 and discover that you have to pay for that one. And several random episodes there after. That is really mean, it’s a deliberate act by them and does their reputation no good at all. Include it or don’t include it, don’t try and trick people like that. ", "stars": 3, "review_id": 81571}, {"category": "Media & Publishing", "title": "Missleading Black Friday deals  ", "review": "I’m finding all the Black Friday very frustrating as I see items advertised ie sketchers trainers at a certain price but when you click on to order the price doubles Surely that is not right ,That has happened on several times where I have gone to order ,good job I am on the ball otherwise I would be paying top prices,I have tried to complain to Amazon but there’s nowhere to complain,Just keep an eye open when ordering ", "stars": 3, "review_id": 81572}, {"category": "Media & Publishing", "title": "Amazon is fantastic", "review": "Amazon is fantastic! In a lot of ways, the only downside is the delivery technique. It's fantastic that you can order something and get it the next day. If something pops in your mind, you can just order it on the app and know it's going to be with you the next day unless the delivery driver leaves it in full site on your doorstep for the local heroin addicts to steal. Amazon is one of the most convenient services ever created, but the delivery techniques used by the drivers could be better.", "stars": 3, "review_id": 81573}, {"category": "Media & Publishing", "title": "Deceptive links", "review": "So I am a long time Amazon customer. However, Amazon constantly takes you to other items when you’re searching for an item, they have so many third party sellers that sell junk or misleading listings, and Amazon never corrects this.  I have found myself searching and buying from other sites just because of this.", "stars": 3, "review_id": 81574}, {"category": "Media & Publishing", "title": "Always had a good impression about hem", "review": "Always had a good impression about hem, but after the black friday sale I'm disapointed. The shipping took forever and still came damaged? What the hell Amazon?", "stars": 3, "review_id": 81575}, {"category": "Media & Publishing", "title": "They usually deliver what they promise", "review": "They usually deliver what they promise, but the prices are becoming unreasonable. Adding VAT and delivery fees on top of everything is frustrating unless you pay for Prime, which feels like a rip-off. There are definitely better and more affordable alternatives available.", "stars": 3, "review_id": 81576}, {"category": "Media & Publishing", "title": "Amazon won't let me write reviews ", "review": "I can't write reviews for products I buy on amazon. Whenever I try, I always get a red box of text that basically says I'm not eligible to write reviews for amazon. I read their community guidelines and I can't think of any way I've violated them. Every other website I buy stuff from wants me to write reviews. This makes me think reviews on amazon are fake or compensated. ", "stars": 3, "review_id": 81577}, {"category": "Media & Publishing", "title": "There Are Cheaper Companies ", "review": "Most of the time have been reliable and done what they said but there are cheaper companies to go with because they are charging you for V.A.T and delivery unless you join prime which is a farce.", "stars": 3, "review_id": 81578}, {"category": "Media & Publishing", "title": "Very good for household stuff like…", "review": "Very good for household stuff like chargers. Do not buy/use any makeup or face wash from Amazon!!!! It can be dupes of the original stuff with bad ingredients or the warehouses/transport can cause bad temperatures. ", "stars": 3, "review_id": 81579}, {"category": "Media & Publishing", "title": "Sadly Amazon are now using Evri for…", "review": "Sadly Amazon are now using Evri for deliveries so sadly we no longer get things next day but are back in no mans land not having a clue when our order willArrive. Placed an order last week still not arrived, the app says might arrive sometime next week absolutely useless as Evei always are. This is something we needed a quick delivery on and we left hanging on. ", "stars": 2, "review_id": 81580}, {"category": "Media & Publishing", "title": "Poor return experience", "review": "Amazon give lots of different ways to return an item. I recently returned an item through Asda and was not given a receipt. The item appears to have been lost by Asda and so have to wait 14 days for a refund. It would be helpful if Amazon only used companies for returns who actually give a receipt of proof of return. At least then, if a returned item is lost, it's clearly not the fault of the customer. Without a receipt, the customer has no proof that they actually returned the item.", "stars": 2, "review_id": 81581}, {"category": "Media & Publishing", "title": "I ordered 2 gift cards for Christmas", "review": "I ordered 2 gift cards for Christmas, never got them.  So I cancelled my order.  I have made 4 phone calls trying to get my refund and all they say is it will be 3-5 business days.  One person said I will get a gift card on my Amazon account, no gift card, another said it would be refunded to my debit card, no refund.  I also noticed where they charged me twice in Nov 24 for my membership.  I would keep an eye on your accounts.  Also 2 of my credit cards someone was trying to charge pizza and another charge for something called Suno, I had my information on my Amazon account, so I could use my points. I have removed those.  No more charges to my accounts.  Not sure what kind of people they are hiring but just letting you know, be careful and watch your statements.    ", "stars": 2, "review_id": 81582}, {"category": "Media & Publishing", "title": "I ordered a huge order from Amazon", "review": "I ordered a huge order from Amazon, and I didn’t get one of the packages they said was delivered. I call the company and they said I had to fill out a form, and I did and still did not receive my package. It was gifts for my children for Christmas. This is the only Christmas I had issues. ", "stars": 2, "review_id": 81583}, {"category": "Media & Publishing", "title": "UMAX barn door hardware", "review": "This ones partially on me for not checking the order upon arrival.  But what happened to the ability to trust a companies integrity?  I ordered a barn door kit from Amazon, selling a product manufactured by 'UMAX'.  Unfortunately I didn't get the door I was constructing on my own finished for another year...one of those when I get to it home projects.  Finally got around to completion, went to the boxes with the hardware from Amazon and, low and behold, there were several items missing from the kit, items which were shown in the inventory pictures on the Amazon product page.  Somewhat important items like....wheels and rail mount spacers and bolts.  I ended up having to purchase seperately as it was too long since the order date.  But please, come on, the company should make good on their promise after collecting your money.  Note to self:  check the order when received or buy from a brick and mortar store...  at least you know where to track down the error.", "stars": 2, "review_id": 81584}, {"category": "Media & Publishing", "title": "Amazon Shop for Dyson Replacement Parts", "review": "Amazon Shop WYWY.Wide  Selling replacement parts for Dyson.Bought Roller Brush,which came with two Hepa Filters,for Dyson Cyclone V10 Animal Extra. Amazon removed the feedback as they didn't like my \"One Star\" review and stated \"There was too much focus on the packaging\" The brush head came stuffed into the hepa filters and so the nylon brush was pushed out of shape allover and so would have been useless on the carpet and in the process strained the filters material.The end of the brush was worn and chipped.All that was needed was to pack the three items separately in the same box.problem solved.", "stars": 2, "review_id": 81585}, {"category": "Media & Publishing", "title": "Just paused membership as they don't…", "review": " Scamazon Just paused membership as they don't take money every 4 weeks it's every 3. They attempt to take payment then as soon as you buy something it's like A.i is set up to know you just used your card because membership follow quickly then you look at your account and it says renewal on the 22nd of January when they've just taken the monthly payment on the 28th of December how is that a frigging Month?I'm actually sick of the cheap tat coming from amazon ebay temu even British company polyester clothing that is plastic so your body isn't getting any good energy off of these clothes your just sweating and obsorbing more plastic. You can't find anything unique when shopping anymore unless you're rich and can buy unique pieces at cost. The Chinese take over of the world well I want British back thanks sick of it. Sellers only refund 20 percent which is absolutely appalling and against the law if you leave negative feedback either they don't show it or they will only refund if you remove it what kind of b\"\"lsh\"t is that. ", "stars": 2, "review_id": 81586}, {"category": "Media & Publishing", "title": "Risky", "review": "My amazon package was stolen a few days ago because carrier didn't ring the doorbell. However, this carrier company still sends delivery update, such as \"your package will be there in 3 hours, hurray!\" through my email. So I made sure to check my inbox on my next order. This time there's was no mail notification at all despite me checking it. On amazon it said that package would be there at 10pm today. Luckily, I didn't rely on their erroneous prediction and checked their website again this afternoon. Yep, package was already there and arrived 2 hours earlier. Fortunately it was not stolen, but this was still risky. Why amazon doesn't require their drivers to ring doorbells, I would never understand. Well, I think they used to.", "stars": 2, "review_id": 81587}, {"category": "Media & Publishing", "title": "Used to be as reliable as a basketball", "review": "USed to be as reliable as a basketball.  Now there is no advantage to buying from Amazon - horrible delivery reliability especially since they are selling more and more through their re-sellers and have now dropped re-seller shipping standards.  They no longer have to meet any shipping standards, so they don't.  Its not the holidays, it just general quality decline.  I'll buy whenever I can from anywhere else than Amazon.", "stars": 2, "review_id": 81588}, {"category": "Media & Publishing", "title": "Packaging ", "review": "We pay for prime had it for years but then I started noticing the items was not coming on time and some didn't come at all! Also the way items are be packaged is unacceptable in the original box with there label stuck on and you can see what the product is or peel label off if a gift.ive sent several items back because of this.", "stars": 2, "review_id": 81589}, {"category": "Media & Publishing", "title": "The lack of actual assistance", "review": "I have been trying to access my basket. It always takes me to another page. I went to the customer service worse than useless. The same thing is happening after the useless advice. They are a big organisation & should have a better customer service. I am dissapointed. I tried to order again now I have 4 things in my basket which I can not access thanks Amazon", "stars": 2, "review_id": 81590}, {"category": "Media & Publishing", "title": "Amazon recomanded a bad company for a fax toner", "review": "Amazon recomanded a fax toner companyMehrwegtoner.That company has not delivered my fax toner.Now, I lost £50 and I cannot contact mehrwegtoner.The deliverer DHL seems suspicious as they say parcelforce us delivering?In my personal opinion  amazon owes me £50.47  as they recomanded the toner company.In my private opinion, amazon is suspect for not going due diligence checkup on the above mentioned german company, which could be a fly by night or bogus company!?A very dissatisfied customerDr. O. Szpiro", "stars": 2, "review_id": 81591}, {"category": "Media & Publishing", "title": "Excessive Adverts on a Paid Service", "review": "I’ve been a loyal Amazon Prime subscriber for years, but the number of adverts on Prime Video has become unbearable. Watching a 44-minute episode was interrupted with 4 ad breaks and a total of 9 adverts.Prime Video used to offer an ad-free experience as part of the subscription, but now it feels worse than free streaming platforms. Considering the ever-increasing subscription cost, this is unacceptable.I subscribed to Prime for convenience and quality, but the constant adverts make the service feel less valuable than before. Unless this changes, I’ll be reconsidering my membership. We will not be paying more. If anything I’ll make less online orders due to this.I order a lot from Amazon as well, but I suspect this will change as we will be cancelling our subscription due to the adverts on Prime Video. ", "stars": 2, "review_id": 81592}, {"category": "Media & Publishing", "title": "poor service", "review": "the package stolen, somehow it due to their delivery. they didn't deliver on the time expected which I was at home for that. they just throwed it at doorstep 2 days later and i was not noticed nor at home.", "stars": 2, "review_id": 81593}, {"category": "Media & Publishing", "title": "Disgusting delivery", "review": "It's often a case of my parcels being logged as \"handed to recipient\" when they dump it on the doorstep, ring the doorbell( if I'm lucky) and are gone before I can open the door. The last time it was \"left at or near back door\" when the photo shows it on the front step in full view of the road, my thieving traveller neighbours and the bus stop with the courier glimpsed as he got to his van. I'll have to stop shopping here before it costs me money.", "stars": 2, "review_id": 81594}, {"category": "Media & Publishing", "title": "Theyre getting worse! ", "review": "Used to like Amazon, but they're getting worse, MUCH worse.1). Delivery drivers NEVER follow delivery instructions. Despite stating \"Do NOT leave items on the doorstep\" and providing alternative delivery instructions, they still leave items on the doorstep. 🙄2). There's a bug in their Android app where a 'wish list' shared via Messenger will not open properly & simply states 'You don't have a profile'(!) Spent HOURS on the phone trying to explain this one to them.3). They now implement 'dynamic pricing' meaning the price of any item may depend upon 'customer behaviour' i.e. they may adjust the price (usually upwards!) if they think they can charge you more for it!! Two people looking at the same item may see two TOTALLY different prices!!4). Their customer support is becoming abysmal. They're usually located in some other part of the world & totally disingenuous. It's a nightmare to explain anything and incredibly difficult to maintain any continuity over any single issue.If you order anything from Amazon, you can only hope it arrives safely & isn't faulty.You've been warned!!", "stars": 2, "review_id": 81595}, {"category": "Media & Publishing", "title": "I was not pleased with the service.", "review": "Amazon is generally a fun place for me to shop, but this time was not. When the shipment finally arrived, the item was damaged, and the delivery was delayed by many days. Although customer service was courteous, they were unable to provide a satisfying solution. From a platform that I trusted so much, I expected better.", "stars": 2, "review_id": 81596}, {"category": "Media & Publishing", "title": "amazon stole my daughter's xmas money wtf", "review": "so on the 10th of november money went out of my account by amazon,and i knew i never made any purchase,i told my bank this might be fraudlent, and my bank claimed it was amazon but i defended amazon cos i dont recollect amazon ever making such a booboo,after a back and fort arguement, they paid back the money but assured me theyl charge me if the error was mine,few weeks later just before xmas they took the last money in my account living my account in minus,i only found out when i was about to get my daughter's xmas gift,and 2 overdrafted payment,i was so worked up, but i decided to investigate the payment,only to find out it was amazon all along,apparently i returned an item they refunded the paymentthen went back weeks later to claim the money back without lettin me know, but apperently it was an error on their part,but funny how they never accidently pay me but they managed to accidently take money back for a product that was already returned, they appologised but i have been charged twice by my bank for their so calle error and the need to be paying for all this charges and compensating me for all this stress,cos this was legitimately stressful and expensive mistake atleast pay for the bank charges if you cant but i lost trust in you guys after this stunt and God know how many times this could have happened,if i never dig in deep i wouldnt have known what they did.", "stars": 2, "review_id": 81597}, {"category": "Media & Publishing", "title": "7900xt ultra black friday deal", "review": "Ordered something that was available on sale for black friday. Said it was coming the 5th. On the 6th they changed the delivery date to the 27-30th. 17th I see they have the same item available for prime. Still haven't shipped mine. Now not available prime. I can't replace the item because I missed the sales. Most experiences have been good with Amazon but customer service was zero help and no way to correct this issue being 20+ days late. Now afraid to leave for Christmas and have an 800 dollar item left on my porch. Ordered on November 21st. Never took over a month to get something from amazon. Never had other issues. ", "stars": 2, "review_id": 81598}, {"category": "Media & Publishing", "title": "Poor management of third party vendor…", "review": "Poor management of third party vendor non-responsiveness. Repeatedly setting additional 48 hour windows for vendor to respond when vendor is unhelpful. Amazon customer service reps are polite but have NO insight or flexibility in dealing with customer. Might as well deal with an AI agent. (Maybe I was?!)", "stars": 2, "review_id": 81599}, {"category": "Media & Publishing", "title": "Late delivering always late ", "review": "Late delivering always late . Drivers who can't read and follow instructions.  They don't read instructions when loading to deliver they don't read instructions when they reach their destinations . And there driving skills are something else. I'm surprised anythink gets delivered.  I think a serious phone call to the CEO ANDY JASSY. in the very near future might be on the cards. Especially if things don't improve. ", "stars": 1, "review_id": 81600}, {"category": "Media & Publishing", "title": "no item, no refund, Amazon won't reimburse.", "review": "Item damaged in shipping, it was scanned back into their warehouse. 2 months later no refund. customer service supervisor hung up on me. They are keeping my money. I have no product or reimbursement. They hire people who you can't understand,who have dogs barking in the background during phone call. I am a victim of EXTORTION,  Pitiful in MY America!", "stars": 1, "review_id": 81601}, {"category": "Media & Publishing", "title": "Paid for amazon prime  for 24hrs delivery of goods, since 2024 is yet to be received in 2025", "review": "Paid for amazon prime, which has 24hours delivery as a feature (why I subscribed actually) Yet goods ordered since 30th December 2024 is yet to be delivered as at today 5th January 2025.This is really a poor service delivery and money thrown down the drain.So pathetic and there is no access to real customer service other than some random robot stuff.  ", "stars": 1, "review_id": 81602}, {"category": "Media & Publishing", "title": "Horrible customer service to fix an otp…", "review": "Horrible customer service to fix an otp sms issue.For years I used my mobile for otp without issues and suddenly it doesn’t work anymore. No way to fix this problem after 2 calls to customer service and 1 hr lost on useless discussions. Incredible as a giant company as Amazon is not able to support their customers.", "stars": 1, "review_id": 81603}, {"category": "Media & Publishing", "title": "Don't rely on prime for important delivery", "review": "I am a prime member and placed an order on Dec 31st.Delivery was scheduled for Jan 3rd which was ok bearing in mind New Years Day. I found that my order was being delivered by Evri and have had an apology saying that it will be delivered on Jan 6th. Trying to complain with Amazon Customer Care is an 020 number which could e 16p a minute and trying to text is impossible to do with so few letters allowed. Amazon prime members be aware that next day delivery is not guaranteed so don't ever rely on it", "stars": 1, "review_id": 81604}, {"category": "Media & Publishing", "title": "I got banned for violating refund and…", "review": "I got banned for violating refund and return policy.I never done any refund,I never returned any Item.They never answered to my respond emails.Never had such a bad experience shopping like that i am top ranked buyer on any other platform such as Ebay and Aliexpress.", "stars": 1, "review_id": 81605}, {"category": "Media & Publishing", "title": "Amazon are selling items or promoting…", "review": "Amazon are selling items or promoting companies who sell items which could very easily kill you and your families. I bought 3 (onlyreceived 2 after neally4 weeks )well heaters. After about 7 minutesthis item made a massive bang with large sparks flying everywhere, fusing my main board. PLEASE DO NOT BUY THIS ITEM  FROM AMAZON OR Well Heaters. This item could easily kill you, your families and your pets. Autar. 07770418984. ", "stars": 1, "review_id": 81606}, {"category": "Media & Publishing", "title": "Absolute rubbish ordering system...", "review": "I ordered a new under counter freezer to replace one that died over the holidays.The initial order didn't go through so I repeated it, In the end my credit card got charged three times and  they tried to deliver two freezers (I sent one back).Only upside is I did eventually get what I needed but what a pantomine?", "stars": 1, "review_id": 81607}, {"category": "Media & Publishing", "title": "Received open, empty padded envelope", "review": "Ordered lightbulbs. A padded envelope arrived today with nothing in it. It was open, never sealed or taped up. Obviously the bulbs fell out, and only an open, empty padded envelope was delivered. WTF. Are their packers just saving time by not sealing the packages now? ", "stars": 1, "review_id": 81608}, {"category": "Media & Publishing", "title": "Missing deliveries ", "review": "Twice in last month parcels have been marked as left in a secure place, but are nowhere to be found. I am not sure if this is a new delivery driver causing the issues but the delivery service is currently very disappointing ", "stars": 1, "review_id": 81609}, {"category": "Media & Publishing", "title": "It got from.bad to worse ", "review": "It got from.bad to worse . Beware parcel that are expensive over £100 are often stolen by amazon staff a code is given to the customer the item either does not turn up or amazon staff steal the content and replace it with something else other parcels are just left in the street that are often stolen . I will not be using amazon again ill stick to jhon lewis or argos or ebay as.ebay use royal mail who are a trusted company", "stars": 1, "review_id": 81610}, {"category": "Media & Publishing", "title": "I have heard it all now", "review": "I have heard it all now, went to request a refund for a broken aquarium filter been told I have to PROVIDE ID if I want a refund I have NEVER been asked for ID in all the years I have been a customer when requesting a refund I do not intend to start now. Sorry my reply was not so polite felt like I was speaking to a 16 year old to be honest. Will just wait for my Prime to expire as I will not be renewing it", "stars": 1, "review_id": 81611}, {"category": "Media & Publishing", "title": "I lost 120 bucks", "review": "I waited for half a year to order AirPods Pro 2 for 153.99. I placed an order at Amazon and they didn't ship it for three weeks. Then they tried to deliver it three times while I was on vacation. After that they forced me to get a refund without my consent and suggested that I reorder the same item for 280 dollars.Customer service representatives that I interacted with that day ignored half of my messages and did not provide me with a satisfying solution.", "stars": 1, "review_id": 81612}, {"category": "Media & Publishing", "title": "What a shitty monopoly", "review": "What a shitty monopoly. They're full of drop shippers. And the worst part is they work their employees to death (literally...did anyone read about the tornado, the drivers made to stay on route, people who drop dead of heart attacks). This overworking leads to items not making it to their destination, items making it broken because they were hastily packed, people getting the wrong items. So then you have to spend your time doing their job as I have for the past two deliveries I've gotten from them...all while their owner doesn't pay them enough for food (they have the 3rd most employees on food stamps). So not only are you paying for shitty service, you're paying for their employees wages, while Bezos cosplays space cowboy.", "stars": 1, "review_id": 81613}, {"category": "Media & Publishing", "title": "Amazon Gift Card \"Unfortunately this gift card claim code is invalid\"", "review": "A $75 gift card i purchased directly from Amazon will not activate, the number was typed in correctly several times & also scanned with the app, getting message. \"Unfortunately this gift card claim code is invalid\". Called 2 times & did 2 chats, 3+ hours wasted, it is still not resolved. Customer DisService couldn't activate the card either, They promise escalation & emails, never received any emails. The WORST, MOST INCOMPETENT customer service people on the planet, that is if you can understand them. Filed claim with Credit Card company used to purchase the card & got reimbursed immediately. Use caution purchasing gift cards from this sham, gangster operation.", "stars": 1, "review_id": 81614}, {"category": "Media & Publishing", "title": "Allow third party seller Ship It…", "review": "Allow third party seller Ship It Appliances Ltd to breach UK Distance Selling Regulations.Raised issue with them directly and they just keep sending emails to return the item. SIA returns policy doesn't except items that have been used, despite raising return on item Not Fit for Purpose within the 14 day DSR.", "stars": 1, "review_id": 81615}, {"category": "Media & Publishing", "title": "Terrible delivery service", "review": "Terrible delivery service. Their online customer service is like robots that don't read your issue and have scripted responses. I track all of my orders especially the auto-shipments for petfood. Every time I have a delivery I watch the drivers pass by my apartment complex multiple times and then see the delivery times bumped out to much later in the day. I watch in agony as the driver gets farther and farther away. Sometimes the driver's lie and say they couldn't make the delivery because they couldn't get access. I will be finding another place to purchase my cat food.  ", "stars": 1, "review_id": 81616}, {"category": "Media & Publishing", "title": "extremely bad customer service", "review": "the response time is long, the agents don’t read the messages, just reply with templates.. An incorrect refund has been given to me but i have no energy to discuss with customer care any longer, as they are incompetent. I’ll rather close my account and never buy from amazon again", "stars": 1, "review_id": 81617}, {"category": "Media & Publishing", "title": "THE WORST COMPANY THAT SOMEONE CAN DO…", "review": "THE WORST COMPANY THAT SOMEONE CAN DO REVIEWS ON THIER PRODUCTS. JEFF BOZO’S GANGSTER RUN OPERATIONS THAT ONLY ALLOWS POSITIVE  AND MEDIUM REVIEWS ON THIER GARBAGE IMPORTED CHINESE PRODUCTS SO HE CAN SCAM PUBLIC BY ADDING MORE MONEY TO HIS WEALTH . A TOTAL DISHONEST MAN  AND COMPANY. SHAME ON YOU GREEDY TRASH, JEFF BBBBOOZOO", "stars": 1, "review_id": 81618}, {"category": "Media & Publishing", "title": "I received and immediately sent back…", "review": "I received and immediately sent back the wrong article.  They refused to refund it. I had so many problems with returning and refunding, and had enough, never again Amazon! Be careful! ", "stars": 1, "review_id": 81619}]