[{"category": "Restaurants & Bars", "title": "This choice has changed my life", "review": "This choice has changed my life, I was in abit of a cycle of looking in the fridge no motivation or desire to know what to cook and want to cook. It just clicked, the week before Christmas I just decided yes I need to try this and I have cooked almost every night, excited to cook,  it is saving me money aswell as I was spending way too much in the shops and now I have full control of it all. I couldnt be happier! ThankyouSophie", "stars": 5, "review_id": 51528}, {"category": "Restaurants & Bars", "title": "Enjoy Hello Fresh", "review": "Enjoy Hello Fresh. It is convenient, quick, easy & no waste. Well packaged and always delivered on time.  ", "stars": 5, "review_id": 51529}, {"category": "Restaurants & Bars", "title": "Tasty and varied meals that are easy to…", "review": "Tasty and varied meals that are easy to make and would cost much more if purchased as individual ingredients ....because most of the ingredients would be wasted....", "stars": 5, "review_id": 51530}, {"category": "Restaurants & Bars", "title": "Christmas dinner was given 10/10 by…", "review": "Christmas dinner was given 10/10 by family.  Recipes easy to follow.  Boxing Day dinner also scored highly.", "stars": 5, "review_id": 51531}, {"category": "Restaurants & Bars", "title": "Absolutely amazing food great choices…", "review": "Absolutely amazing food great choices fantastic prices I did Gousto until a friend said try these no looking back ", "stars": 5, "review_id": 51532}, {"category": "Restaurants & Bars", "title": "This was my first Hello Fresh meal to…", "review": "This was my first Hello Fresh meal to prepare. It was so simple to follow the instructions on the recipe sheet.I chose a salmon pesto and parmasin with dauphinoise potato and veg.Absolutely delicious! ", "stars": 5, "review_id": 51533}, {"category": "Restaurants & Bars", "title": "Delicious and simple to follow. ", "review": "I love the fact HF dishes,  introduce me to recipes I would never normally think of. ", "stars": 5, "review_id": 51534}, {"category": "Restaurants & Bars", "title": "I love HelloFresh", "review": "I love HelloFresh.  They make dinners soooo easy.  Excellent ingredients for easy-to-cook meals.  I also love the flexibility of missing some weeks if it’s needed.  Highly recommend giving them a go.", "stars": 5, "review_id": 51535}, {"category": "Restaurants & Bars", "title": "A meat-free revelation. ", "review": "Trying to eat less meat we started Hello Fresh a while ago and we have not been disappointed. The recipes are delicious. Not a single meal has had either of us turning our noses up. The portion sizes aren’t huge, but, I’ll be frank, I would much rather be left wishing for more than eating enough or too much of something that doesn’t taste as good as the Hello Fresh meals do. My wife loves cooking the meals, oft I hear her singing away as she chops and blends the perfectly sized ingredients and she tells me she feels like a “Master Chef”. ", "stars": 5, "review_id": 51536}, {"category": "Restaurants & Bars", "title": "The Christmas meal", "review": "The Christmas meal with the sides were brilliant and the prep instructions were perfect, the cranberry and orange sauce was really nice with the chicken.I always look forward to getting a box a month and cooking from scratch, essentially.", "stars": 5, "review_id": 51537}, {"category": "Restaurants & Bars", "title": "Very good meal kit delivery ", "review": "Very good service, used them for over 3 years. Sometimes a mistake or something missing but super rare these days.  Very easy to sort on the app if there is.any issue..would recommend. ", "stars": 5, "review_id": 51538}, {"category": "Restaurants & Bars", "title": "Variety and ease", "review": "I love cooking different meals each week and helping my kids expand what they eat. Also it's really convenient and easy to do", "stars": 5, "review_id": 51539}, {"category": "Restaurants & Bars", "title": "We very much enjoy the meals", "review": "We very much enjoy the meals, there are three people the we order for four times a week, l have noticed that we do not waste  food like we did before having them, due to the correct amount coming for each meal, also cooking from scratch, means we do not eat very much processed food that did tend to do before. Feel like we are now having a more balanced diet.", "stars": 5, "review_id": 51540}, {"category": "Restaurants & Bars", "title": "This have given us an opportunity to…", "review": "This have given us an opportunity to try new things. The first meal i cooked i thort i wouldn't like. But it turns out it was amazing. ", "stars": 5, "review_id": 51541}, {"category": "Restaurants & Bars", "title": "Limited vegetarian choices", "review": "The meals are lovely and so easy to cook but I find the vege selections are a bit limited but I’m a fussy git. ", "stars": 5, "review_id": 51542}, {"category": "Restaurants & Bars", "title": "Fresh and Tasty", "review": "Great recipes great service and eating all fresh food.  Portion sizes are great.  Saves me both time and money! ", "stars": 5, "review_id": 51543}, {"category": "Restaurants & Bars", "title": "Hello Fresh make preparing meals easy ", "review": "I rarely cook from scratch, but Hello Fresh make it easy, the recipes are so much better than any ready meals. ", "stars": 5, "review_id": 51544}, {"category": "Restaurants & Bars", "title": "Clear recipes, nutritious and easy to follow", "review": "The delivery is within the time frame.  The food is fresh.  Thr recipes are clear and concise and easy to follow.  They are delicious and the portions are generous", "stars": 5, "review_id": 51545}, {"category": "Restaurants & Bars", "title": "So fresh, tasty and easy to cook. 5*", "review": "All  ingredients sent are always fresh and of an excellent quality. (The chickens my favourite.)The recipes are so easy to follow.I host students and they think I'm the best cook in the world, thanks to H' F'.I've recommended Hello Fresh to all my friends. ", "stars": 5, "review_id": 51546}, {"category": "Restaurants & Bars", "title": "Very easy and no waste meal planning…", "review": "Used the HelloFresh delivery service for a few weeks now, and have been really pleased, the menus are great and the food is always really fresh making for very easy and no waste weekly meal planning. ", "stars": 5, "review_id": 51547}, {"category": "Restaurants & Bars", "title": "When the meals turn up it's good", "review": "Hello Fresh is not cheap, but it does allow you to cook high quality meals at home if the sort that most normal people would never think of trying to cook. The results are often as good as you'd find in - say - a gastropub.What is more making them yourself increases your confidence and also allows you to vary things a bit based on other ingredients you may have in the back of the fridge.The only downside is that orders are sometimes cancelled at the last minute with little notice - despite the fact that HelloFresh must know well in advance that they could not deliver. So if you are relying on them for making a meal that evening... just don't. ", "stars": 4, "review_id": 51548}, {"category": "Restaurants & Bars", "title": "Get cooking", "review": "Great meals that offer a decent portion size with simple instructions at an affordable rate. Delivery is always on time and the app makes choosing each week's meals easy. Occasionally I change the recipes by adding or changing ingredients but it's more down to personal preference. Only down side is that I find the odd ingredient is missing from the box.", "stars": 4, "review_id": 51549}, {"category": "Restaurants & Bars", "title": "So far so good ", "review": "This review is based on my first box with hello fresh. The meals were absolutely delicious! My 5 year old didn’t like the truffle mushroom pie but then it was quite an adult tasting dish. The instructions were clear and ingredients were fresh. I’ve knocked a star off as the portion sizes so far seemed a bit small for 2 adults compared to the sizes we got when we used the company years ago. We definitely needed side dishes to make a meal of one of the recipes so far. ", "stars": 4, "review_id": 51550}, {"category": "Restaurants & Bars", "title": "I had to call the Hello Fresh customer…", "review": "I had to call the Hello Fresh customer service and they were there on Saturday between Xmas and New Year and sorted my query immediately - cannot fault the service when other big named companies can’t even bother to reply. Well Done!", "stars": 4, "review_id": 51551}, {"category": "Restaurants & Bars", "title": "Food is great ….BUT ", "review": "Food is great Service , missing items , missing menus Order vegetarian receive meat dishes etc this is getting worse ", "stars": 4, "review_id": 51552}, {"category": "Restaurants & Bars", "title": "Serving/portion sizes are great", "review": "Serving/portion sizes are great. I was half-expecting it to be on the conservative side and that I would still be hungry after a meal but I'm pleasantly surprised this isn't the case. The estimates of how long it takes to prepare and cook the meals are also quite accurate. I am actually thoroughly enjoying this as it expands my palate to so many new dishes and cuisines. I only took one point off for the use of plastic packaging. Although I can see that they are trying hard to be environmentally-friendly, I feel really guilty whenever I see that thick plastic foam insulation in my box. I wish that you can get the delivery drivers to pick-up these insulation pads whenever they drop-off a new box, and just reuse/recycle these pads somehow.  ", "stars": 4, "review_id": 51553}, {"category": "Restaurants & Bars", "title": "Good for trying new foods", "review": "Lots of options, good customer service when things go wrong. Takes the effort out of meal planning and stops us getting stuck in a rut of having the same meals over and over again. ", "stars": 4, "review_id": 51554}, {"category": "Restaurants & Bars", "title": "So easy to select nice meals and have…", "review": "So easy to select nice meals and have the items just arrived. Takes the pressure off. Only down side we've noticed as we've been customers for a good while is the meat portions especially chicken are often far too small, the quality is ok but the size often lacking. ", "stars": 4, "review_id": 51555}, {"category": "Restaurants & Bars", "title": "Great recipes, even better if use by dates were added to recipes online", "review": "Great recipes, always something tasty and new to try. Something that would really improve the experience would be to add dates to the app, meat used by dates to know which meals could last until later in the week and which need using first. If this could be something incorporated into the recipe selection, even better to help plan around a week when we have hello fresh 3/7 ", "stars": 4, "review_id": 51556}, {"category": "Restaurants & Bars", "title": "The chance to try new things", "review": "My husband and I really enjoy HelloFresh.We typically order 3 meals every 2 weeks. I find I spend a fair bit less at the supermarket those weeks.The selection is varied, and it makes us try new things. The delivery is always well packed, and the ice packs and insulation keep the delivery cold i for quite a while should you forget to change the delivery date!My only criticism is I'd like to be able to increase the protein content.", "stars": 4, "review_id": 51557}, {"category": "Restaurants & Bars", "title": "Tasty meals easy to make ", "review": "The meals are really tasty and easy to make but sometimes the ingredients especially the carrots can be past their best by the time they get to us ", "stars": 4, "review_id": 51558}, {"category": "Restaurants & Bars", "title": "The recipes are really easy to follow…", "review": "The recipes are really easy to follow and make life so much easier.however  I have experienced some ingredient issues (either missing items or fresh items ‘past their best’).when it’s good though it’s really good.", "stars": 4, "review_id": 51559}, {"category": "Restaurants & Bars", "title": "Menus good, wasteful packaging", "review": "Positives: We really enjoy the recipes and the ability to plan ahead. Delivery timings are usually good.Negative: We find it extremely frustrating that the packaging materials for the chilled food - the padding and the ice blocks are NOT recyclable. Change this!", "stars": 4, "review_id": 51560}, {"category": "Restaurants & Bars", "title": "Delicious and easy recipes ", "review": "The food is absolutely delicious. Not always large portions and sometimes have to add extra veg for example. And you have to remember to skip in time if you don’t want a box every week as if you miss the deadline you are having what they pick anyway ", "stars": 4, "review_id": 51561}, {"category": "Restaurants & Bars", "title": "Everything with the food has been…", "review": "Everything with the food has been fantastic the only problem is the poor delivery option! To only be able to have a delivery on a Saturday is rather pathetic and pretty inconvenient ", "stars": 4, "review_id": 51562}, {"category": "Restaurants & Bars", "title": "Some beautiful recipes", "review": "Some beautiful recipes, good set up in terms of the ability to skip etc. Food comes well packed for freshness. Easy to follow recipes. ", "stars": 4, "review_id": 51563}, {"category": "Restaurants & Bars", "title": "Recipes delicious and instructions…", "review": "Recipes delicious and instructions clear. Only gripe is finding fridge storage stuff in the bags and sometimes I find a use by day- which I’ve passed. ", "stars": 4, "review_id": 51564}, {"category": "Restaurants & Bars", "title": "Customer services are quick to answer…", "review": "Customer services are quick to answer and resolve any issues that arise and it's made very easy to speak to someone.The only thing I'm not so excited about is some ingredients in the packets for example caking agent.Totally unhealthy chemicals. Are they necessary?", "stars": 4, "review_id": 51565}, {"category": "Restaurants & Bars", "title": "I look forward to receiving my Hello…", "review": "I look forward to receiving my Hello Fresh box and planning my meals for the week. It is convenient and takes away the headache of planning what to make every day.The only downside is the amount of non recyclable packaging that comes with it. I am struggling with my conscience over this and may have to stop my deliveries if the company cannot make changes. ", "stars": 4, "review_id": 51566}, {"category": "Restaurants & Bars", "title": "I like all ", "review": "I like all , taste, size of portions,  easy to cook,the only think I am not happy is short date on meats,  my orders comes once a week and need to cook meals in first four days as other way meat will be out of date.", "stars": 4, "review_id": 51567}, {"category": "Restaurants & Bars", "title": "I recently tried HelloFresh", "review": "I recently tried HelloFresh, and while it has its good points, it’s not perfect. The recipes are really easy to follow, and I did enjoy making meals I wouldn’t usually cook. Most of the ingridients were fresh, but I had one or two items that didn’t look great when they arrived, which was a bit dissapointing. Portion sizes were decent, though I think they could be a bit bigger, especially for the price. It’s a nice idea, and I can see why people like it, but I’m not sure it’s worth it for me every week. Maybe good for busy weeks when I don’t have time to plan meals, but it’s not something I’d use all the time.", "stars": 3, "review_id": 51568}, {"category": "Restaurants & Bars", "title": "Good okay, service not so much", "review": "Food okay, just a couple of issues with damaged ingredients which could be issue with courier. There was an issue with a vegetarian burger that actually had beef extract in it!The low score is more to do with them not completing actions that they said they would do, did not postpone a delivery that should not have arrived, not completing a refund that they said they would do. And also for their text messaging system doesn’t work", "stars": 3, "review_id": 51569}, {"category": "Restaurants & Bars", "title": "The meals are extremely delicious and…", "review": "The meals are extremely delicious and easy to make. However, we have had a few items not turn up and instead of the payment for the missing items coming off the next box they sit as a credit for any full price items. You also cannot change your delivery date to suit you without incurring a fee. ", "stars": 3, "review_id": 51570}, {"category": "Restaurants & Bars", "title": "So far one box cost more than expected…", "review": "So far one box cost more than expected due to the increased priced dishes not being clear enough.If choices aren’t made they pick them for you but don’t pick the free dessert so that doesn’t get included.One delivery didn’t arrive and delivery driver lied saying signed for by me.Box after that was a day late! And missing the garlic for every dish in the box! Ingredients are basically on the last legs so if you don’t cook immediately they are off.", "stars": 3, "review_id": 51571}, {"category": "Restaurants & Bars", "title": "Ordering process and prices not great", "review": "I find the app and ordering process slow and not easy find what I want. I don't like they way the more expensive recipes are presented first and a lot of scrolling is required to find the basic ones included in my plan, and the lack of search function to find dishes quickly. A few weeks in, after several calls to customer services, I'm just getting used to deciding what dishes I might want ages in advance of delivery. Finally, although the portion sizes are just about OK if you're not hungry, the flavours and freshness are good. Probably won't be continuing for very long because of the ordering process and prices. ", "stars": 3, "review_id": 51572}, {"category": "Restaurants & Bars", "title": "Hello fresh is great, poor deliveries", "review": "Hello fresh is great but you've recently started using dpd for deliveries and they're terrible. Packages are always left the wrong way up even with clear instructions on the box. They don't knock, they just leave the package on the door step even if there's someone home. Box looked like it had been thrown around as the contents was all over the place. ", "stars": 3, "review_id": 51573}, {"category": "Restaurants & Bars", "title": "The vegetarian meals are very samey", "review": "The vegetarian meals are very samey. There isn't a vegan option.The meals provide have easy to follow recipes but are required to be adapted to suit a vegan, ie, cream fresh and cheese.", "stars": 3, "review_id": 51574}, {"category": "Restaurants & Bars", "title": "Use by dates on meats often too short", "review": "Use by dates on meats often too short. The odd ingredient missing. Battered peppers and carrots behave like they’re made from rubber ", "stars": 3, "review_id": 51575}, {"category": "Restaurants & Bars", "title": "Very few vegetarian options", "review": "I gave Hello Fresh a go, but cancelled my membership after a couple of orders.  The vegetarian options are very limited compared to what Gousto offers, for that reason, I have gone back to Gousto.  The meals options on Hello Fresh are also very basic.", "stars": 3, "review_id": 51576}, {"category": "Restaurants & Bars", "title": "Firstly", "review": "Firstly, I keep saying, your contact telephone number does not work when trying to ring, 2, you do not inform members of price increase, for example I signed on for £20:99 all of a sudden, like 3 months later, I had to pay £29:99 why?? The talk does not completely work, I've asked many times questions of ingredients faults and I did not get a answer to my question, only once I complained that DPD was leaving my box in a completely wrong place and I was given my weeks money back, that was a bonus other then that, I'm not completely happy, if it wasn't for the fact the meals are 100% gorgeous I would have left.", "stars": 3, "review_id": 51577}, {"category": "Restaurants & Bars", "title": "Must try harder… ", "review": "We have had hello fresh for a number of years now. Just recently we have been very disappointed with Hello Fresh! Menus are generally good for us but the quality of the produce is either missing or poor quality.When we report these issues they offer us a small nominal fee as compensation, which doesn’t really help when you are half way through preparing a meal for yourselves. Also they offer no insensitive or discounts for loyalty customers.Seriously thinking of switching to Gusto or one of their other competitors. ", "stars": 3, "review_id": 51578}, {"category": "Restaurants & Bars", "title": "I've been a customer for nearly 10…", "review": "I've been a customer for nearly 10 years and have always been impressed with the quality of food. Deliveries were always on time with the right ingredients. Unfortunately I've noticed a drop in the quality of ingredients over the last year, especially the meat. I found a chicken beak in one meal, which I complained about but unfortunately did not receive a response.I've also noticed, compared to similar services, that their saturated fat and salt content in most meals are relatively high. I've since permanently switched to another service.", "stars": 3, "review_id": 51579}, {"category": "Restaurants & Bars", "title": "Did not enjoy the fact that three meals…", "review": "Did not enjoy the fact that three meals were picked for us when we joined ,I didn’t even enjoy those meals to the fullest. I haven’t had time this week to even think about changing my meals for the next delivery and can’t seem to skip or cancel my order, Feeling disappointed Could do betterPlease improve Also give more key points and details rather that having to read long paragraphs before being able to use the app as I did not even fully understand Only Allowing people 2 days to change their order is too short and didn’t even get the chance to change it.Please fix your services and improve ", "stars": 3, "review_id": 51580}, {"category": "Restaurants & Bars", "title": "Too samey", "review": "The pescatarian/vegetarian choices are very samey, I get bored of roasting sweet potatoes to put in the recipes. The vegetable content is usually too small for two people, I have to buy more from local shop to bulk it up. ", "stars": 3, "review_id": 51581}, {"category": "Restaurants & Bars", "title": "Most meals were very tasty", "review": "Most meals were very tasty, however, we received off chicken thigh for one of our meals.  The AI customer service said it was down to the way the meat was packaged, and the sulphur smell would disperse given time.  However, this was not just a sulphur smell, the meat was very slimy, and was definitely off.  Basically good value when you get the 50% off offer, but otherwise, not worth it.", "stars": 3, "review_id": 51582}, {"category": "Restaurants & Bars", "title": "Please increase the amount of recycling…", "review": "Please increase the amount of recycling in the delivery - especially insulation material and plastic with ice in. Range of menus is good. Some weeks the size of the vegetable (eg butternut squash) is tiny and I have to supplement form elsewhere. That is very irritating. The old cardboard boxes did not require ripping to open. That meant they were reusable. Now the boxes are often unusable and all end up in recycling. Reuse comes before recycle.", "stars": 3, "review_id": 51583}, {"category": "Restaurants & Bars", "title": "Foods good but service terrible ", "review": "Foods good but every week they charge the wrong price. Supposed to get free delivery with Amazon prime but they always charge then I have to ring up to get a refund. Every damned week! So frustrating and a waste of everyone’s time. Big promises poor results so far ", "stars": 3, "review_id": 51584}, {"category": "Restaurants & Bars", "title": "It’s just ok.", "review": "It’s just ok.The new selection is not as appetising or as varied as Gusto. A lot of the meals are at an additional cost per portion which leaves really boring options. The portions sizes aren’t the best and several recipes haven’t included things like ketchup, mayo, honey, etc which gusto does. Overall pretty disappointed after swapping from Gusto so will be going back. But I’m sure if I hadn’t have had Gusto first I would have been pleased.", "stars": 3, "review_id": 51585}, {"category": "Restaurants & Bars", "title": "Recipe was great , but green beans inedible ", "review": "Recipe was great , however green beans were so stringy they were inedible . ", "stars": 3, "review_id": 51586}, {"category": "Restaurants & Bars", "title": "Good meals but can be inconsistent…. ", "review": "I have been receiving Hello Fresh for the past 12 weeks.  The deliveries have been timely and all ingredients contained for each menu.  However, this week has seen ingredients that are not relevant to the menu for example, I should have received Brioche hot dog buns and hickory smoked sausages and I did not receive either but instead received some mince beef instead.I hope this is just a little oversight this week and I’m hoping this is not a regular occurrence. ", "stars": 3, "review_id": 51587}, {"category": "Restaurants & Bars", "title": "Unhelpful, rude customer service agent ", "review": "Was quite happy with Hello Fresh, but a couple of times my meal selection wasn’t saved, I got half the meals I was expecting. On the 2nd time  decided to contact them because I was charged more than half the money for only half the meals. Usually their customer service is very good. But the agent I spoke to was so rude and unhelpful that I ended my subscription and have been using Gousto for a couple of weeks now, which is a bit more flexible too. ", "stars": 2, "review_id": 51588}, {"category": "Restaurants & Bars", "title": "Terrible customer service ", "review": "I called the customer service team after I was charged but had cancelled the box/subscription and decided not to go ahead with the subscription. The first call was answered and no one spoke so I called back I spoke to someone and she said she would process a refund and put me on hold, she then disconnected the call! I currently use Gousto and expected the same level of service I had from them but have been very disappointed ", "stars": 2, "review_id": 51589}, {"category": "Restaurants & Bars", "title": "Trying to cancel my subscription and…", "review": "Trying to cancel my subscription and it’s not letting me online, tried to call too and nothing, still taking money out Other than that there stuff is great ", "stars": 2, "review_id": 51590}, {"category": "Restaurants & Bars", "title": "Some great meals but some really poor meals", "review": "Some of the standard priced menu options are really good,  whilst others, which in my last deliver was chicken thighs and couscous,  you even had to supply the honey yourself, was tasteless and the ingredients you could buy from Aldi/Lidl for £1 was such poor value,  why is it that sometimes everything is included and then in other often cheaper value option you have to provide a number of ingredients from your pantry!.  HelloFresh need to be consistent,  one of my last delivery’s was a vegetarian type curry but the veg was all rotten,  so essentially there was nothing but rice and sauce,  but yellow fresh only gave me a £2.52 credit,  for a meal I could not use.", "stars": 2, "review_id": 51591}, {"category": "Restaurants & Bars", "title": "Unwanted deliveries", "review": "I skipped all deliveries over the Christmas and New Year period, but due to HF not having deliveries on Christmas and New Year's Eve, they went ahead and reinstated deliveries for a different day, despite the fact I specifically skipped all deliveries during this time. This has led to unwanted  meal choices, food waste, inconvenience, and extra expense on my part. I'm not impressed at all.", "stars": 2, "review_id": 51592}, {"category": "Restaurants & Bars", "title": "Average fella review!", "review": "Like many people, we have had many offers sent our way by these meal prep companies so have tried these for the past few months. We don't have boxes regularly but gave them another go this week. The recipes are ok on the whole, the portions are on the small side and we often bulk them out with sides. It's a good way to try things you may not usually and you get the exact amounts, rather than buying big bags or things you'd never use again! The two main problems with Hello Fresh over the other one we use (beginning with G) is 1) quality and life of ingredients and 2) clunky app and customer service. Every box we have had has had some issue, today's was mouldy green beans on arrival, but it's often short dates on the meats (2 days sometimes) or veg that goes off quickly, we usually lean away from salads. (You'll end up buying new) and carrots. Buying more kinda defeats the purpose though. Issue 2 is if you have to complain, they are very quick at automatically refunding you if you say you had problems but you can only use that credit on full price boxes. Now we are 8 boxes into our 10 at 30% off so actually haven't seen benefit yet. I wanted to send a picture of the ingredients in question but the email address vanishes faster than sherry when grannies round. So I went to the chat, went through the bot to a laboured chat with a thoroughly pleasant agent who just totted off the script. I go a link to a Google form which actually doesn't work. They then asked me to do feedback, upon looking it's very much typical feedback on the person on chat and not the company, all asking you for answers structured to what they want to hear...not what you want to say. Much like many nowadays. Am I going to use them again? Who knows, I don't see the point of using a service supposedly to save time and money to actual do neither of those things...Update...after the reply below, what is the point of 3 days life on items in a 5 day meal box?", "stars": 2, "review_id": 51593}, {"category": "Restaurants & Bars", "title": "Terrible customer care", "review": "This seems like a great idea, until you realise how expensive the meals actually are after that hook of 50% off your first box. Plus delivery.My big issue is that I’ve amassed a big credit ( partly due to their non delivery of one order  - that went into my “credit account” rather than being refunded ) that I can’t use until I’ve taken all the discounted boxes on offer. Problem is - I don’t want to take a pile more of the discounted offers- they aren’t that enticing and  I’ve fallen right out of love with the food offering and the customer service.Such slippery eels to deal with by chat or on the phone, and there’s no contact info for sending an email, which is my preferred method of communication. I’d love one of their customer service staff to resolve my issues, refund my balance or let me just use up my credits and call it a day.Can’t see it happening, just more brush-off.The longer the issue is unresolved; the more unlikely I am to use or recommend the company.Be really careful before you’re drawn in by that first offer - if you have a couple of issues and maybe don’t like the food and don’t like the company’s ethos : You’re stuck with money in credit that is too hard to access.Plus you need to be right on the ball to get your food choices in or skip meals - I’ve found it ALL really difficult with my ADHD issues that make much of my experience with Hello Fresh really triggering and anxiety causing. ", "stars": 2, "review_id": 51594}, {"category": "Restaurants & Bars", "title": "It it could have been excellent", "review": "Excellent idea and I will be looking into other companies to supply me after I've had to cancel. Unfortunately we have cancelled because we were getting rotten food being delivered and in complete recipes quite often.", "stars": 2, "review_id": 51595}, {"category": "Restaurants & Bars", "title": "Food is great, delivery is poor", "review": "Food is great. Delivery is poor. When you rely on food being delivered and it's not, and then cancelled, it fundamentally takes away any advantage of being organised and committing to the scheme. Being charged for delivery is also an issue when it hasn't been delivered on the day agreed, isn't great.", "stars": 2, "review_id": 51596}, {"category": "Restaurants & Bars", "title": "Bad start.", "review": "Bad start indeed. Deserts which had been selected did not arrive and the call to the help centre brought an indifferent response. No compensation offered. Attitude was deserts were free anyway but, of course, that is not the case. It is part of the overall package. The meals themselves were certainly tasty but a bit of a nightmare sorting everything out.", "stars": 2, "review_id": 51597}, {"category": "Restaurants & Bars", "title": "vegetarian meals", "review": "We had vegetarian meals for a visiting family member and received exactly the same meals 2 weeks in a row so I was very disappointed 😞 ", "stars": 2, "review_id": 51598}, {"category": "Restaurants & Bars", "title": "Good choice of recipes", "review": "Good choice of recipes. My issue is I'm unable to get free desserts. I had an account a year or two ago for a short while and was told I'd claimed the offer. Quite rude response considering I've now bought 5 boxes ... feels like a fake promise.", "stars": 2, "review_id": 51599}, {"category": "Restaurants & Bars", "title": "Didn’t like quite a lot!", "review": "Didn’t like: rancid chicken mince, green beans going rotten, odd missing ingredients, inappropriately named customer helpline. They couldn’t care less and offered nothing as recompense.  Also, desserts for life…rarely get them. Most things seem to be a mincemeat stir fry with an exotic name! Hoping things would change but….I guess with an ingredient cost at around £1.50 and a £10 profit margin it must be tricky for them!! My lazy shopping habit and long working hours is the only reason I’ve stuck with them. Think it’s time to try one of the other  delivery/ingredient companies ", "stars": 2, "review_id": 51600}, {"category": "Restaurants & Bars", "title": "No intention to continue once this promo runs out. ", "review": "They give you a cost of the meals, but most of the recipes actually charge extra per meal, the quality is often questionable and very often they don’t actually include all ingredients for the meal. Instead referring to the extras needed as ‘pantry items’ to justify not adding them. ", "stars": 2, "review_id": 51601}, {"category": "Restaurants & Bars", "title": "Disappointing ", "review": "‘Diced’ chicken thighs for the curry were more ‘minced’ - tiny shreds of meat and skin with not one single chunk. Curry was just sauce with lots of little bits in - not satisfying.Also received chicken breast instead of thighs for the Caribbean Jerk Chicken. We don’t like chicken breast and wouldn’t have ordered if it was advertised as such. The website gives all sorts of contact email addresses for influencers, PR, marketing and investors, but not actual customers. The web form does not give scope to adequately describe the issue, hence venting here! Joined as there was an enticing promotion but won’t be continuing once this finishes. ", "stars": 2, "review_id": 51602}, {"category": "Restaurants & Bars", "title": "Food was OK but selected a few meals…", "review": "Food was OK but selected a few meals and got them twice .why would anyone want them twice. Wasted a lot.of money", "stars": 2, "review_id": 51603}, {"category": "Restaurants & Bars", "title": "Absolutely incompetent unless idiots!", "review": "Absolutely incompetent unless idiots!Cancelled a month ago and they still keep taking monies from my account sending me boxes that are not worth it!Rung them several times, their system does not work or their phone staff are a bit dim!", "stars": 2, "review_id": 51604}, {"category": "Restaurants & Bars", "title": "I’m really concerned about the spoiled…", "review": "I’m really concerned about the spoiled vegetables we receive each week, like potatoes, spinach, and peppers. It’s disheartening to see so much food go to waste, and it affects everyone when we have to throw it away while cooking. We need to find a better solution to reduce this waste and ensure the kids are getting fresh, healthy produce. It’s not just wasteful; it also impacts our efforts to provide nutritious meals.", "stars": 2, "review_id": 51605}, {"category": "Restaurants & Bars", "title": "Gone down hill", "review": "Hello Fresh has definitely gone down hill to what it was. I had boxes a few years ago then stopped for a while and now started again a few months ago and have definitely noticed a difference. Most weeks there's something wrong be it a missing ingredient or an ingredient gone past it's best or meat with hardly any date on it. And ok if you report the issue, the account is credited with 50p or £1 or so to cover the cost of the missing or gone off stuff but it's kind of not the point. The inconvenience is the issue not the money. Also the ingredients used to always be measured exactly so the convenience when cooking meals was great as you had the exact amount needed for the recipe. Now I find I have to manually measure with alot of things as the amount included is not correct for the portions. Just not as convenient as it used to be. ", "stars": 2, "review_id": 51606}, {"category": "Restaurants & Bars", "title": "Not worth it anymore! ", "review": "We used to have hello fresh came back and the meals we could get previously are now premium meals that you have to pay extra for! The meals are now made up of cheap ingredients! The chicken in the stir fry was disgusting full of grit  ", "stars": 2, "review_id": 51607}, {"category": "Restaurants & Bars", "title": "Order 1st time", "review": "Order 1st time. 3 meals - paid 35 pounds. No delivery received. Called 3 times with contradicting information.Says free desert - but did not appear on my account. (Although does not matter as the whole delivery did not come)", "stars": 1, "review_id": 51608}, {"category": "Restaurants & Bars", "title": "I didn’t place an order", "review": "I didn’t place an order, by hello fresh’s own admission, I couldn’t cancel the order (which I didn’t place)  as I was over 5 days from delivery.  I’ll be claiming money back via my bank.  Customer services are obstructive and very unhelpful. ", "stars": 1, "review_id": 51609}, {"category": "Restaurants & Bars", "title": "Cancel a box - Get a cold call.", "review": "I’ve had an ongoing issue with HelloFresh regarding their persistent cold calls. Every time I take a break from using their service, I receive constant calls from various random numbers asking for feedback on their services. After providing a review, I’m often told that I'm eligible for a discount on my next few boxes. Unfortunately, the call handlers seem unable to take a polite hint that I’m not looking to renew at this time. I wish HelloFresh would ease up on the cold calling; it’s been a frustrating experience. For reference, I’ve never encountered this problem with Gousto.", "stars": 1, "review_id": 51610}, {"category": "Restaurants & Bars", "title": "I’ve had exactly the same problem as a…", "review": "I’ve had exactly the same problem as a previous reviewer, I browsed the website but decided not to proceed. Apparently by browsing I’ve activated my account and been sent 5 meals that I didn’t want and would never have chosen! To make matters worse they delivered the box to my previous address, I didn’t change my address because I had no intention of placing an order! Now I am £22 out of pocket with no food to show for it. Hello fresh you are a complete con, when I phoned you all I got was someone quoting from a script and offering no solution! I have never received any confirmation from you about my order so couldn’t cancel within 5 days because I didn’t realised I had placed an order. Stay away from this company!!  ", "stars": 1, "review_id": 51611}, {"category": "Restaurants & Bars", "title": "Very poor customer service ", "review": "Couldn't give 0 stars or I would have. Tried to reactivate account and had soooooooo many issues. Seems like they deliberately don't want you to be able to use the offers they send. Wasted time trying to change account info only to repeatedly be sent round in circles. 15 mins on call, after waiting for 15mins to even be connected, to be told useless information. Firstly told me that due to GDPR they couldn't view my personal information and then asked me for that very info!!! I was totally ready to reactivate and use but all because I wanted to change my email address, I wasn't able to. Looking at other reviews I think I've made the right decision. Very very poor customer service and all the replies from them just spout a standard 'we're sorry contact customer service' proving they don't give a toss as your poor customer service is why I'm leaving. If you value being able to mange your own account GO ELSEWHERE", "stars": 1, "review_id": 51612}, {"category": "Restaurants & Bars", "title": "Dreadful customer experience", "review": "Dreadful customer experience. I (stupidly, given a previous experience) reactivated my account having received an offer through the post. I decided not to proceed and chose no meals. I was then charged for a box and told it was too late to cancel. An absolute con - what an ethically poor company. I logged in to look at their offer, not to reactivate a subscription, and decided it wasn't for me. I'm now £27 out of pocket for an order I didn't place - what an absolute con! Do not touch this company, they are solely interested in your money ", "stars": 1, "review_id": 51613}, {"category": "Restaurants & Bars", "title": "Absolutely rubbish", "review": "Absolutely rubbish, they make it difficult to cancel. You call them they tell you it’s cancelled and then charge and send you out more boxes. The boxes of crap food are let outside of your address and when you call them again they’re the most unhelpful people. Don’t sign up to it whatever you do ", "stars": 1, "review_id": 51614}, {"category": "Restaurants & Bars", "title": "Cancellation with a sneaky pending order", "review": "I had been a Hello Fresh customer for years but with the recent incidents I've decided to leave.I received an email yesterday saying my subscription had been cancelled without my knowledge. This is the 2nd time this happened in recent months. When I inquired the first time around a few months ago about why it happened as I was concerned about fraudulent use of my account, I was told they would look into it but as expected no updates since. Now it's happened again, causing me not only to lose all the benefits, it also was showing there was a sneaky pending delivery due next week while I had 100% paused it as I'll be away. If i hadnt logged in and checked i would've never known! I found it totally unacceptable. There's serious fraud happening in Hello Fresh and I'm very disappointed to say the least.", "stars": 1, "review_id": 51615}, {"category": "Restaurants & Bars", "title": "Issues with website, shitty customer service", "review": "They keep unskipping my skipped meals and charging me for them. This sucks because I'm usually out of town when it happens and the food just rots outside of my door.The customer service is truly the worst, and they never seem to get any better. Edit: I shared my information outside of my number - in the past when told to expect a call from Hello Fresh I sat around for hours and they never called me. I have no intention of wasting my time again.", "stars": 1, "review_id": 51616}, {"category": "Restaurants & Bars", "title": "Beware that cancelling your order online might not work", "review": "Went on hello fresh website before Xmas to look at the food options but there were not enough options suitable for me (non-dairy and gluten-free diet). I went through the process to make sure nothing was ordered at least 3 times but still ended up getting a box of food delivered that I didn't want and can't eat (full of wheat and dairy). When I rang to complain was told the delivery was correct becauee I had ordered it. They didn't seem to understand that I would have to be mad to go on their website and deliberately choose food to be delivered to me that I cannot eat. If that is the case then the issue is with their website. Have contacted my bank to dispute the transaction and posting here for others to be aware. If you do look on their website and then think you have cancelled without anything being ordered probs best to also call them as they (deliberately) don't make it easy for you to cancel online. Looking back I wish I had called straight away rather than trusting it was all sorted via the website cancellation. ", "stars": 1, "review_id": 51617}, {"category": "Restaurants & Bars", "title": "DO NOT USE ", "review": "Gave me dirty, disgusting, rancid meat that was off well before its use by date. Absolutely vile. Immediately cancelled my subscription. £40 per box to get food poisoning. Absolute joke ", "stars": 1, "review_id": 51618}, {"category": "Restaurants & Bars", "title": "Poor service ", "review": "Reactivated my account, in less than 12 hours they take payment and send food of their choice.No email or message to say the deadline is so and so.No free dessert was put in as they say.Spoke to customer service but we're no help.", "stars": 1, "review_id": 51619}, {"category": "Restaurants & Bars", "title": "My order was not delivered, poor communication ", "review": "I found the ordering process easy and there was lots of choice, although I hadn’t realised that many items carried an extra charge. My order should have been delivered by Yodel yesterday. Unfortunately, I did not receive my delivery. I had no updates from either Yodel or HelloFresh so it is up to me to waste time chasing this. The whole point of this was convenience. Needless to say, my first experience with HelloFresh has been poor and I will be doing a supermarket trip today instead.I have now received a comment on my review from HelloFresh but still no direct contact from them. I have spoken to customer services who have been unable to help me other than to say the logistics department will be in touch, they cannot or will not say when. I have paid for a product that I have not received and will be asking for a refund. ", "stars": 1, "review_id": 51620}, {"category": "Restaurants & Bars", "title": "Good Food -Shame about the service.", "review": "I have been using Hello Fresh for 7 weeks of an 8 week discount offer. On the day I signed up I linked my account with Amazon Prime which as far as the advertising goes should cancel the £4.99 delivery charge. Each week whilst making the order the app tells me I have 2 discounts including free delivery. Each week I have been charged for delivery. Each week I have contacted Customer Service and advised them of this. Customer Service have been unable to explain this and tell me “this has been escalated to the team”, “a full report has been submitted” but 6 weeks on and no resolution. They tell me I am unable to speak to whoever is dealing with the issue   Does this “team” actually exist?!In view of this if no resolution is forthcoming it will be GOODBYE HELLO FRESH!Today 02/01/3025 have been chatting with Vincent from the Custoner Care team for 2 hours. still not resolved ", "stars": 1, "review_id": 51621}, {"category": "Restaurants & Bars", "title": "If I could give zero stars I would", "review": "If I could give zero stars I would. I had an offer from Strava that I clicked through and then the site asked me to create an account. I already had one with HelloFresh so entered in my details. Apparently just logging on reactivates your account and your subscription. Overnight I’ve had a charge on my card for a delivery next week that I haven’t ordered or wanted to reactivate my account. I called customer service (after deactivating my account again) to cancel the order and get a refund, only to be told that their policy is not to cancel the delivery or refund due to their terms and conditions. I neither wanted to reactivate my account or take a delivery. Finally the order has been cancelled, but the only offer was for a full box credit to my account which I have deactivated as I have no desire to use this service. Essentially I’ve been defrauded for a box that I have neither selected or ordered and the only way forward is do a credit on an account that I’ll never use again and still be out of pocket. I will be speaking with my card issuer to raise a chargeback. ", "stars": 1, "review_id": 51622}, {"category": "Restaurants & Bars", "title": "BEWARE OF SALES TACTICS", "review": "BEWARE OF SALES TACTICS. There’s a reason this company is struggling, lost 90% of its value. Clearly the sales staff have been trained on poor sales practices designed to manipulate people to sign up. My girlfriend received a call one day from a sales agent claiming she had won free deserts for life ‘from a competition she entered’ (she had not entered any competition). My girlfriend was elated with this good news because she was going through a tough time, the night before we had lost the use of our breaks in the motorway at a high speed which had caused her serious distress, working in sales my self I know this is where you would classify this type of customer as vulnerable but the guy pushed ahead explained things poorly and at the end of the call she was giving her card details for a £40 quid order. Free deserts for life? 2 Gus for a week between 2 people. What a shambles, the experience left my poor partner feeling embarrassed and distressed, shame on you as a company. Most of the food was absolutely trash also  ", "stars": 1, "review_id": 51623}, {"category": "Restaurants & Bars", "title": "Unable to change delivery address DAYS…", "review": "Unable to change delivery address DAYS before delivery no refund of over £75 as it apparently still needs to be delivered can only offer me 50% CREDIT on full price boxes. Ridiculous company robbing people for nearly out of date produce customer service are like robots reading scripts WASTE OF TIME AND MONEY ", "stars": 1, "review_id": 51624}, {"category": "Restaurants & Bars", "title": "They ruined Christmas & New Year", "review": "They ruined Christmas by not sending the 7 day order we made. Just 5 of their choice (no pudding added). Admitted their error and gave a refund. Today they sent the same crap again (no pudding added). This is entirely unacceptable. ", "stars": 1, "review_id": 51625}, {"category": "Restaurants & Bars", "title": "Pests. ", "review": "We had hello fresh for a short period of time. They weren't awful and the recipes were good but I wouldn't call everything fresh as often the veg was wrinkly and dry. We have since moved on to a different company however hello fresh don't seem to accept that as a reason.I get letters, emails, phonecalls ALL the time. Asked to stop over a phonecall due to no longer being interested but clearly they have persisted regardless of this.  Biggest pest of a company. ", "stars": 1, "review_id": 51626}, {"category": "Restaurants & Bars", "title": "I am thoroughly appalled by my recent…", "review": "I am thoroughly appalled by my recent experience with HelloFresh. After canceling my subscription two years ago, I received a letter offering a \"free dessert for life.\" Out of curiosity, I scanned the QR code to explore the current offerings. To my shock, this simple action somehow resubscribed me without my explicit consent—no confirmation, no food choices, no agreement to payment.Less than 24 hours later, £12.60 was taken from my bank account. When I called Customer Service to dispute this, I was told that a refund was \"not possible\" because I had missed the cancellation deadline. This timeline is ludicrous, especially given that I hadn't actively chosen anything or agreed to re-subscription in the first place.As someone currently living in financial hardship due to my husband's recent redundancy, I find it unacceptable that a company would behave in such a predatory manner. This unexpected charge is devastating, and HelloFresh's refusal to take accountability is utterly disgusting.I will never use HelloFresh again and urge others to think twice before engaging with their so-called \"offers.\"", "stars": 1, "review_id": 51627}]