[{"category": "Vehicles & Transportation", "title": "Flix gets you there", "review": "Bus was on time, no issue in finding our seats, which were comfy. Bus was clean and modern and temperature just right on it. Driver was friendly and approachable and enjoyed playing a good selection of music during our trip. Will definitely travel with Flix again!", "stars": 5, "review_id": 76995}, {"category": "Vehicles & Transportation", "title": "Fantastic bus journey experience ", "review": "The bus journey was exceptionally pleasant. The bus was right on time, impeccably clean, and well-maintained. The driver was very kind and helped us with our luggage, adding to the overall positive experience. Highly recommend!", "stars": 5, "review_id": 76996}, {"category": "Vehicles & Transportation", "title": "Smooth drive from A to B . ", "review": "I had an excellent ride from Geneva - Courmayeur. Bus on time, driver driver safely , bus was comfortable, and the price is unbeatable. I can only recommend it ! ", "stars": 5, "review_id": 76997}, {"category": "Vehicles & Transportation", "title": "Very friendly and professional drivers…", "review": "Very friendly and professional drivers and very cheap from Scotland to England. I use FlixBus a lot so I highly recommend theses.", "stars": 5, "review_id": 76998}, {"category": "Vehicles & Transportation", "title": "Reasonably priced, fast and reliable travel", "review": "Bus arrived on time, speedy luggage packing, friendly drivers, fast and reliable service.  Would definitely use again", "stars": 5, "review_id": 76999}, {"category": "Vehicles & Transportation", "title": "Both drivers were absolutely…", "review": "Both drivers were absolutely outstanding! They were not only professional but also very friendly and entertaining throughout the journey. Their excellent service made the experience truly enjoyable, and I would highly recommend them to anyone.", "stars": 5, "review_id": 77000}, {"category": "Vehicles & Transportation", "title": "Glasgow to Manchester then Stoke ", "review": "Glasgow to Manchester then Stoke Excellent journey, I would recommend and would use FlixBus again-easy booking system with updates-great price and value -well organised departure -lovely modern coach with usb and comfortable seat -on time, not too many stops, arrived on time Overall I was impressed and pleased with the service and journeyIt was a lot less stressful than using the trains, journey took a little longer but nice to be seated all the way, safe, comfortable and relaxed ", "stars": 5, "review_id": 77001}, {"category": "Vehicles & Transportation", "title": "Best option to travel around Portugal", "review": "Best option to travel around Portugal. Safe, very comfortable, good Internet, good price. Don't need to worry about GPS, losing exits, paying tolls and road taxes... my first option from now on.*just one concern. During long trips toilet is a problem. Something they can work on. They have WC on board but not all drivers like to give the keys. ", "stars": 5, "review_id": 77002}, {"category": "Vehicles & Transportation", "title": "There price are good", "review": "There price are good, the drivers are polite the set was Comfortable, it left on time and arrived early, and the WiFi worked well ", "stars": 5, "review_id": 77003}, {"category": "Vehicles & Transportation", "title": "Great Trip", "review": "What a superb company to travel with, plenty of times, clean and comfortable bus, friendly driver, so cheap.Mould definitely recommend  ", "stars": 5, "review_id": 77004}, {"category": "Vehicles & Transportation", "title": "The coach was 10 minutes late arriving…", "review": "The coach was 10 minutes late arriving but there was a warning email to inform passengers of this. The journey was smooth and comfortable and the coach was not full so I had two seats to myself. The information provided by the driver was relevant and helpful. It arrived at its destination 10 minutes early in spite of a late departure. Very good value for money.", "stars": 5, "review_id": 77005}, {"category": "Vehicles & Transportation", "title": "Great service", "review": "Great service, comfortable coach and direct journey with no transfers. Pleasant and helpful driver. Good wifi and usb chargers on seats. ", "stars": 5, "review_id": 77006}, {"category": "Vehicles & Transportation", "title": "Safe and Comfortable Journey that was delayed", "review": "Safe and comfortable journey at a low price, though take sanitized hand wipes with you if you use the toilet facility. Bring a torch if you want to read a book etc. due to dim lighting. Arrival was delayed by two hours due to heavy traffic and no fault of their own.", "stars": 5, "review_id": 77007}, {"category": "Vehicles & Transportation", "title": "Bus on time very clean driver polite…", "review": "Bus on time very clean driver polite experience good", "stars": 5, "review_id": 77008}, {"category": "Vehicles & Transportation", "title": "The company has the best drivers I…", "review": "The company has the best drivers I can't forget the one that gave us snacks and motivated everyone to believe in ourselves Thank you ", "stars": 5, "review_id": 77009}, {"category": "Vehicles & Transportation", "title": "Flixbus is my go to ", "review": "Flixbus is my go to , when I travel from Aberdeenshire to glasgow . Punctual, friendly professional drivers and state of the art coaches , with everything you need for a comfortable journey . ", "stars": 5, "review_id": 77010}, {"category": "Vehicles & Transportation", "title": "The bus was very comfortable and very…", "review": "The bus was very comfortable and very warmI felt asleep  The driver was also very good I recommended it ", "stars": 5, "review_id": 77011}, {"category": "Vehicles & Transportation", "title": "Better than national express.", "review": "Simply it was superb as compare to national express. Seats are way more comfortable as compare to national express.", "stars": 5, "review_id": 77012}, {"category": "Vehicles & Transportation", "title": "Fantastic and Comfortable Journey!", "review": "I had a fantastic experience traveling from London to Manchester with FlixBus! The journey was smooth, the bus was punctual, and the seats were incredibly comfortable. The onboard amenities, including charging ports and Wi-Fi, made the trip even more enjoyable. The driver was professional, friendly, and ensured a safe journey. I also appreciated the clean and well-maintained interior of the bus. FlixBus truly offers excellent value for money, and I highly recommend it to anyone looking for affordable and reliable travel options.", "stars": 5, "review_id": 77013}, {"category": "Vehicles & Transportation", "title": "Excellent driver Kai, makes Flixbus standout!", "review": "Excellent way of traveling. Good connections, good price, clean bus, usable toilets, good drivers. I’m using Flixbus instead of driving for almost a year now, I hope they’ll keep the prices down. Kai, the driver, made my journey memorable. Smooth driving, no doubt the best of my journeys so far with Flixbus. ", "stars": 5, "review_id": 77014}, {"category": "Vehicles & Transportation", "title": "Bus cancelled but rebooked an hour later ", "review": "Although our bus we bus was cancelled and advised five minutes after the bus was supposed to depart we easily rebooked fir an hour later , all in all good value for money ", "stars": 4, "review_id": 77015}, {"category": "Vehicles & Transportation", "title": "Pleasant journey", "review": "Bus stop was fairly easy to find, bus arrived 10 mins early, and the driver was lovely and helpful stowing bags. Journey was smooth with no dramas. My complaints are the scheduling - not enough buses to choose from for flight times, and if your flight arrives late for return journey you have to buy a new bus ticket (too late to cancel for refund)", "stars": 4, "review_id": 77016}, {"category": "Vehicles & Transportation", "title": "Bridgend to Bristol airport", "review": "The bus arrived on time at Bridgend. It was nice and clean and comfortable. The down side was that we paid for allocated seats but the seats where not numbered so lots of pasengers confused to where to sit. Luckly the bus was not too busy. There was also no wifi.", "stars": 4, "review_id": 77017}, {"category": "Vehicles & Transportation", "title": "It was ok in general", "review": "It was ok in general except for the space for my hand luggage. On time, comfortable but this was an issue during journey because the movement was \"normal\" but my luggage went down.", "stars": 4, "review_id": 77018}, {"category": "Vehicles & Transportation", "title": "We arrived nearly an hour ahead of…", "review": "We arrived nearly an hour ahead of time, this was much appreciated because I was on my way to work.  Driver was good but spoke a little too close to the microphone   and I couldn't always understand what he was saying.Would have been good to have had a reading light above the seat, I suggest if you want to read on your journey, take a torch.", "stars": 4, "review_id": 77019}, {"category": "Vehicles & Transportation", "title": "Our First Flix experience", "review": "The bus was 5 minutes late in arriving, but I received an eml. informing me of the delay. Inside the bus was lovely and warm, as the weather was bitterly cold.Only problem - people who had boarded earlier, did not comply with seat allocation. Hence our allocated seats were occupied and we had to sit in odd seats. I feel the driver should check and insist as people board the bus, that they sit in their correct allocated seats. Especially, as  pre-reserved seats, cost more money than the standard fare.Only other complaint - the tray table was dirty and had chewing gum stuck to it.  Hence, another prior pre-check for cleanliness and hygiene standards, would be advised.", "stars": 4, "review_id": 77020}, {"category": "Vehicles & Transportation", "title": "Use public transport ", "review": "Used Flixbus to get to the ski slopes. Comfortable, cheap and on time. I would encourage anyway to use public transport when they can and Flixbus are doing it right.", "stars": 4, "review_id": 77021}, {"category": "Vehicles & Transportation", "title": "The bus showed up on time and reached…", "review": "The bus showed up on time and reached the final destination on time. The bus was clean. However, for internationals traveling, it can be a little difficult communicating because the drivers usually dont speak english.", "stars": 4, "review_id": 77022}, {"category": "Vehicles & Transportation", "title": "All went as advertised", "review": "All went as advertisedAll is done (and feels) on the cheap, but it’s not this life’s winners who are reduced to using long-distance coaches. If you place yourself in the appropriate frame of mind, then FlixBus delivers. ", "stars": 4, "review_id": 77023}, {"category": "Vehicles & Transportation", "title": "Cheap and comfortable travel", "review": "The coach was comfortable and well-driven, from Glasgow to Preston but had been designed without reading lights. As an 80-yr-old book reader on such a journey I found this annoying after 16:00.My daughter told me to use the flashlight/torch function on my phone – problem solved. ", "stars": 4, "review_id": 77024}, {"category": "Vehicles & Transportation", "title": "Perfect and would do again ", "review": "Storm Bert forced us - a family of 4 - to abandon the train and use the coach to travel back to South Wales from London. Coach was new, very clean and a super smooth ride. Power sockets worked and whole process very efficient and arrived on time. Leg room a bit tight for me (6,1) and coach got quite warm and humid. Overall a really positive experience and no sign of profiteering out of the train situation unlike a certain other company. We’re regular train users but would now defo consider using FlixBus again.", "stars": 4, "review_id": 77025}, {"category": "Vehicles & Transportation", "title": "Very happy with the journey", "review": "Very happy with the journey, punctual and excellent driver. Would however like reserved seats so marked. It should not be customers responsibility to ask someone to move from your seat ", "stars": 4, "review_id": 77026}, {"category": "Vehicles & Transportation", "title": "Arrived 15 minutes earlier than the…", "review": "Arrived 15 minutes earlier than the scheduled time, and this gave me the opportunity to connect to my next bus that was supposed to leave in 10 minutes time", "stars": 4, "review_id": 77027}, {"category": "Vehicles & Transportation", "title": "5  stars? ", "review": "Would of given 5 stars but on the journey back the driver swap was delayed due to our new driver going to the wrong place apart from that made good time journey was comfortable fully recommend ", "stars": 4, "review_id": 77028}, {"category": "Vehicles & Transportation", "title": "Great value and experience. I will use again.", "review": "The booking process quick & easy.The condition of the coach is great, comfy seating and WiFi/charging ports.Seating can be confusing as people don't realise they have seating allocated and people sitting in the wrong seats. So check your seating prior.Pick up/ drop off points not very clear. I think maps would be good so no confusion. Bus stop location should be clear.", "stars": 4, "review_id": 77029}, {"category": "Vehicles & Transportation", "title": "Had to find a way to get to London", "review": "Had to find a way to get to London. Flight was diverted, the bus was the only way as it was late and nothing else could get me from Glasgow to London at midnight. Staff was friendly, bus was new and clean. Couldn’t connect to the wifi. All in all it did the job and got me home when no one could. ", "stars": 4, "review_id": 77030}, {"category": "Vehicles & Transportation", "title": "Great value and reliableorted us from A to B safely and…", "review": "Transported us from A to B safely and on time. Easy to book and good price. Friendly and helpful driver. No stress and no issues. The only way it could be better would be to pick up in my village and drop at airport entrance but appreciae Bristol airport doing building work so bit of a trek up hill when you get dropped off. Ok for fit and able but could be an issue for others.", "stars": 4, "review_id": 77031}, {"category": "Vehicles & Transportation", "title": "First trip. Good experience. ", "review": "Was overall very pleased with my recent trip Paris to Lisbon.   Seats are a bit small particularly when seat in front reclines but comfortable too. Was content too with temperature control. The bus is kept at a lower temperature which is much better than being too warm.  Four stops en route for a comfort break and well timed. One stop for  35 minutes allowed for hot food.    Good value for money and no baggage restrictions as I could see.  Would use again for long distance travel.  Cuts airport hassle and I enjoyed the scenery too for such trips.   ", "stars": 4, "review_id": 77032}, {"category": "Vehicles & Transportation", "title": "Excellent Value for Money", "review": "I travelled from Bristol to Manchester to take part in a national conference and stayed with my daughter who now lives there. She recommended FlixBus as the easiest way to make the journey - and I was very pleased that I took her advice. The coach was clean and comfortable and the outward and return journeys both ran on time. Because I had booked online well in advance the round trip cost less than £13.00, which I think is astounding value for money.My wife and I will be spending Chritsmas in Manchester and we shall certainly travel by FlixBus.", "stars": 4, "review_id": 77033}, {"category": "Vehicles & Transportation", "title": "These are the plus factors ", "review": "These are the plus factors The punctuality of the departure and arrival times, the price is cheaper compared to other coaches and the drivers were friendly especially the ones from Bristol-Swansea (5.10.24 @ 5:35 pm).However, the toilet (4.10.24 from Swansea @ 1:10 a.m) stinks.  It needs deodorising considering it’s for a long distance journey.I’ll still be using flix bus for my next trip and we also recommend it.", "stars": 4, "review_id": 77034}, {"category": "Vehicles & Transportation", "title": "Please fix seat assignment issue ", "review": "Huge negative: it's always messy with seats assignment in the Flixbus UK. My experience all the times I am using it: I have seat assigned , someone is already sitting there, they say that somebody was seating on their seat so they took another one. They suggest   I take another one. Ok, I actually don't mind (as I didn't book the seat it was just assigned to me), I take another one only to have someone coming to me minutes later and claim it is their seat. It is a really bumpy start to be honest!To avoid that I'd  suggest to clearly mark each reserved seat as \"reserved\" (where people paid for that) so that people would not sit there, and keep the rest unassigned. It seem to work for National Express.If not that issue above, I'd put 5, as otherwise  the bus itself is nice and clean and the driver is polite, schedules are good etc. Just please fix the seating problem!", "stars": 3, "review_id": 77035}, {"category": "Vehicles & Transportation", "title": "Best Option for Cost and Worth ... Just Try Your Luck !!!!!!", "review": "The staff was friendly and helpful.  And the ease of Travel is amazing ... just Not Comfortable enough ...Mostly chose because of Baggage Allowance But the Sudden change of Bus timing ... and Cancelling our bus ...was Absolutely inconvenient Also the Recliner of the Highest Paid Reserved Seat was Not Working ... That was the Most Uncomfortable part followed by the Unclean Bus Smell ", "stars": 3, "review_id": 77036}, {"category": "Vehicles & Transportation", "title": "Some things to improve", "review": "The schedule was precise, the driver was very friendly. The place where to take the bus was not very clear and it caused us some inconveniences. The seats, even after paying for the ones that said they offer more comfort, are too short.", "stars": 3, "review_id": 77037}, {"category": "Vehicles & Transportation", "title": "À mixed bag between Manchester and Paris ", "review": "A mixed bag.We travelled from Manchester to Paris and back on the direct service.We had a fantastic team of drivers on the way out.They were very attentive, told us everything we needed to know, including when going through the border, customs...They kept the bus clean, drying the steps so no-one would slip.They worked together very well, for instance when passing through tight spots...On the return leg, the drivers hardly said a word to passengers. Didn't bother to say where toilets were, or telling people to use their seat belts.They didn't say anything about mobile phone use but when my daughter talked to her boyfriend, the non driver told her off in an unacceptable way. Furthermore, their instructions at French border control were unclear which irritated the French security staff who demanded all luggage to be scanned as a result.One passenger was detained at British border control for nearly an hour. The drivers didn't bother to explain what the situation was.When leaving the ferry, the driver made a slight mistake and the right mirror of the bus hit the left mirror of a lorry. No damage done.While I gave our experience 3 stars, I enjoyed the journey and my next trip to Paris will be on-board a Flixbus coach.", "stars": 3, "review_id": 77038}, {"category": "Vehicles & Transportation", "title": "Flix bus provided incorrect collection…", "review": "Flix bus provided incorrect collection point and did not seem bothered.  When I found the correct collection spot the driver was very good.  That is the only positive.", "stars": 3, "review_id": 77039}, {"category": "Vehicles & Transportation", "title": "Cheap but you get what you pay for. ", "review": "Cheap, but you do get what you pay for. Bus was 55 minutes late. Wifi is pretty unstable therefore pointless considering 5g was a little better. Some chairs don't have a proper charging point and only a low-powered USB port. The bus was clean and the trip was cheap though. ", "stars": 3, "review_id": 77040}, {"category": "Vehicles & Transportation", "title": "pro and cons", "review": "positive:- very reasonable price for long distances- plug for electricity simply greatnegative- dirty tables- unkind and unpleasant staff, especially to foreigners", "stars": 3, "review_id": 77041}, {"category": "Vehicles & Transportation", "title": "Bus didn’t make it to the destination booked ", "review": "Bus didn’t make it to its final destination after a hold up on the motorway. The driver said he had driven up to his driving hours  and left us at the wrong terminal with no advice of where to go. ", "stars": 3, "review_id": 77042}, {"category": "Vehicles & Transportation", "title": "Journey from Bruges to Edinburgh via…", "review": "Journey from Bruges to Edinburgh via London. Bus from Bruges to London was fine but bus from London to Edinburgh was not. The seats were too close together and there was no legroom. Got swollen feet as a result. I'm not a particularly tall person either. ", "stars": 3, "review_id": 77043}, {"category": "Vehicles & Transportation", "title": "👋 Hi All ", "review": "👋 Hi All Had super good trip in 🇩🇪 Germany last year, all in time to Belgium .Unfortunately in Seotember my coach from London Finchley Rd to Manchester got cancelled , I re booked from London Victoria - Manchester + it got cancelled  again for the next day,  I then had enough + bought a train ticket + stayed another night at a hotel. I got a refund from Flix bus but main rides from city to city should get an emergency coach in order to avoid travellers experiencing a tragedy after cancellations. I still will use Flix bus but the management needs to avoid cancellations at all costs. The coaches are comfy + clean, staff was polite. 🎄🎄", "stars": 3, "review_id": 77044}, {"category": "Vehicles & Transportation", "title": "Flixbus is", "review": "Flixbus is, let's say, well, the coach was late for starters, the dam boarding procedure was half assed and disorganised. Anybody with a waist over 32 regulars gunna have a real hard time releaving himself for a number two let me tell you. Overall tho, a blinding mind numbing thirteen friken hour soup crushing drive, we got the safe happy relaxed and content, with a new found since of dammit I love long coaches without miniaturised sleep compartments. Not bad, not bad. Ahem, cough, cough", "stars": 3, "review_id": 77045}, {"category": "Vehicles & Transportation", "title": "Comfortable trip and good driver. No destinations signs", "review": "An easy 2 hour trip.Seats could be cleaner, especially headrests but  seats were comfortable. Good driver.Unhappy about lack of signage as to where the bus was going.A mass of Flixbuses with not one indicating destination and no one to advise was infuriating.", "stars": 3, "review_id": 77046}, {"category": "Vehicles & Transportation", "title": "My 18:00hr departure bus was late and…", "review": "My 18:00hr departure bus was late and rescheduled to arrive 19:20hrs.It eventually turned up 19:40hrs. The Bus Station was very draftee, cold and the station toilet facilities disgusting.However, the Flixbus coaches are clean, modern and comfortable, when they do turn up.  Since posting the above, in my inbox, I subsequently saw a 15% discount voucher Flixbus had sent me, for my next booking, as an apology for the delay. So I have to give them credit for at least offering me compensation for what happened,", "stars": 3, "review_id": 77047}, {"category": "Vehicles & Transportation", "title": "Lille to Antwerp on Sunday evening", "review": "Lille to Antwerp on Sunday evening. Safe and fast ride. However, my legroom was fit for a child, while other seats provided more space. Luckily, I was able to find another available seat. The noise and smell next to the toilet was far from comfortable.", "stars": 3, "review_id": 77048}, {"category": "Vehicles & Transportation", "title": "Took bus from London to Glasgow", "review": "Took bus from London to Glasgow. Roadworks just before Glasgow so diverted off motorway.  Thankfully the spare diver was there as the driver got very stressed with the awful road conditions which were very foggy and very twisty roads. The driver was cursing a lot which I didn't like being behind him. Also at a roundabout the spare driver told him to take a right and the driver was about to actually turn right approaching the roundabout!!! ", "stars": 3, "review_id": 77049}, {"category": "Vehicles & Transportation", "title": "London to Peterborough", "review": "London to Peterborough, the trip there was fine, running late coming back by 40 minutes which considering it arrived just after 10pm was not great. Visiting a friend, in the past I’ve travelled by National Express but now there is only Flixbus and only one bus a day there and back, why not more buses from London to Peterborough? In future I’ve decided I’ll probably just take the train which is pricey, but more options with times to travel and more comfort. Bit of a shame really", "stars": 3, "review_id": 77050}, {"category": "Vehicles & Transportation", "title": "Driver smoking cigarette while fueling bus.", "review": "I was appalled to see the driver and his assistant smoking a cigarette while fueling the bus in the gas station.  A couple times I saw the bus driver texting or holding his phone for a call while driving; this should not be permitted and made passengers uneasy.On the good side, I was glad to see 3 different drivers involved with the long overnight journey.", "stars": 3, "review_id": 77051}, {"category": "Vehicles & Transportation", "title": "I travelled from London to Nottingham…", "review": "I travelled from London to Nottingham and back. The journey to Nottingham was great, however the back journey wasn't so lovely. Half way through they decided to stop and empty the toilets. I sat in the middle right next to toilet. It took about 15 min for them to empty the toilets etc.and the smell was unbearable. They could have given us other seats knowing that this is planned during the journey.  ", "stars": 3, "review_id": 77052}, {"category": "Vehicles & Transportation", "title": "I didn't like the fact that even though…", "review": "I didn't like the fact that even though I had a valid ticket for my travel, I couldn't join the bus because it was not the time I booked. I finished early from school and pleaded with the driver to join him back home, he vehemently refused and asked that i wait for two more hours before my time even when the bus was returning almost empty. Can there also be a day pass ticket you can use anytime you hop on the bus and not necessarily have to wait till the time you booked.", "stars": 3, "review_id": 77053}, {"category": "Vehicles & Transportation", "title": "Flixbus system app must improve ", "review": "Very smooth drive, clean seats and quiet. Arrived safely and on time to destination. Unfortunately the company app platform system has weakness such no selection for 0-2y old. We must buy a ticket then will be refund! That's not true, it's a trap! ", "stars": 3, "review_id": 77054}, {"category": "Vehicles & Transportation", "title": "The coach arrived 30 min late and there…", "review": "The coach arrived 30 min late and there was no updates as passengers waited in the cold. The coach driver's assistant was excessively rude to passengers both on the ground and also on board the coach. He was condescending and verged on bullying passengers. One of my worst experiences and many passengers were complaining. ", "stars": 2, "review_id": 77055}, {"category": "Vehicles & Transportation", "title": "Flixbus is always late", "review": "Flixbus is always late! If you want to get to your destination on time, do not use flixbus! They are more expensive than the more reliable bus. I paid £54 single journey to Bristol expecting I will arrive earlier, but bus is an hour late!. Compared to National Express fare of £34 to Bristol and bus came on time. I was so tired after 19hours plane journey and waiting at the coach station in Heathrow out in the cold is very frustrating. So disappointed! I should have chosen National Express is so much reliable than flixbus.  ", "stars": 2, "review_id": 77056}, {"category": "Vehicles & Transportation", "title": "Ciise saved us from rejected valid ticket!", "review": "It would be 1-star review if it wasn’t for Ciise!! This guy saved our trip! Appreciate it!Flixbus converted a simple trip to a terrible and stressful experience. My girlfriend and I, had booked 2 tickets, London to Leeds and back for Christmas eve, months ago, due to the probable high demand on that day.When we arrived for the outbound, the driver told us the our QR code is not valid and we do not have seats in that bus, believing we were mistaken. So the bus driver and the manager there did not let us in and our bus left without us!!As it turned out, the tickets were correct and flixbus had cancelled our tickets without any notice or refund (!!!) due to some station name change or system problem, I dont know. So imagine, we had booked and paid probably first of all the passengers of the bus and finally we were the only ones without tickets and staying without bus in Christmas eve!! Imagine the stress, the frustration and the injustice of this situation, without having done anything wrong. It was a clear theft and then ignorance from flixbus.At that point we couldn’t do anything, but fortunately we explained the situation to the manager (probably), who was Ciise, he understood that we were right and acted quickly after understanding the issue. He talked to the bus driver who had already left and agreed that he would wait for us on a next stop where we found him using the subway after 40 minutes! It was a stressful and tiring experience, but at least we managed to find the bus and hop on (without having actual seats, but seating where other previous guys left!)) reaching our destination on time fortunately, thanks to Ciise who arranged the whole thing!He also updated our inbound tickets without any extra cost, because if we had to wait for flixbus support…we would be still there! And he did all that on Christmas day! Thank you Ciise!We have been using flixbus for a lot of trips and we have never faced or expected a situation like that from a trusted company like that. We didn’t expect either to be dependent on one man’s good will.Of course we will ask for a refund and hope such a situation doesn’t happen ever again to us or anyone else.", "stars": 2, "review_id": 77057}, {"category": "Vehicles & Transportation", "title": "Needs improvement.", "review": "Good points: punctual; comfortable seats; WiFi good; seat reservations worked; good value.Bad points: absolutely disgusting toilet: urine/water all over the floor; hand drier broken; no useable toilet paper; extremely cramped space.Driver played his choice of music loudly. Unacceptable & just encouraged passengers to do likewise.", "stars": 2, "review_id": 77058}, {"category": "Vehicles & Transportation", "title": "The bus was cheap enough but the driver…", "review": "The bus was cheap enough but the driver was in such a bad mood, and dropped us off before the bus station saying we wouldn't want to drag our stuff through the bus station, even though I had another bus after that one so needed to go to the bus station. I paid for assigned seat and none of the seats where numbered so we couldn't have found our seat if we wanted to, so they charged me for nothing, that was a complete waste of money. Just appalling from hidden costs to grumpy drivers, definitely crap all round.", "stars": 2, "review_id": 77059}, {"category": "Vehicles & Transportation", "title": "Disappointed This is the second or third time I have…", "review": "This is the second or third time I have reserved seats with Flix and those seats have been occupied . I have even paid for adjoining seats in order to ensure some privacy but those too have been occupied. Very disappointed indeed. ", "stars": 2, "review_id": 77060}, {"category": "Vehicles & Transportation", "title": "Hot and smelly", "review": "It was extremely hot and smelly and all the passengers were gathered at the back, we were told we couldn't use the empty seats at the front even though there were no passengers there for the whole trip...when we asked to switch off the heating, the aircon was put at full blast and we were freezing", "stars": 2, "review_id": 77061}, {"category": "Vehicles & Transportation", "title": "I was charged adult ticket for 2 years old baby", "review": "I was travelling with my family, myself, my wife and 3 kids from Munich to Zurich. I booked online on advance, I couldn't entre the details of my 2 years old baby. The supervisor at the station charged me extra ticket for adult with EUR 60.99. Horrible experience. ", "stars": 2, "review_id": 77062}, {"category": "Vehicles & Transportation", "title": "Avoid.", "review": "Booked a trip for February, the event was cancelled so I cancelled my trip. They put my refund in to an unwanted travel voucher and demanded I accept this. When I requested my own money, that was not owed to them as I had no received any form of service, they said no, even though on their website it says you have the legal right to be refunded in to your bank.I ended up contacting my bank who claimed the refund on my behalf. Would never recommend them again..", "stars": 2, "review_id": 77063}, {"category": "Vehicles & Transportation", "title": "Bus delayed", "review": "We were supposed to get a bus from Matera to Bari for our flight home but the bus was delayed by 2 hours we would never have found this out as no notification whatsoever.  Only from the help of a kind Italian speaking  passenger, who arranged a mini bus taxi for us all to share and get to Bari (Monday 21st October) ", "stars": 2, "review_id": 77064}, {"category": "Vehicles & Transportation", "title": "Low prices doesnt mean anything.", "review": "Low prices doesnt mean anything.Camcelled my second part of journey. When i chrck the bus schedule after cacellation it was still there double price and soon fully booked.And first time i went with them wifi didnt work.So my ticket was 6, whcih carefully second part was 1.5 so they dont need to refund by polici and easily cancell.. i needed to rwbuy wxpensive bus because od this, while originaly i had more options to drive my journey.Psycjopatical way of transport.", "stars": 2, "review_id": 77065}, {"category": "Vehicles & Transportation", "title": "Cancelled bus ", "review": "We booked a return ticket from London to Bristol. Outbound journey from London on Thursdays evening was smooth and arrived Bristol on time. However, our return bus on Sunday got cancelled. No notification sent on the app. Only an email two hours before our journey was sent. When we realised, it was too late to book the next bus. Next two buses were fully booked. It cost us a lot to get another bus ticket from a different company. Our return was very stressful rushing around to get another company ticket. They are not reliable. If you are not in a hurry and want some cheap deals you can use. ", "stars": 2, "review_id": 77066}, {"category": "Vehicles & Transportation", "title": "Seat reservation disaster ", "review": "Once again seat reservation didn't match what I booked.Don't like having to ask people to vacate their seats.Explained to driver that I booked front panorama right, to be told I must sit on the left. Right occupied 👎Cardiff has become a nightmare taking far to long due to stop location.Where it is now, is just too far for perspective passengers, who usually have to bus it in to the city anyways. Flix need to operate a service to Birmingham, for connecting services to the Midlands and all points north.National express is the only viable option. ", "stars": 2, "review_id": 77067}, {"category": "Vehicles & Transportation", "title": "My travel from London to Cardiff is…", "review": "My travel from London to Cardiff is always ruined by 30-40mins waiting time in Newport waiting for a driver running late. You guys are no different from megabus always running late. You guys can do better", "stars": 2, "review_id": 77068}, {"category": "Vehicles & Transportation", "title": "Wrong bus location…", "review": "Followed the instructions on the Flix bus app on where to go to find our upcoming bus at Venice Metre Station (travelling to Slovenia) and we were in the exact location it described, the correct bus stop number and was in front of a cafe that it said it would be. So we did everything right. As I’m tracking the live location of the bus, it looks as if it’s going a different route to what was planned and arrives on the OPPOSITE SIDE of the road. Keep in mind, that the street we had to run across was extremely busy and not so easy to cross in such a short moment. Thank goodness we were lucky and had the chance to run across the road without cars, because otherwise we would’ve missed our bus. This induced an awful lot of anxiety :/ ", "stars": 2, "review_id": 77069}, {"category": "Vehicles & Transportation", "title": "Poor service probably due to Olympics.", "review": "I think they are using tempoary bus stop in Paris due to Olympics. The bus was late, no one knew what was happening, no information, \"track my trip\" wasn't working. Bus left 43 minutes late, we got to our destination after trams ceased, so needed an Uber into town. would have been better if there was information or leaving from proper bus station. Once on bus all was fine.", "stars": 2, "review_id": 77070}, {"category": "Vehicles & Transportation", "title": "My journey 26 Oct 2024 for 16:40 from…", "review": "My journey 26 Oct 2024 for 16:40 from Manchester- Shudehill interchange to London Victoria was severely delayed for over 45mins.Kind regards,Ifeoma Ahumibe ", "stars": 2, "review_id": 77071}, {"category": "Vehicles & Transportation", "title": "They can cancel bus at a short notice…", "review": "They can cancel bus at a short notice which can disappoint your entire journey plans. They do offer alternatives which may not necessarily suit you. Not sure how  to trust them next time. They canceled our bus to Paris from London and this upset some of our plans. ", "stars": 2, "review_id": 77072}, {"category": "Vehicles & Transportation", "title": "Closed washroom, bad wifi, more stops", "review": "Washroom was closed and there were at least two more stops than noted on my itinerary. The lady sitting beside me was going to miss her train as a result. Wifi didn’t work for the last half of the trip. Not what I expected at all. Driver was also a bit condescending.", "stars": 2, "review_id": 77073}, {"category": "Vehicles & Transportation", "title": "We travelled with flixbus to London", "review": "We travelled with flixbus to London, as we have done before The first 2 hours of the journey we had a lovely friendly chatty driver, the drive then changed at Peterborough The new driver was arrogant, rude and obnoxious We were informed he didn’t want to listen to our phone calls or listen to our music, then Played his radio really loudly, turning it up when one passenger was on a telephone call We were told that if left any rubbish that he would report the worst 5 seats and the next time we traveled we would be charged extra Then on all of the journey on the way to London he was constantly shouting at other drivers, pressing his horn and swearing which is absolutely unacceptable ", "stars": 2, "review_id": 77074}, {"category": "Vehicles & Transportation", "title": "Left stranded with no other option available ", "review": "It is one of the most economical but worst bus service I’ve travelled with. I travelled with them multiple times and every time the bus was either delayed or cancelled. I stopped with them after I got stranded at a station as their bus was cancelled couple of hours before the travel and there was no other option available as it was holidays. Never gonna take any more chances with them just to save couple of bucks. Their service is absolute nightmare! ", "stars": 1, "review_id": 77075}, {"category": "Vehicles & Transportation", "title": "Missed the FlixBus back from Bristol to…", "review": "Missed the FlixBus back from Bristol to Cardiff. We were looking for it in the snow with my 82 year old mum who was in an assistance wheelchair because she has a heart problem, but couldn’t find it because it was unbranded. Finally spotted the coach as it was pulling out of the bus park. Had to travel by bus and train instead. ", "stars": 1, "review_id": 77076}, {"category": "Vehicles & Transportation", "title": "A truly terrible company - left my wife and kids stranded", "review": "A truly terrible company, my wife who was travelling with out two toddler kids got denied access to the coach for not having a car seat with her. This is absolutely ridiculous. Who brings a car seat with them for a coach journey. The bus driver was incredibly rude and the left my family stranded in the dead of night!!! Avoid this company at all costs.", "stars": 1, "review_id": 77077}, {"category": "Vehicles & Transportation", "title": "Not cheap but worse", "review": "The worst service to use. The bus driver was literally shouting at the passengers. My return journey that night was delayed over 140 minutes and had to stand in the freezing cold as shelter at the stop. I contacted customer services the next day for delays compensation and was shrugged off as the journey took place even it was delayed. Will never be using FluxBus again :(", "stars": 1, "review_id": 77078}, {"category": "Vehicles & Transportation", "title": "Horrible", "review": "Horrible! We were waiting during 1hour at -7 degrees, under the snow. With no answers, not comunication and final y the bus was cancelled with no explanation. We have to take a flight so it costs us 300 pounds of taxi", "stars": 1, "review_id": 77079}, {"category": "Vehicles & Transportation", "title": "Appalling service", "review": "Appalling service when I left my luggage on a coach to Bradford . I spent the entire weekend trying to get back my luggage when I was travelling to another city. Customer service advisors were no help.1 advisor disconnected my call after telling me we are going round in circles the other 3 gave same robotic response to advise it will take up to 14 days to get my suitcase back.", "stars": 1, "review_id": 77080}, {"category": "Vehicles & Transportation", "title": "35% refund of total cost in vouchers :(", "review": "Unfortunately I couldn’t make my return journey from London to other city destination due to personal reasons beyond my control. I contacted Flix Bus in good time and was told nothing could  be done except for offer me a refund in vouchers. I was within 14 day cooling off period so I’m not sure this was correct. However, for a trip I paid £40 for I was offered £14 in Flix bus vouchers….which I wasn’t sure I could use again. Will definitely use NE in future. ", "stars": 1, "review_id": 77081}, {"category": "Vehicles & Transportation", "title": "Very poor service", "review": "Very poor service. Couldn’t find their right stop as Sat Nav took my uber to another stop and I was there waiting. Called the customer care and said my bus already left at the stop. I was stranded as it was an evening bus. Had to take another uber to get to National Express for another ticket ", "stars": 1, "review_id": 77082}, {"category": "Vehicles & Transportation", "title": "Coach did not arrive at CL stop on…", "review": "Coach did not arrive at CL stop on Finchley Rd and Flixbus app was not updated correctly. All drivers of other coaches were not helpful.Ended up sharing an Uber with a fellow deserted passenger. Shocking experience would not wish it on anyone.I have since learned that service was cancelled, without any notice. App never told me anything and actually showed journey being completed. Cost me £150 in an Uber. Shocking experience all around, shame on you Flixbus...", "stars": 1, "review_id": 77083}, {"category": "Vehicles & Transportation", "title": "Shit bus", "review": "I just can't believe this. They kept on delaying the bus timings until they cancelled the whole journey. Ruined my Christmas. Shame on you flixbus. Bullshitbus. ", "stars": 1, "review_id": 77084}, {"category": "Vehicles & Transportation", "title": "Flixbus Review: A Journey of Disappointment", "review": "I had high expectations for my trip with Flixbus, but unfortunately, the experience was far from pleasant. The advertised amenities, particularly the Wi-Fi, were one of the main reasons I chose this service. However, at the last minute, the bus was swapped with a subpar one.The replacement bus was dreadful:No Wi-Fi, as promised.Uncomfortable seats that made the journey a literal pain.The entire bus smelled unpleasant, which added to the discomfort.To make matters worse, the trip was significantly delayed due to a collision on the road. While I understand that traffic incidents are beyond the company's control, the lack of promised amenities and the poor condition of the bus made the delay unbearable.Flixbus should ensure that their services meet the advertised standards, even in cases of last-minute changes. This experience has made me think twice about booking with them again", "stars": 1, "review_id": 77085}, {"category": "Vehicles & Transportation", "title": "Last Minute Airport Bus Cancellation- BEWARE!…", "review": "We booked tickets to travel to Heathrow airport from Cardiff on December 29th 2024.We were waiting at the bus stop and 15 minutes before departure I realised that I had just been sent a text from Flixbus saying the Heathrow & Gatwick services had to be cancelled! I then checked to see that I'd had earlier text messages saying the service was running behind schedule & then one 8 minutes later saying it had been cancelled. So, we now risked missing our flight and losing well in excess of £1000.We ran to the train station and had to buy replacement tickets costing just under £130.It was that or lose the holiday.It is incredible how a big company like Flixbus think that they can operate like this- especially on airport routes! They say they will refund our tickets but that would leave us £70+ out of pocket.They are not only unprofessional but totally unethical in their approach.This was my second booking on Flix but it will be my last.I definitely intend on taking this complaint further.I hope that the UK leaving the EU will not mean that regulations have been watered down.We'll see.", "stars": 1, "review_id": 77086}, {"category": "Vehicles & Transportation", "title": "False advertisements and rude driver", "review": "And if I can give negative stars I would, they advertise using NEC cards for a discount but the driver won't let you on just bc they feel like it. Absolutely 0 help when asked what can we do to solve the issue bc we had a train booked and they just gave us their back and left us stranded. We missed our train for our holiday and there was no way to refund us. And months of planning just went down the drain bc of the driver kept speaking over us and refusing us. And online chat think we got on the bus again 0 help.I asked the box office at buchanan bus station and they told us they were valid tickets. Maybe it's bc we're Muslim? If flexibus see this please contact me bc I can't think of another reason other than ur racist driver.", "stars": 1, "review_id": 77087}, {"category": "Vehicles & Transportation", "title": "If I could leave zero stars I would", "review": "If I could leave zero stars I would. When we arrived in Dover the driver told us there would be a FIVE HOUR delay, with NO EXPLANATION he simply angrily said it wasn’t his problem. So when we got to Paris we were so late that we missed our connecting trains from neighbouring Gare de Lyon (even though we had allowed several hours in case of any delay) and had to purchase new tickets costing over €500 and getting us to our destination 14 hours later as the trains were all booked being so close to Xmas and we had to wait until the night and get a night train. The driver was unfriendly and rude in the circumstances. Shocking really. ", "stars": 1, "review_id": 77088}, {"category": "Vehicles & Transportation", "title": "Get the National Express coach or a train ", "review": "Get a load of this. Coach was supposed to arrive at 13:40hrs. At 14:00hrs, the coach is a no show. I check live updates and it’s apparently already left. I speak to customer service and they tell me that it left at 13:41hrs and all passengers are on board. There’s about 7 passengers with me and they said they didn’t get the same coach. Mind you I was at that stop from 13:20hrs. So unless I’m blind or that coach was powered by superman, I didn’t see shit. They refused to refund my ticket and customer service had the cheek to say “Have a nice trip” like I’m supposed to abracadabra to my destination. ", "stars": 1, "review_id": 77089}, {"category": "Vehicles & Transportation", "title": "Booking page doesnt state clearly the…", "review": "Booking page doesnt state clearly the prices for childres As all other transportation in the country have free tickets for toddlers Also doesnt clearly state the need for a car seat for their travel And after we areived to the departure point , waited for 20min the bus came late and so didnt have the ability to fix anything by buying other tickets or getting a car seat from my car just adjacent to bus stop And although he came late he didnt waited for me to solve these issue or to call customer service And so my Christmas holiday was shit because of this and we couldnt get on the bus Although they ticked my ticket and considered me already travelled that Trip!!!!!!!! I wouldnt use this bus company again", "stars": 1, "review_id": 77090}, {"category": "Vehicles & Transportation", "title": "Never again with Flixbus", "review": "Bus was changed, we rebooked the sits and due to change the original sits was not available!Toilets out of orderOver 2 hrs delay reaching the destination Paris No charger and no WiFi Very dirty bus and the driver was driving extremely careless and fast never again!!Photos available but can’t attached ", "stars": 1, "review_id": 77091}, {"category": "Vehicles & Transportation", "title": "It's been a bad trip think twice before using Flixbus", "review": "It's been a bad trip, driver mid way said it bus is missing its routine service and ask all passengers with luggage to get down and wait at Bristol the next bus will come in few minutes. Which then became more than 1 hour waiting in the cold, after that another older bus loading all passengers back on way to Exter and Plymouth. With the late evening traffic finally a 6 hour intended trip became greater than 8 hours running into late evening and rush hours traffic. ", "stars": 1, "review_id": 77092}, {"category": "Vehicles & Transportation", "title": "Bad experience", "review": "Bad experience, instead of being a direct service from London Victoria to Plymouth, via Bristol and ExtterAll passengers are asked to exit and re board another bus from Bristol. This bus has to go for routine matenace driver announced on the way. While we wait for the next bus now at Bristol, finally after about an hour they found another bus for all the passengers to reach to their original destinations. Looks like the overall journey is going to take more than 2 hours due to additional traffic hours. No to Flixbus for me anytime soon :(", "stars": 1, "review_id": 77093}, {"category": "Vehicles & Transportation", "title": "Bus driver smoking non stop", "review": "The driver kept smoking all the way from Sofia to Thessaloniki. Apart of that we were bitten by bed bugs and the luggage compartment was covered with a thick layer of dust.Most likely the bus wasn't clean properly because we have to come back to Sofia to change bus due a mechanical issue, but still...was a very bad experience.", "stars": 1, "review_id": 77094}]