[{"category": "Money & Insurance", "title": "Visited Leicester clock tower branch…", "review": "Visited Leicester clock tower branch for updating my details where Deepali helped us. She also helped in balance transfer too. She was amazing and excellent customer service from her. Thank you. ", "stars": 5, "review_id": 58665}, {"category": "Money & Insurance", "title": "Great Service ", "review": "Great Service Visited Clock tower branch Leicester.Had lovely experience chatting with associate name Shubh.He listened carefully and solved my query within few minutes.", "stars": 5, "review_id": 58666}, {"category": "Money & Insurance", "title": "I recently visited the hsbc clock tower…", "review": "I recently visited the hsbc clock tower branch. I went there to inquire about my financial loan and there is the banker of Mr. Pranav and he guide me very well and he is very helpful.", "stars": 5, "review_id": 58667}, {"category": "Money & Insurance", "title": "Just opened a new premier account with…", "review": "Just opened a new premier account with them and the service has been amazing - new card is lovely and lots of benefits!! Very happy ✈️🥰", "stars": 5, "review_id": 58668}, {"category": "Money & Insurance", "title": "I visited Leicester branch today to get…", "review": "I visited Leicester branch today to get a bank loan and served by Mr Pranav and helped with all my queries and had an excellent experience. Thank you for your help and support ", "stars": 5, "review_id": 58669}, {"category": "Money & Insurance", "title": "profesional service", "review": "Thank you very much to Marta for professional service and help, expert advice, and also very nice approach to the client. I recommend this bank.", "stars": 5, "review_id": 58670}, {"category": "Money & Insurance", "title": "A huge thanks to Chris in the…", "review": "A huge thanks to Chris in the Scunthorpe branch. He sorted my query out with ease. Professional and courteous. Thank you so much ", "stars": 5, "review_id": 58671}, {"category": "Money & Insurance", "title": "We visited hsbc bank Leicester clock…", "review": "We visited hsbc bank Leicester clock tower branch today where we were assisted by Pranav he was very helpful and very kind and supportive ", "stars": 5, "review_id": 58672}, {"category": "Money & Insurance", "title": "My experience at Northampton HSBC was…", "review": "My experience at Northampton HSBC was again wonderful and the staff here at this branch are incredible. Elaine was extensive in her assistance and Gina was also quick to jump into the conversation and provide excellent customer service which is customary at this local branch of mine. These ladies are absolutely amazing and they have become like family to me and they know my whole story and listen to me with compassion and empathy… just like family. I get the best customer service at HSBC Northampton and Elaine and Gina and all the ladies who work there are the reason why. ", "stars": 5, "review_id": 58673}, {"category": "Money & Insurance", "title": "Visited Leicester clock tower branch.", "review": "Visited Leicester clock tower branch.Amazing service received from shubh helped me to make the payment and he also helped me to call sky mobile and helped me to set up the direct debit he has helped me from beginning from the day of opening account and till date and I really appreciate the way he helps me every time. Hsbc is the good bank always supportive and keep up the good work. Merry christmas to Hsbc clock tower branch👍", "stars": 5, "review_id": 58674}, {"category": "Money & Insurance", "title": "I had a nice experience opening an HSBC…", "review": "I had a nice experience opening an HSBC account with Richa in Northampton. She is very polite and calm. Takes her time to explain things to your understanding and makes everything about banking with HSBC attractive. She is a nice person.", "stars": 5, "review_id": 58675}, {"category": "Money & Insurance", "title": "Fantastic Customer Service - Lisa Teasdale  - HSBC Newcastle Upon Tyne", "review": "I have had a really good customer service from Lisa, She gave me a lot of time, made sure I fully under stood what I wanted and what I was going to do. Never felt rushed and felt cared for am currently going through a difficult part of my life and Lisa made this so much easier. Its so good and helpful been able to going into a store face to face to resolve issues thank you so much.", "stars": 5, "review_id": 58676}, {"category": "Money & Insurance", "title": "I have visited to HSBC Bank in…", "review": "I have visited to HSBC Bank in Leicester clock tower branch and service the provided I was very happy, Mr Pranav is very helpful and I’m very grateful for service, Thanks ", "stars": 5, "review_id": 58677}, {"category": "Money & Insurance", "title": "I visited bank LEicester clock tower to…", "review": "I visited bank LEicester clock tower to open bank account Mr. Pranav assisted he was so  helpful and gave me an amazing service ", "stars": 5, "review_id": 58678}, {"category": "Money & Insurance", "title": "Resetting Password", "review": "I had a great experience resetting my password. Very helpful staff explaining clearly what I needed to do.", "stars": 5, "review_id": 58679}, {"category": "Money & Insurance", "title": "Eugene from Northampton HSBC is very…", "review": "Eugene from Northampton HSBC is very good boy , and is helping to get everything right ", "stars": 5, "review_id": 58680}, {"category": "Money & Insurance", "title": "Nice experience in Leicester clock tower branch ", "review": "Yesterday I visited Leicester clock tower HSBC branch, and it was so nice experience with Mr. Luke. He helped me to get the account statement and credit card statement with no time delay. He explained everything in prompt manner I finished all in 15 minutes. Xx", "stars": 5, "review_id": 58681}, {"category": "Money & Insurance", "title": "Today i visted leicester clock tower…", "review": "Today i visted leicester clock tower branch for new opening of my credit card . Mr.pranav helped me alot to open it in a easier way and explained me completely about the benefits of using credit card and how i have to use it wisely really happy with his service from HSBC", "stars": 5, "review_id": 58682}, {"category": "Money & Insurance", "title": "Service was excellent help me a lot…", "review": "Service was excellent help me a lot information about my account 10/10Eugene northampton branch", "stars": 5, "review_id": 58683}, {"category": "Money & Insurance", "title": "Never ever had a single problem with HSBC", "review": "Never ever had a single problem with this bank, Im getting loans accepted, credit cards, opened a few different accounts with them, current, savings, investment. There could be some more options to block certain types of card transactions and limit contactless. Halifax does this perfectly but other than this highly recommended bank and products", "stars": 5, "review_id": 58684}, {"category": "Money & Insurance", "title": "I have  visited  leicester  clock …", "review": "I have  visited  leicester  clock  tower  branch  yesterday to open  new credit card  bank  account. The staff  who was dealing  with  me was so  good  and he explained  everything  me very  nicely and helped me to  open  new  credit  card account. I visited  this  branch  many  times I felt  all  staffs are very good. ", "stars": 4, "review_id": 58685}, {"category": "Money & Insurance", "title": "A manager that's a fool", "review": "My local bank has a manager that's an incompetent fool, fortunately the people on the counter know how to do the job better and I was able to open a savings account and shown how to use it. Avoid dealing with the Trowbridge (Wiltshire) manager if you can, most of the other staff members are brilliant. The APP works well and is laid out well and is easy to use and understand.", "stars": 4, "review_id": 58686}, {"category": "Money & Insurance", "title": "HSBC ON BNS SAVER ", "review": "My experience with the HSBC ON BNS Saver savings account was excellent, and it quickly became my preferred online savings option. A key highlight was the 4% interest rate. While many banks drastically reduced their rates, HSBC maintained this high rate, which appeals to savers like myself.However, I recently learned that HSBC plans to reduce the interest rate. Given that the 4% rate is still available, I’m taking advantage of it. It feels like a smart move to make the most of this opportunity before the rate changes!", "stars": 4, "review_id": 58687}, {"category": "Money & Insurance", "title": "Online customer service is great", "review": "Timely support from Kayleigh via advisory chat. Thank you", "stars": 4, "review_id": 58688}, {"category": "Money & Insurance", "title": "Current account basic ", "review": "As my habitat / residing is overseas in Europe, it is rather easy as a Dutchman in the Netherlands, to open online a basic current account at HSBC UK. Great! Most British banks will refuse, as you have to reside in the UK for a bank account but this bank thinks internationally. ", "stars": 4, "review_id": 58689}, {"category": "Money & Insurance", "title": "I was horrified to discover an…", "review": "I was horrified to discover an unauthorised direct debit on my church's bank account today.   I'm the treasurer.   We don't ever use direct debits on the bank account in question.   However, I telephoned the fraud department on the number shown on HSBC website, and Dhruvin cancelled it efficiently and politely.      It is very scary that a fraudster could so easily set up a direct debit on our account.  Perhaps HSBC needs to review what information it requires when setting up direct debits.   Our church has a rule that any two of four signatories must authorise payments.  How could someone by-pass this?", "stars": 4, "review_id": 58690}, {"category": "Money & Insurance", "title": "Relaxed and enjoyable meeting at Hastings' Branch", "review": "Yesterday I met with Dan and Jane at Hastings branch to open a new account. They made the process straight forward, relaxed and informative, and, even, enjoyable. It was great to do this face to face rather than over the phone.Thank you for great service. ", "stars": 4, "review_id": 58691}, {"category": "Money & Insurance", "title": "Helpful staff", "review": "There doesn't seem to be enough staff in the branch however, those who work there are very helpful and try their best to reduce waiting time.  Thank you very much for your assistance today.", "stars": 4, "review_id": 58692}, {"category": "Money & Insurance", "title": "Complaints Dept.", "review": "Had occasion to be transferred from, presumably, the overseas call centre, to the complaints dept which seemed to be UK based.  Once there, received excellent service, with a return phone call to try and sort out a difficult problem of a lost account.  They got there in the end and the agent was very thorough, courteous and efficient.  I was surprised by an offer of \"a gesture of goodwill\" to be paid into my account.  And I don't even bank with HSBC! So it's not all bad.", "stars": 4, "review_id": 58693}, {"category": "Money & Insurance", "title": "Failed to exchange old banknotes", "review": "Found some old banknotes, wanted to exchange at HSBC in Catford as it was my nearest branch and have been told to go to Bromley branch; not exactly a modern approach. In the end just turned at NatWest next door for help. Embarrassing way to solve an issue, but saved me some time", "stars": 4, "review_id": 58694}, {"category": "Money & Insurance", "title": "Thank you, HSBC!", "review": "I lost my debit card on Monday, August 14 and reported this and applied for a new card on the same day via the phone app. I wanted to transfer funds to another bank acct. (not HSBC) but kept receiving the error message saying payee details could not be confirmed. Popped into the Camden town branch and the extremely helpful team member organised the transfer for me and confirmed the new card was in my Apple Wallet. Received a text on August 15 saying my replacement card was on its way and it arrived safely next day! Banks receive such bad press, but HSBC has always been professional and if anything goes wrong, very speedy at fixing the problem. I just hope they continue to keep local branches open... the missing star was due to lack of clarity during a phone call re card replacement.", "stars": 4, "review_id": 58695}, {"category": "Money & Insurance", "title": "Noticeable Improvement!", "review": "Recently had trouble with re-setting up my mobile banking app after having to restore my phone. Also required assistance with clearing an old credit card I’d left closed & in default for two years.Called customer services on both occasions and there was zero wait time & the operators were incredibly helpful and polite.I’ve been with HSBC for 17 years and found the telephone service to be such a huge step up, I decided to leave a positive review. After all, very rarely does anyone come on a review site to do anything but vent their anger & frustration..4/5. Solely because I had to Google the customer services number, as you still seem to do your best to keep your telephone numbers buried beneath dead-end automated help pages.", "stars": 4, "review_id": 58696}, {"category": "Money & Insurance", "title": "HSBC Redeems Itself", "review": " Update 3.After going through the formal complaint, HSBC has redeemed itself. Given the initial problem I can't give a 5 star. But I can certainly give a 4 star review.", "stars": 4, "review_id": 58697}, {"category": "Money & Insurance", "title": "Initially attracted by the Martin Lewis…", "review": "Initially attracted by the Martin Lewis information, but was interested in their currency card, although Ive not got as far as that yet!Opening account is fine, a lot of emails and letters but ok. Transferring money in to the current account is easy, as is spending it. However, trying to get some of it back out (into the same source account)....oh dear. A fraud text, three phone calls, 5 different operators. Strangest questions, I appreciate a level of security but this was another level, I actually thought I had dialled a scam number and they were phishing for information........................................................Update, after 9 months I have found the currency card to be extremely useful. Several trips to Euro and non Euro countries have been made much easier with the card. ", "stars": 4, "review_id": 58698}, {"category": "Money & Insurance", "title": "Dumfries Branch", "review": "I joined the bank as a customer 6 months ago. I only have savings accounts so not much can go wrong. The Dumfries branch were helpful and pleasant.", "stars": 4, "review_id": 58699}, {"category": "Money & Insurance", "title": "Good", "review": "They are a good bank, the app is great but sadly in Northern Ireland there is now only one physical branch open! Opening an account with them online is a breeze but you may still need to go into a physical branch to provide a signature and apply for savings accounts", "stars": 4, "review_id": 58700}, {"category": "Money & Insurance", "title": "Great amenities but reduction in physical locations is getting tedious ", "review": "I like HSBC as they have the global currency card, that’s great. But unfortunately the branches are getting more and more sparse, it’s important for banks to keep these open. Otherwise, great bank. ", "stars": 4, "review_id": 58701}, {"category": "Money & Insurance", "title": "I lost access to my mobile banking…", "review": "I lost access to my mobile banking after switching to a new phone.Without my security log in details I called through to the telephone banking it was a straight forward process, the agent handled the call with patience as technology isn't something I deal with often. This is one of the only times I've had to contact with any issue and although I should have kept me phone to switch over my mobile banking it was a smooth process - the wait times on the phones could have been a bit quicker!", "stars": 4, "review_id": 58702}, {"category": "Money & Insurance", "title": "Day-to-Day = rubbish, but when it counted, they really delivered.", "review": "0% Interest on current account, which is rubbish, but I had an issue with eDreams and they took my complaint seriously, and got me my money back.  So in short; day-to-day  they're pretty rubbish, but when it counts, they had my back.  Thank you!", "stars": 4, "review_id": 58703}, {"category": "Money & Insurance", "title": "I am an immigrant and i have my account…", "review": "I am an immigrant and i have my account opened in HSBC bank without any hustle and obstacles. I was assisted by Ewelina Kuster. She was such a heartwarming person who guided me with every single step be it filling the form or depositing money or to learn how to change pin. I am very thankful for their cooperation. I would really like to recommend HSBC bank. And a big thanks to Ewelina. Much love❤️❤️", "stars": 4, "review_id": 58704}, {"category": "Money & Insurance", "title": "Formal Complaint Regarding Unprofessional Customer Service ", "review": "Subject: Formal Complaint Regarding Unprofessional Customer ServiceDear  HSBC Ipswich I am writing to formally express my disappointment with the way I was treated by one of your staff members, Phil, during my visit to your branch on December 30, 2024. The incident left me feeling upset and disrespected, and I believe it highlights a need for better training on how to handle sensitive situations.To provide context, my husband, Patrick, has entrusted me with managing his financial affairs due to his health challenges over the past five years. Despite my encouragement for him to handle these matters directly, he has requested that I speak on his behalf as he finds it difficult to process such discussions.During my visit, Phil asked Patrick about the nature of certain transactions. When I explained the situation and answered his questions, he repeatedly avoided making eye contact with me and directed his responses to my husband instead. When I encouraged him to speak with Patrick directly, his reply, “but you’re the one talking and not Patrick, is it,” felt dismissive and unprofessional. Phil then took Patrick aside for a private conversation, leaving me feeling excluded and undervalued despite my genuine efforts to provide clear and honest information.While I understand that it is the bank’s responsibility to safeguard its customers, I believe the situation could have been handled with far greater sensitivity and professionalism. Managing my husband’s finances is already a challenging and emotionally taxing responsibility, and this experience added unnecessary stress to an already difficult situation.For 15 years, I have been financially independent, and stepping into this role was a decision made out of necessity due to my husband’s health. I am deeply committed to ensuring his well-being, and I expected your staff to show understanding and empathy during this interaction.I hope you will take this feedback seriously and provide training for your team to better handle similar situations in the future. Customers managing financial matters on behalf of loved ones often face unique challenges and deserve to be treated with dignity and respect.Thank you for taking the time to address this matter. I look forward to your response and to hearing how you plan to prevent similar experiences for other customers.Sincerely,Pamela Naylor ", "stars": 3, "review_id": 58705}, {"category": "Money & Insurance", "title": "Global Money incompetence", "review": "Update: HSBC complaint team have contacted me and handled the issue very well, so I've moved from 1 to 3 stars.Global Money:  transactions from a recent trip to italy are not managed correctly, resulting in a false \"debit\".  The \"hold\" created by suppliers (car rental, petrol pumps) is not removed while the actual transaction is completed.  Transactions info is not available to remediate this, and help is very poor.  Also, the app is also very poor.  ", "stars": 3, "review_id": 58706}, {"category": "Money & Insurance", "title": "Removed bank managers for small business and increased overdraft arrangement fee (annually ", "review": "its a real shame you have removed bank managers for small business. now you are a faceless bank, computer and ai driven. i was never told you would increase the cost of an overdraft for my account that i have had for about 20 years and really you should reduce this since you have no account managers. no letters telling us about the fee, i just had to work out what the £450 fee was.  then you make be update my records and threaten to close my account if not completed in time when you should be paying me for my time to compliance you with your FSA .  so it seems its time to move to a more modern bank since i have no loans, all i have is the covid loan. almost paid off. ", "stars": 3, "review_id": 58707}, {"category": "Money & Insurance", "title": "USELESS UK BANKING APP!!", "review": "***Updated app completely useless.***ORIGINALLY I WAS TOLD IT WAS MY 'PHONE, THEY DELETED MY PROFILE I HAD TO START AGAIN, WAS TOLD TO USE 'OTHER 'PHONES'..BUT IT'S NOT MY PROBLEM.. IT'S AN HSBC APP THAT STOPS MANY FROM ACCESSING THEIR ACCOUNTS. NO BRANCHES FOR MILES FOR MOST OF US NOW.Don't send me any more incident numbers.Android 14 - app not worked with new 'phone - now update is useless too.AT LEAST - HUNDREDS OF PEOPLE ON GOOGLE PLAY COMPLAINING BUT BEING TOLD THEY ARE GIVEN AN INCIDENT NUMBER!! WHAT FOR? - USELESS APP - FREEZES EVERY DAY SINCE 3RD OCTOBER - RESTART 'PHONE IN ORDER TO WORK...and if you want to get notifications on your transactions...forget it. GET YOUR ACT TOGETHER!!", "stars": 3, "review_id": 58708}, {"category": "Money & Insurance", "title": "Be aware.HSBC charge a cash advance fee…", "review": "Be aware.HSBC charge a cash advance fee when foreign currency “holiday money” is purchased using their credit card from Post Office, Tesco etc etc.It is part of their credit card rules.Always use debit card for such purchases.", "stars": 3, "review_id": 58709}, {"category": "Money & Insurance", "title": "HSBC Uxbridge ", "review": "Arrived at the bank, all staff busy attending customer's. I finally made eye contact with the staff young Asian chap. Managed to sort the banking issue but seemed stressed out but no smile or any form of communication. I appreciate you're help said to him. No response!", "stars": 3, "review_id": 58710}, {"category": "Money & Insurance", "title": "So never had a problem with the bank…", "review": "So never had a problem with the bank has far has customer service but they claim to wanna help people with the cost of living over draft but not if you have a basic bank account. And that’s the people that need the most help yet it doesn’t qualify. I work just has hard to put money into my account has anyone with a higher bank account but always seem to get over looked with discrimination. Looks like hsbc is yet another bank that thinks the minimum wage works are not the ones who qualify for much.", "stars": 3, "review_id": 58711}, {"category": "Money & Insurance", "title": "Would avoid ", "review": "Never really had much of an issue with HSBC , only 3 stars since their branches are now kind of pointless . What’s the point in having a bank branch if you cannot accept coins / have a cash desk you rely on the cash machines to take the money to deposit so if u have a note that’s damaged or folded loads you just get told to go post office . Most banks now have a little area for cash deposits or them machines that eat the change to be deposited but why have a ‘ cashless bank branch ‘ ? To interact with staff to get additional services , help with app or account is good . But if someone looses their card and needs cash well good luck getting it from the local branch . ", "stars": 3, "review_id": 58712}, {"category": "Money & Insurance", "title": "Mobile app load of cra?", "review": "Updated to an iPhone and download the HSBC app only to find what you cannot do is update payees. How can you visit a branch when they are all miles away do we have to move to China? Sadly my local RBS also closed along with eight others in Prestatyn. Not much choice for banking nowadays and Principality doesn’t do current accounts. Looks like a car trip instead of a few minutes on a computer. Finally managed my payees so upgraded my rating ", "stars": 3, "review_id": 58713}, {"category": "Money & Insurance", "title": "Terrible customer service", "review": "Terrible customer service, don’t bother! Live chat assistance is a robot and then moves to a human, who doesn’t care, isn’t helpful, ignores questions, refuses to give a complaint email, then closes the chat whilst I am typing. Ruby requires much more customer service training! AVOID", "stars": 3, "review_id": 58714}, {"category": "Money & Insurance", "title": "Nothing offer really for loyal customers", "review": "I had been with HSBC for more than 18 years. I do not have complain about customer service as I always got the support from them whenever I called them or visited the branch. Recently I decided to switch as they never offered any benefits for my savings. Their interest rate has always been low. When I tried to get personal loan, I was refused to get that though my salary used to come to that account for years. Hence I decided to switch. Otherwise I was happy with their security protocols and felt safe having account with them.", "stars": 3, "review_id": 58715}, {"category": "Money & Insurance", "title": "Global money is great, rest is poor/uncompetitive.", "review": "Global money is great. Current account is good. Investment platform is a joke (bad and high cost). Customer service is a roll of dice, sometimes good sometimes useless. Just open an account for the global money card and do the rest of your banking elsewhere.", "stars": 3, "review_id": 58716}, {"category": "Money & Insurance", "title": "Good basic banking service", "review": "Been a business customer for over 13 years and as a basic banking service there have been no problems. Always been in credit. We do not use the over the counter service and the online portal does have user issues. Not one person has ever spoken to us in all the time we have been a customer.", "stars": 3, "review_id": 58717}, {"category": "Money & Insurance", "title": "Online banking set up delay", "review": "Got a credit card, 0% interest on purchases for 22 months, so far so good.However, to be able to manage any card of any type we obviously need online banking set up, and herein lies the problem. After 2 phone calls and a promise they have posted the required telephone banking details to enable me to set up online banking, I’m still waiting for the post with the details! But then if they used Royal Mail, I could be in for a long wait.Update: a third phone call and they were able to fully complete and verify my setup through to completion over the phone. The app is a bit of overkill considering I only have a credit card (it covers all their accounts).It works for verifying card purchases as it should, but one limitation is that it doesn't list pending transactions! So a purchase (on the credit card at least) only appears in the app once the merchant has fully completed the transaction.", "stars": 3, "review_id": 58718}, {"category": "Money & Insurance", "title": "Could be good branches but too busy and not enough", "review": "The actual manchester branches are quite good in terms of what you can do there. The problem is there is so few of them so the central one I went to is so busy as everyone goes there and as a result the service falters. Really large queues, feel really rushed. Alternative is to improve app continuously so don't need to come in", "stars": 3, "review_id": 58719}, {"category": "Money & Insurance", "title": "Good Branch service - don't bother trying to call them", "review": "I had a lot interaction with HSBC when I managed   my now deceased Mum's account via a Power of Attorney. I found the staff in my local branch in Romford Market Place to be both available and helpful; they were also very friendly and understanding.There were occasions when the branch was busy and I had to wait, or when the staff member couldn't help with my problem and had to seek advice but, I have nothing but thanks for them.However, I'm sure that most of the questions I had and actions I needed to take could have been achieved over the phone and online rather than the several Branch visits I had to make.I cannot give my review more than 3 stars because HSBC simply do not answer their phones, and their online banking app lacks decent features.I called HSBC so may times. More than once I waited over 30 minutes. I never spoke to a human over the phone. Never.I cannot recommend HSBC and am thankful that I don't have an account with them", "stars": 3, "review_id": 58720}, {"category": "Money & Insurance", "title": "Mixed experiences of customer service", "review": "Firstly, the bad news. My wife and I have been Premier customers for a very long time, and used to think HSBC was at least a 4star bank. However, now HSBC have withdrawn the live chat function from desktop online banking, you just get a chatbot which is worse than useless,  apparently you have to go on to their banking app on your mobile to reach this facility. Now I don't want banking on my mobile phone, I am liable to forget to take it with me and what if it is lost or stolen? So if I or my wife want to deal with a human which happened recently we have to ring up, go through multiple choice menus and recorded messages at length and even  then no human wants to speak to you. The operative we eventually got to speak to promised to deal with the issue (frozen ISA account) but didn't. We went to our nearest branch (York) to see if they could sort the problem but they could only tell us to ring up! Going round in circles here. This one is still pending.Now the good news, when we had to sort out the finances of a dead relative, the branch in York did have an operative to deal with that which was done effectively. Edit 23rd Oct: After posting this review, and getting in touch with HSBC \"Social Media\" we finally got the ISA issue sorted. We had to go back to York to the branch (which was unbeknownst to us shut for refurb) and see a member of HSBC staff in the Hilton Hotel, who at last sorted the problem out. Apparently if you don't put money in a cash ISA for a full tax year it is frozen. Who knew? It is not exactly publicised. So a hassle to sort out a simple issue. Not shining Customer Service HSBC!", "stars": 3, "review_id": 58721}, {"category": "Money & Insurance", "title": "Just so, so slow!", "review": "Had a MyAccount and MySavings for my child. Advisors themselves we’re really friendly, although everything was so slow! When trying to open account in-branch, took about 45 minutes which is much longer than any other bank we’ve used. App was outdated and not great to use, but not the worst either. My son has standing orders setup for funds to go from his main current account with another provider to his savings, but for this to work, he had to transfer to the MyAccount first and then to the MySavings. HSBC we’re slow at one of these transactions which resulted in him going slightly overdrawn as he didn’t use his main MyAccount. Received a slightly agressive letter saying that he might be reported to credit agencies for going £5 overdrawn! Not great and slow service.", "stars": 3, "review_id": 58722}, {"category": "Money & Insurance", "title": "I like the online banking but I’m…", "review": "I like the online banking but I’m pretty disappointed that the advance account advertised on the Martin Lewis show today, is not open to existing customers. On that basis I’m shutting my account!", "stars": 3, "review_id": 58723}, {"category": "Money & Insurance", "title": "I had a very good customer service…", "review": "I had a very good customer service experience when I called to make an enquiry. The call was answered quickly and I spoke to a young man who took time to check the information he gave me was correct and he explained things I didn't understand. I decided to apply for a bank account online the day after. Since then it hasn't been so good. I received a text to inform me my application had been received and ten days later have had no updates at all. Their website prides itself on their digital and mobile services, implying this is much faster and improved from good old counter services. I am not impressed at all. Had I gone into a bank to apply I am sure it would have been dealt with efficiently. How hard is it to send an update text so at least I know I am not forgotten, so it seems I will have to chase them up for the privilege of allowing them to have my business. I am sick of these 'improvements' that are costly and result in far inferior services. I will try elsewhere if I can even find a bank with counter service. Once upon a time ordinary didn't need to have banks, we used cash, our spending was simple and private. How stupid of us to let that go. ", "stars": 3, "review_id": 58724}, {"category": "Money & Insurance", "title": "Poor customer service ", "review": "Besides the speed of response on the chat service so far I am not happy with the service. Apparently to set-up a direct debit if you don’t have a current account with HSBC is by calling them or sending a written letter. Seems ridiculous in this day and age and all of their competitors have an online form for any current account. Awful. ", "stars": 2, "review_id": 58725}, {"category": "Money & Insurance", "title": "Consistently poor and confusing. ", "review": "I really don’t like reviewing negatively, I appreciate call agents have a tricky job with many customers calling, but I do not experience such consistently bad customer service with any other banks I’m registered with. Every single time I call I’m passed around at least 3 agents and departments. I’m currently trying to report fraud on my account, pretty simple stuff, and I’m now on hold to speak to a 6th agent. HSBC, there is only so much patience I can give. Every single time I call there is a problem. I’d rate this 1 star but at least the call agents are usually nice… if also useless. ", "stars": 2, "review_id": 58726}, {"category": "Money & Insurance", "title": "Not a good experience ", "review": "Never received a pass code to gain access to my account had to phone customer service. Also no clear instructions on how to pay your card ended up being charged a late payment fee, Had to phone customer service several times to find out. ", "stars": 2, "review_id": 58727}, {"category": "Money & Insurance", "title": "Hard Work !!!", "review": "We have been working with various banks over the last several years and after making application to HSBC London, we have never experienced such a shambles. The of course asked many many questions over the last several months which (in our opinion) were above and beyond necessity in respect to due diligence. They referred to relatives of associates that we worked with as \"credit risks\" and therefore were not able to work with us ! crazy. Don't waste your time with this bank. It shouldn't be allowed to call itself a bank.", "stars": 2, "review_id": 58728}, {"category": "Money & Insurance", "title": "I've had issues with online ordering…", "review": "I've had issues with online ordering and the app verification process. When I am asked to verify my payment via the app, the order I placed does not go through properly. However, money has been taken from my account. I now have to chase up a refund or file a dispute. Update I will give an extra star as the dispute was dealt with very efficiently and my money was returned. ", "stars": 2, "review_id": 58729}, {"category": "Money & Insurance", "title": "So fed up with waiting for my credit…", "review": "So fed up with waiting for my credit card replacement! This is the 3rd time it was requested by a department because previous requests were not executed?! I was told it will take 6 working days to get to the branch, it's 10 days now and still nothing. Online chat keeps timing out and every time I have to start a new one just to see another CS rep message 'I'm sorry...blah blah, I believe you are contacting us about card replacement (duh I just filled in bot's responses to say why I'm contacting you!), 'let me check it for you' - then times out (sorry, I can't sit and wait for the agent to respond). So fed up and frustrated. Used to like HSBC but something has seriously gone downhill!", "stars": 2, "review_id": 58730}, {"category": "Money & Insurance", "title": "Login is terrible", "review": "Login is terrible, none of your web advice is helping. You keep blocking my account, every time I try to access it you said that your app is installed on my multiple devices. It's funny how you try to limit people's choice to just one device. I have different devices and I am not using just one, but that is not a reason to block me from accessing my personal bank account to check my balance and situation. I know my logins details, my code and do on.., but I don't have time to call you for two hours to get through your customer service to reach you that is somewhere abroad and then experiencing bad hearing aids or don't not speak English.", "stars": 2, "review_id": 58731}, {"category": "Money & Insurance", "title": "HSBC does not help first time home…", "review": "HSBC does not help first time home buyers unless you have asked for credit according to the underwriting team. The branch also refused to set up new current account for my partner who has a basic account. He has since set up another bank account elsewhere. Unfair treatment to loyal customers.", "stars": 2, "review_id": 58732}, {"category": "Money & Insurance", "title": "Loan declined", "review": "Been with HSBC all my life, have my mortgage with them and always healthy funds in my account and no missed payments. They rejected a very small loan application on the grounds i didnt fit eligibility and when I called its because they didn't have on file whether i worked full time or part time! Daft. Meanwhile a hard search has been done on my credit file and they can't overturn the decision. Been told to just apply again which would mean another credit search which would impact my score so just going to save for a few months instead of going through this again with HSBC. My mortgage was easier to get than a £3k loan. Gave an extra star as the person on the phone was helpful. ", "stars": 2, "review_id": 58733}, {"category": "Money & Insurance", "title": "Your Loss HSBC", "review": "I applied for a HSBC credit card online last week which was immediately approved. I received the card through the post, downloaded the HSBC app and activated my new card. So far so good….until today when I received a letter from HSBC stating that they had doubts that this was a genuine application and requiring me to go to a branch in person with my passport and proof of address. As HSBC have recently closed my local branch, I was not about to travel further afield to confirm my identity in person. I telephoned HSBC; the staff were perfectly polite but insistent that I should attend a branch to prove my identity. Whilst I appreciate the need to prevent fraud, there are easier ways to confirm identity in 2024 so account closed and I’ll take my custom elsewhere. Your loss HSBC.", "stars": 2, "review_id": 58734}, {"category": "Money & Insurance", "title": "Started a bank switch which is due for…", "review": "Started a bank switch which is due for 9th may. Still waiting on telephone banking id, without it can’t access any online transactions. Hsbc guarantee you receive card and pin within a timeframe, which arrived, surely they should do the same for banking id. Their telephone helpline was unhelpful as the number you need to contact them asks for your id number which I didn’t have, endless loop", "stars": 2, "review_id": 58735}, {"category": "Money & Insurance", "title": "What a terrible  service!", "review": "What a terrible  service. Accompanied my aunt to the Harrow branch on Wednesday12th April, as she had a broken arm. Branch didn't  have enough staff to provide efficient customer service  and my poor aunt had to wait for an hour. This bank keep closing  all their branches which limits access to most elderly people.Such poor facilities and service. I feel the pain of the limited staff (who were polite) at the branch and the long queues of tired customers.", "stars": 2, "review_id": 58736}, {"category": "Money & Insurance", "title": "Bad payment clearing times", "review": "The app itself is decent, it gives you everything you need. However, taking a full 24 hours to clear a faster payment that is coming from an account I use every month is a joke. I used to work in credit cards customer service so I know that faster payments often clear with 2 hours. This month I forgot to make my payment until the day it was due. I paid it just in time. Next day I get a letter and a text saying my account is in arrears and that I need to make a payment. HSBC mark my words, if I have a mark on my credit score over this you will be hearing my complaint. There is absolutely no good reason that a payment should take 24 hours to clear if its coming from the same source every single month.", "stars": 2, "review_id": 58737}, {"category": "Money & Insurance", "title": "Communication is a very definite weak…", "review": "Communication is a very definite weak point. The customer team are lovely and helpful, but they are limited as to what they can do with the underwriters. We have only discovered information about our mortgage application through talking to the customer team. There have been no emails, phone calls or other communications from HSBC. The process takes too long. We have regularly been told it will take 3 more days every week for the past 6 weeks. I just wish we could talk to someone and find out what is happening, but it appears nobody can do that!! If we weren’t so far into the process I would switch supplier.", "stars": 2, "review_id": 58738}, {"category": "Money & Insurance", "title": "We could write a book relating to HSBC…", "review": "We could write a book relating to HSBC since closing our local branch.  I do not normally do a review but todays episode deserves one.  Our branch is now a 30 minute drive, we parked up for an hour, went straight into Bank, the queue was so long, the car parking ran out so back we go to the Car Park to put more money in the machine.  The reason we went to Bank for took over 3 hours from leaving our home, it is quite ridiculous.  We could tell many a story about other problems we have when telephoning etc.,   Please HSBC start listening to your customers as your business would not run without them !", "stars": 2, "review_id": 58739}, {"category": "Money & Insurance", "title": "Greedy bankers. (Misspelt bankers)", "review": "Have been with hsbc a while. Struggled through covid just like many others. Managed to pay all my direct debits and credit card. Never did I ask for help or to take a payment break. Struggled but managed. As a show of appreciation I got clobbered with a fine for being 1day late on my credit card last month.I'm switching  banks.", "stars": 2, "review_id": 58740}, {"category": "Money & Insurance", "title": "Impossible to pay on-line", "review": "Tried to pay bill on-line but the company reference only has three digits instead of the required four?? So, I cannot pay. Called customer service who set up a new payee. Tried again and still refuses. What rubbish. Spend a little more money on customer service and less on bonuses.", "stars": 2, "review_id": 58741}, {"category": "Money & Insurance", "title": "Just because I've had missed payments…", "review": "Just because I've had missed payments during pamdemic this bank denied me to upgrade my account although I've been a customer for many years. No flexibility, the staff very judgemental ( when I asked about an upgrade they looked in the system and then replied to me how am I expecting to get an upgrade when I missed payments?  Regardless of the fact it was just after two lockdowns . Bitter taste after that experience.", "stars": 2, "review_id": 58742}, {"category": "Money & Insurance", "title": "After 20 years of being a good…", "review": "After 20 years of being a good customer, having a credit score within top 25% of UK, I'm offered a £500 interest free overdraft to help with the cost of living.HSBC accept my application, then refuse to increase my overdraft to make any use of it, and the hard search they conduct drops my score by 50 points.That is a bad service HSBC.Online security can be a real nightmare to sort out if it goes wrong or they update their system.And finally the call centres they are used have terrible quality phone line connections and I struggle to understand the staff as they do me.We are a financial services nation that now outsources these services more and more often.", "stars": 2, "review_id": 58743}, {"category": "Money & Insurance", "title": "I can't find way to communicate with…", "review": "I can't find way to communicate with yours personal!!! Its not good when personal make a pro6 to invest money to this bank!It is unreal find time when you book an appointment near the Coventry!!! Even for 2-3week in advance!!! Make more branches or fond more people. You become from very prestigious bank to very strange 😔", "stars": 2, "review_id": 58744}, {"category": "Money & Insurance", "title": "Friday 3.1.25 Dipali did not ask me a…", "review": "Friday 3.1.25 Dipali did not ask me a question instead told me. When I advised I wish to take money off as a one off she did not listen. She asked me to confirm the amount.i wanted in cash . I did not appreciate that as there were customers now everyone knows how much I wish to request. She even forgot to give me a envelope. Incompetent and poor customer service. Listen to the customer. She also was making out my signature does much . No other person has asked me but Dipali in the past 5 months. So unprofessional! ", "stars": 1, "review_id": 58745}, {"category": "Money & Insurance", "title": "Terrible customer service", "review": "Terrible customer service. Cannot access my account from the app or website (which I use to be able to do), no password reset without calling an automated line that hangs up on you, when it does answer, a very unhelpful customer assistant 4th Jan 9:14am GMT went through security questions some asking only those I'd know if I had access to my account which I explained is the issue. They would not accept any other personal information, even exact amounts coming from my Bank. I have all the account info just that the password is not working. Asked to speak to their manager and left me on permanent hold clearly getting on with their day so I had to hang up. Would never use or neither recommend HSBC purely down to their incredibly poor customer service.", "stars": 1, "review_id": 58746}, {"category": "Money & Insurance", "title": "The chat service on HSBC is worst chat…", "review": "The chat service on HSBC is worst chat service I have ever come across. I started chat with the bot, then assigned a human. From the moment I was assigned a human, with a name, I sent 11 messages, not one reply from the human. Not even a hello, I'll be with you shortly. Sadly after 15 mins I had to leave the chat to go to a meeting. Still havent got my query resolved and I have now tried contacting HSBC on 4 different days. Really poor service. ", "stars": 1, "review_id": 58747}, {"category": "Money & Insurance", "title": "Just read HSBC’s response to my review…", "review": "Just read HSBC’s response to my review which they clearly have tenor read. My first sentence: having banked with HSBC for 62 years…..’ They ask whether I bank with them? They need to cease distributing bureaucratic rubbish and try and engage with customers.", "stars": 1, "review_id": 58748}, {"category": "Money & Insurance", "title": "Trying to open a joint account with a…", "review": "Trying to open a joint account with a person who currently lives in the EU. Has been and continues to be a catastrophic disaster with repeated misinformation from branch staff, phone line staff and in fact, the complaints resolution team. Branches in Scotland not staffed and functioning to provide account opening in spite of being open and available and directed to app where it is NOT even possible. Told to do it on phone banking of the website but during the process this met an error as both not in U.K. or EU. Told I’ll get a call to open it on the telephone. Call never materialised. When outcome of complaint, a thorough review lacking and staff member hadn’t an understanding of the basic facts. Attitude poor and condescending and didn’t like being corrected. Just wants to close complaint. Not resolve the issue still outstanding. She stated had to be done in branch (not currently in U.K.) or on telephone. Confirmed again as per previous call that it could be done together on the phone. So as call not coming to us, we made another call only to be told it isn’t possible and has to be in branch. Customer service is dire and considering one of their staff mantras is JUST GET IT DONE! Well,…. What’s more troubling is they don’t seem to care. Business flying out the window and a review rating of over 80% agreeing with my one star, HSBC need to be sitting up and listening. Appalling and disgraceful. ", "stars": 1, "review_id": 58749}, {"category": "Money & Insurance", "title": "Totally useless bank", "review": "Totally useless bankMy account been frozen under review for 4 months.Told me account would be closed on 16th December. Or earlier if I went into branch. Done both..still.no money returned. Meanwhile...behind 2 payments on my mortgage..behind on council tax.Yet this useless bank..with useless customer services. DO ABSOLUTELY NOTHING!!!!I AM LIVID!!Sending emails to useless complaints dept ...DOES NOTHING!!!!NO..ITS I QUOTE\"\"\"...IF YOU'RE NOT SATISFIED...CONTACT BANKING OMBUDSMAN!!!.....", "stars": 1, "review_id": 58750}, {"category": "Money & Insurance", "title": "Stressed me out to maximum yesterday ", "review": "HSBC Stressed me out to maximum yesterday as HSBC has done previously with threats to close accounts after decades of Banking history... 2 hours trying to resolve the HSBC not understanding accurate information... To be compliant to their demands they compelled me to give security information passwords and my hand written signature to a third party agency namely Adobe. Com this sensitive information should only be lodged on a HSBC website platform... I have made an official complaint thats been recognised by HSBC... in these days of astronomic Internet fraud and very dangerous AI the bank should not stress their clients out this way... This disgraceful methodology is titled SAFEGUARD that basically is not in my opinion safe guarding me as we have moved 2 of our 4 commercial accounts to other banks... We have decades of Banking never putting a foot wrong and all accounts in credit and adequately funded and we are the decent long term clients they victimise this way with threats of closing accounts because they can't understand the accurate information they have on long term record and been furnished with... I sang the praises of HSBC in the 90s even had a Hong Kong account then a wonderful bank head and shoulders above the UK High Street banks in those days... I cannot believe the actions and attitude of HSBC these days.. The stress yesterday I suffered wiped me out.. To close those HSBC  people  I spoke with in India and later UK were extremely understanding and helpful.... HSBC treatment of a long term client beggars belief to stress clients this way should be illegal ", "stars": 1, "review_id": 58751}, {"category": "Money & Insurance", "title": "Very disappointing", "review": "Very disappointing! Payments declined due to technical failure! Can’t believe that this happens so often! Pointless to keep the card open with HSBC, I have phoned them 3 times over the last two months ", "stars": 1, "review_id": 58752}, {"category": "Money & Insurance", "title": "More Woe HSBC !!!!!", "review": "Dear HSBC,Thank you for your recent e-mail concerning the reduction in the interest rate on my saving account. Can you explain why the interest rate on my account will be going down ? Do you not make enough profit already from your customers??I must admit that I am deeply disappointed and upset at this news because you are adding insult to injury by doing this, I have an ongoing unresolved dispute with HSBC at the moment which has not been dealt with since December 2023.I cannot use my voice is my password to access my telephone banking account as I am unable to use my hands and fingers and yet you continue to send me news like this. This has been ongoing now for over a year, I feel that you're not taking me seriously. I will continue to tell the world about your mismanagement of the problem via various well known online review websites until a resolution has been reached. I look forward to your reply,Yours sincerely,Val ", "stars": 1, "review_id": 58753}, {"category": "Money & Insurance", "title": "Useless Customer Service!", "review": "HSBC rejected an international wire payment I was sent but cant give me a reason why. They have verified and confirmed the details were all correct so there is no logical reason to reject it, yet they did. The funds have not been returned to the sender though, so the sender is asking for evidence it was rejected by HSBC and that they returned the funds. HSBC cannot do this... I just get passed from department to department on the phone but no one can help. No one can send me the evidence of the rejection as they are a telephone banking team so cant send emails, the online chat cant help as they don't deal with these types of queries and my local branch cant help as they don't deal with international payments! Absolutely terrible customer service and a terrible bank to deal with! I will be closing all of my accounts with them.", "stars": 1, "review_id": 58754}, {"category": "Money & Insurance", "title": "I can't believe it.", "review": "I can't believe how difficult it is to solve a simple problem with HSBC. Phoned them today. OK they recognised my phone number. But not interested in my name account number, or what the problem was. Just wanted letters from my telephone banking password. I have never done telephone banking and it was not something I was trying to do. All I was trying to do was transfer my working app to a new phone. Got no-where with them. Gave up, which is probably what they wanted. Having been with them for 40 years I have observed the service get progressively worse.", "stars": 1, "review_id": 58755}, {"category": "Money & Insurance", "title": "Never deposit valuables with them.", "review": "I am trying to sell Jewellery but they cannot get it from one branch to another. I have provided all the details some time ago and still nothing.", "stars": 1, "review_id": 58756}, {"category": "Money & Insurance", "title": "DON'T SEEM TO HAVE LEARNT ANY LESSONS…", "review": "DON'T SEEM TO HAVE LEARNT ANY LESSONS ABOUT OVER-COMPLICATED ONLINE BANKING SIGN-UP FROM YEARS AGO. ONGOING NIGHTMARES - SECURE KEYS WHICH SIMPLY DON'T WORK AFTER YOU'VE ENTERED ALL THE CODES & PASSWORDS CORRECTLY. CONTACT CUSTOMER CARE DIGITAL RESETS THAT SIMPLY DO NOT WORK. TOO MUCH. JUST MAKES YOU WANT TO THROW PLASTIC KEY CALCULATOR IN RUBBISH BIN. DON'T BOTHER WITH HSBC ONLINE BANKING SAME AS EVER.", "stars": 1, "review_id": 58757}, {"category": "Money & Insurance", "title": "Banking app on my phone refuses to accept a cheque.…", "review": "Banking app on my phone working generally well, but I am unable to pay a cheque in.  Error message says the number entered and the amount on the cheque must be greater than zero.  The cheque is for £300.  The image is clear, and the amount entered in to the app is correct.  After an hour on the text \"chat\" yesterday, and another hour on the phone to customer service \"agents\" today, having been told to uninstall and reinstall the app \"which will put it right\" the error continues in exactly the same way.  The \"agent\" has no knowledge, or skills, or access to the details of what is repeatedly going wrong.  In spite of repeated assurances that \"I can most certainly help you with the issue\" absolutely NO help was forthcoming.  After an hour of frustrating repetition of processes that clearly don't work, the agent said the ONLY thing they could do was \"raise a ticket\" but that this would take \"a minimum of fifteen days\". I am no further forward, and am unable, as requested, to \"walk into the local branch\" because it was closed over a year ago.  Utterly useless infuriating experience.", "stars": 1, "review_id": 58758}, {"category": "Money & Insurance", "title": "Still livid. ", "review": "Over zealous HSBC compliance system is letting down First Direct customers badly. Quite possibly replaced human beings with AI and common sense gone out of the window. Second month in a row that my salary has been held for no apparent reason and no one able to help. Disappointing to have to make yet more calls to alert them and prob won't get paid now until after Xmas. This is stealing from customers by with holding payments that were classed as legit last month. Nothing has changed. Same not for profit company. Livid. STILL NO RESPONSE ON INSTAGRAM LAURA @hsbc / First Direct. Perhaps respond here with your reason for not untagging my company following the fiasco last month as a potential risk. ", "stars": 1, "review_id": 58759}, {"category": "Money & Insurance", "title": "HSBC ‘deals’ with complaints without even reading them 🤦‍♀️", "review": "I recently had a bad experience with HSBC so I filed a complaint with them. They rang me up without having read the complaint (I swear this is exactly what I was I told). After a very unfruitful conversation in which there was absolutely no attempt from them in trying to solve the situation, the complaint was considered ‘dealt with’. I pointed out a few times that ‘dealing’ with a complaint without having read the complaint was absurd (almost funny, had it not been so unprofessional!). After being a customer with them for over 20 years, I will be leaving this bank, but decided to leave this review here so that others could benefit from my experience…", "stars": 1, "review_id": 58760}, {"category": "Money & Insurance", "title": "Renewing a cash ISA", "review": "I have lost the will to live this morning trying to renew a Cash ISA that expires in five days time. I had to apply for a new  account which I did but then moments later got a text to say contact them with no number offered. When I rang the main switchboard hd to give my telephone bank number which I do not have. After I set that up I was asked if there was anything else I wanted. Reminded them of my original reason for contacting them and was told I would have to apply again even though a new account appears on my online account. Totally confused now. Guess I will just have to wait until the current one expires. Noww Ist January and still unable to transfer matured funds to the new ISA account. I have been a member of HSBC since 1965. Apparently, I filled in the online application incorrectly. I did find it confusing and honestly assumed my previous account was an ISA.", "stars": 1, "review_id": 58761}, {"category": "Money & Insurance", "title": "avoid this bank", "review": "Try open business account, spend hours, get nothing. ", "stars": 1, "review_id": 58762}, {"category": "Money & Insurance", "title": "Ignorant & un empathetic staff ", "review": "Ignorant & un empathetic staff who lie and will not provide the details requested!Ken - customer service didn't take down the correct details so I am being penalised for it Aileen - customer service didn't rectify anything. Theresa Gibney who is a complaint specialist - zero empathy, refused to answer my questions and ignore that I have requested a SAR. ", "stars": 1, "review_id": 58763}, {"category": "Money & Insurance", "title": "Very dated, frustrating System!", "review": "I don’t have a current account with HSBC but I recently opened a credit card with them using a balance transfer and within the first week I realised how dated their system was, when I couldn’t manage my money and repayments within the app and would either have to go into branch, or call customer services to manage my own money, whereas most other banks I have used, I have total control via the app.This was annoying but I was cracking on, until yesterday when I rang to change my direct debit amount… what an absolute pain, it was ridiculous! The phone handler was getting me to log into my online banking, then mentioned I had to set up a new security number even though I already had one, so much faff just to change an amount, put me on hold, ask me my memorable questions, which I then couldn’t remember, finally when we had amended my direct debit, it took me through to an automated system to set up my security number and it kept saying it was unsuccessful. The call handler kept popping back on trying to help me, but eventually I was so frustrated I told him I had to go because I was rather irritated. So I decided to balance transfer to a much more modern system with another bank in which I can use the app and manage my money through a click of a button on the go, on my phone. HSBC seem very dated in their systems, needs a bit of an update to modernise to compete with other banks and avoid customer frustration! ", "stars": 1, "review_id": 58764}]