[{"category": "Media & Publishing", "title": "Love ❤️ ", "review": "I really don’t understand the terrible reviews, granted cancelling is tricky but the ease of use is amazing the audible + is brilliant offering a huge selection of free (no credit) book. I love the timed feature for when I’m listening & know I’m going to fall asleep. A vast selection covering many genres. I bought a years subscription as a birthday gift to myself & it’s is so worth the money. ", "stars": 5, "review_id": 86677}, {"category": "Media & Publishing", "title": "AUDIBLE is the Best in its Class ", "review": "Really do not understand the bad reviews.  AUDIBLE is by far the best for listening to books.  They have great offers and incredible selections of books all wrapped up in a very user friendly interface.  Reviews stating its difficult to cancel are very confusing also.  It's super simple and they do everything they can to try and please you.  ", "stars": 5, "review_id": 86678}, {"category": "Media & Publishing", "title": "I value the service offered by Audible.", "review": "I have used Audible for a few years now and greatly value the service they offer.I pay for one book per month which I don't always choose within that month but I have never had a problem when I later chose a book.I take advantage of the Plus library and the various 2 for 1 and 3 or 2 sales on occasion together with the daily email recommendations. I have taken a number of online courses, many free, and have learned a great deal.The recordings are high quality and the choice of narrators top class.All in all, I get a lot of enjoyment from my monthly payment.", "stars": 5, "review_id": 86679}, {"category": "Media & Publishing", "title": "I love my audible subscription", "review": "I love my audible subscription. I get the 2 credits per month option and I’ve been devouring books this way. Not had any problems. Been able to pause my membership when money won’t allow me to stretch to it and restart it smoothly. Picked up a few good titles in the sale. ", "stars": 5, "review_id": 86680}, {"category": "Media & Publishing", "title": "I am an Audible convert", "review": "I am an Audible convert, it makes walking the dog even more of a pleasure, and long boring car journeys are now a joy. Whatever issues people seem to have had strike me as unnecessary whining, and instead of manning up and sorting it out just complaining on an open forum. Shame on you. Most of the moaners seem pretty illiterate too, so perhaps there is a clue there. Don't be out off, its well worth the monthly subscription, particularly as there are now lots of included items too.", "stars": 5, "review_id": 86681}, {"category": "Media & Publishing", "title": "I love audible", "review": "I love audible. I love reading but I fall asleep when I start - so audible allows me to learn and develop my knowledge and skills whilst driving to work or cleaning the home, or at the gym. I love it. I’ve had the monthly plan for a few years now and I always purchase extra credits. I don’t understand the other reviews, you can pause your membership and it’s easy to cancel online.", "stars": 5, "review_id": 86682}, {"category": "Media & Publishing", "title": "Great for selection of books", "review": "I have been a member since 2022 and have had no problems. Wide range selection of books, they always have deals on like 2-for-1, £2.99 sale. Also found it easy to cancel/pause membership, I’ve done that a couple of times due to financial change or just want to get through the books I currently have. I have an illness so I struggle with books these days and reading is one of my escapes. I love physical books, though after doing the 99p for 3 months deal I fell in love with the service. I really have found that audiobooks are a great distraction for pain flares, background noise (I work from home) and even during insomnia episodes. I also like that you can sample the book before buying with a credit - I have to listen to the narrator before buying to see if I gel with them or not. I also like how you get more for your money, you can purchase one credit a month and get access to a selection of free books which are always changing! Though if you cancel/pause you don’t get to keep the books or when they go back to a credit. However that doesn’t bother me just nice knowing I can read multiple books a month without spending extra. One thing I do wish they have is when they have a sale, is having a filter option that pulls through any wishlist book on sale. I currently have 13 pages and having to scroll through each month to see if any are on sale :)Apart form that I’m happy with the service :D", "stars": 5, "review_id": 86683}, {"category": "Media & Publishing", "title": "I'm not going to lie this is a…", "review": "I'm not going to lie this is a difficult 5 star review from me. I dislike intensity the parent company but I've got nearly 500 titles in my library, lots free from the plus catalog. The quality of the production varies significantly but that's subjective I'm not sure I'm qualified to comment", "stars": 5, "review_id": 86684}, {"category": "Media & Publishing", "title": "My self inflicted Issue quickly resolved- superb as ever", "review": "I mistakenly bought a daily deal with a credit rather than paying for it. The person I spoke to resolved the issue with no fuss, reversing the transaction and refunding  my credit. Excellent service and so much better than  recent experiences with other subscription services.P.S. I’m amazed at the number of negative reviews. It’s a monthly subscription so reading a book a month or storing books up to read sort of goes with the territory. As for book choice I have read/listened to  100s of books on Audible and it has enabled me to discover authors and explore subjects I wouldn’t have found any other way. If you love books you’ll love audible.", "stars": 5, "review_id": 86685}, {"category": "Media & Publishing", "title": "Never had an issue with Audible", "review": "Never had an issue with Audible since I started with them around 2015 I think it was. For the times that I had to cancel the subscription, it is a very easy process to do and that was that.Audible has a wide collection of audiobooks within different categories, and before too long, you will end up with a rather long wishlist of books. I have found some treasures on the site including all the radio broadcasts of Dad's Army, Fawlty Towers, Blackadder, and so many history ones to listen to. The app is easy to use and new purchases will appear there instantly. If you have an Amazon Echo smart speaker, then you can simply say \"Alexa, play (Book title) on Audible\" and the book starts.", "stars": 5, "review_id": 86686}, {"category": "Media & Publishing", "title": "Just had some excellent customer…", "review": "Just had some excellent customer service from Audible so thought I would come on and leave a review. Really surprised at the amount of negative reviews, I found their customer service (via email) a breeze and super helpful & generous. The book choices are vast & I love that I can get through my rather LARGE book to read list quicker by listening to them as I go. You also get so many 'Included' books that are free, some new to me so a nice discovery, some on my list to buy so to get them completely for free is just another added bonus. Great app, highly recommend.", "stars": 5, "review_id": 86687}, {"category": "Media & Publishing", "title": "Have been with audible for a number of…", "review": "Have been with audible for a number of years and occasionally have the odd issue. However, whenever I contact customer services (Google for number) they always fix the issue and make me feel heard and cared for. This cannot be said for all app services these days, so we’ll done ✅", "stars": 5, "review_id": 86688}, {"category": "Media & Publishing", "title": "Love audible", "review": "Listened to some amazing books that I may not have tried if not for this app. It makes journeys some much better. Although I have been a member for years I have never had to use customer service until today and wow Roberto was so very helpful. Even gave me a book recommendation thank you audible, keep up the good work", "stars": 5, "review_id": 86689}, {"category": "Media & Publishing", "title": "Long time user", "review": "Have used Audible UK for about ten years and it has always been amazing. Listen to a lot of audiobooks and it is really easy to return them if you start listening but don’t enjoy it. Never had a problem with billing or anything like that. Have cancelled a couple of times due to finances which was easy to do, and then restarted again some months later. Very straightforward! I’m so surprised at all the negative reviews.", "stars": 5, "review_id": 86690}, {"category": "Media & Publishing", "title": "I joined via a trial on audible and…", "review": "I joined via a trial on audible and ended up stay as a member. Books are amazing, great selection, and the audio dramas are brilliant. Well worth the money and you soon build up a fantastic library of audio books.", "stars": 5, "review_id": 86691}, {"category": "Media & Publishing", "title": "Would thoroughly recommend Audible", "review": "I have been a member of Audible for over 15 years and can honestly say it has been brilliant. Every time you need help you can actually speak to someone as they have a ringback service. And if you really didn't enjoy a book you can exchange it without fuss. I would recommend Audible.", "stars": 5, "review_id": 86692}, {"category": "Media & Publishing", "title": "Does what it says on the tin…", "review": "I can’t really fault this service. You get what you pay for with credits and I use them very regularly, trying not to stack them. Audible is now so much better you can download books within the app (no idea what they were thinking before!). Great quality, easy to use, reasonably priced. Impressed.", "stars": 5, "review_id": 86693}, {"category": "Media & Publishing", "title": "Time of call 8.59pm UK time spike to a…", "review": "Time of call 8.59pm UK time spoke to Sean, a super person with great understanding and fantastic customer service really wish there was more people around like this in the world I felt really low before talking to this gentleman but after the call I felt really happy he was able to help me and was very helpful can't say much more except he's amazing thank you so much you made me evening 5 stars pulls X", "stars": 5, "review_id": 86694}, {"category": "Media & Publishing", "title": "Obsessed with audible!", "review": "Obsessed with audible! I love it, it’s done wonders for my mental health. I have 2 months and 10 days worth of listening time! I mostly listen whilst driving or going to sleep. Being absorbed in a story really helps me let go of stresses of work and the day. I recommend the membership, I get one book a month with the credit and listen to any of the free listens until my next credit. Great choice of books and some really great narrators.", "stars": 5, "review_id": 86695}, {"category": "Media & Publishing", "title": "Incredibly helpful with cancellation…", "review": "Incredibly helpful with cancellation and clear UI. When facing a money issue, the online support helped me resolve my issue within 10 minutes. Keep up the good work guys! :)", "stars": 5, "review_id": 86696}, {"category": "Media & Publishing", "title": "Can't knock them ", "review": "Have used audible for years on a subscription basis and never had a problem at all like alot of the reviews state and I have found it fair. Mainly :-  if I have wanted to leave I can put acc on hold or they usually entice me back with a lower monthly subscription for a limited time.If.i don't like a book you can return it without quibble. I'm sure there is a limit but I've returned 8 now over the years and been able to use those credits again.If you do want to cancel And don't know how, a simple Google search will show you and it takes about a minute ", "stars": 4, "review_id": 86697}, {"category": "Media & Publishing", "title": "This is my favourite audio book…", "review": "This is my favourite audio book company.  My annual subscription works out as less than £4 per book.  The app is excellent.  I haven’t given five stars for two reasons.  There are far too many fake reviews.  I’ve complained about this before and it’s an easy fix but still they appear. There are one or two authors who I love whose books are conspicuously absent.", "stars": 4, "review_id": 86698}, {"category": "Media & Publishing", "title": "Not as bad as some say especially as it is an Amazon company", "review": "I find the negative reviews against customer services a little surprising. It is not as good as before Amazon bought the company but nearly always it is able to provide some support for the multiple technical failures of the system.Once you know how to work their system the bargains you can get are very very good.", "stars": 4, "review_id": 86699}, {"category": "Media & Publishing", "title": "Fairly expensive", "review": "Yes it is fairly expensive at £7.99 a month and if you are using it for 76 page books maybe you should just be buying the books, but there are some huge tomes out there available for the cost of the monthly rental, along with such things as various radio series available, complete and unabridged. I am currently working my way through the Harry Potter series - I never had the patience to read them.Stephen Fry is absolutely superb as the narrator, is a real pleasure to listen to and brings J K Rowling's stories to full and exciting life.", "stars": 4, "review_id": 86700}, {"category": "Media & Publishing", "title": "Fine, with a small gripe!", "review": "Fine, really. I can’t subscribe, like others my perfectly valid and liquid card is declined.  However, I am not too bothered as I purchase the kindle and audiobooks via Amazon, most of the time for less than the price one book costs directly through a month’s subscription to Audible. Those not available at a reasonable price through Amazon, I buy via Apple books.My only real gripe is that narrators of period books repeatedly pronounce valet as val-ay. A val-ay parks your car in an American car park. A valet (said val-et) is a gentleman’s gentleman. No need to confuse the two! If Audible could just let all those publishing via their app know this, the rest of the world can continuing going to hell in a handcart! Happy 2023, everyone!", "stars": 4, "review_id": 86701}, {"category": "Media & Publishing", "title": "Customer Service", "review": "While I cannot comment on how good audible actually is, I had signed up to have a look but never used it. 4/5 months later I noticed I still had payments going out to them, spoke to Anshika who was very helpful and fully refunded me. I'd advise if you have any issues, go on the live chat they are very helpful", "stars": 4, "review_id": 86702}, {"category": "Media & Publishing", "title": "Excellent customer service", "review": "Excellent customer service and very responsive. Some of the books can be badly edited or have narrators who aren't great, but it is possible to avoid those by listening to samples. Overall an extensive selection of books.", "stars": 4, "review_id": 86703}, {"category": "Media & Publishing", "title": "Prompt customer service", "review": "28 May (4 STAR): I have revised up my review based on the good customer service I experienced. 23 May (1 STAR): It is impossible to contact the customer service. I signed up to £7.99/month package today. But once logged in, it forces me to buy the more expensive £13.99/package or I can't use it at all. Hence even though I have already paid for a £7.99/package, I have not been able to use it at all. I can't contact customer service by email or using the \"help\" section as it keeps taking me in circles.", "stars": 4, "review_id": 86704}, {"category": "Media & Publishing", "title": "Good but...", "review": "I do like audible, it makes it easy to listen to books without taking time out my daySome of the voice acting is a little off and not convincing and sometimes it's not clearly labelled that it's narrated in a different language", "stars": 4, "review_id": 86705}, {"category": "Media & Publishing", "title": "They Do Try To Make Things Right", "review": "I wouldn't normally bother reviewing a company like Audible but there's such a storm of 1 star reviews here and none of it matches the experience I've had, so I thought I'd share.I recently upgraded from the monthly to the annual subscription.  Based on my experience with customer services, I'm not worried in the slightest that Audible will \"steal\" my remaining 22 credits.I've had two experiences with their services, one brilliant and one meh.  I was listening to an included book that was due to leave the catalogue and become a normal paid-for book; it expired 12 hours before the stated time and I was cut off listening to it with 9 minutes to go.  A couple of emails back and forth and they just gave me a credit to make it right.  That's good service, isn't it?  My other experience was about reviews not being published - they are not transparent about why reviews don't get published and were generally no help at all in that case.  But I don't regard this experience as important as the one above, where they excelled.", "stars": 4, "review_id": 86706}, {"category": "Media & Publishing", "title": "Blank screen and no way to contact audible to report it.", "review": "1. I get a blank screen when I open my app.2. The contact is email address just gives generic options and no way of actually contacting them.3. Others I know have the same problem…. And also found no way to tell audible about this problem.4. Update. Fixed! so happy now.", "stars": 4, "review_id": 86707}, {"category": "Media & Publishing", "title": "Change of heart error corrected by…", "review": "Change of heart error corrected by Audible. Had a later email where successfully received the 99p per month for 3 months.", "stars": 4, "review_id": 86708}, {"category": "Media & Publishing", "title": "I was just about to cancel my…", "review": "I was just about to cancel my membership due to lack of use. Then I got drawn in to make the service cheaper. I thought why not if I don't use it then at least it's not as expensive. Then I got charged straight away which I am less than impressed with. I had just been charged £7.99 on the 20.04.22 meaning my membership was due to recharge on the 19.05.22. But I've just been charged an additional £3.99? I'm less than impressed regardless of the cheaper price.I can now say that the customer service team has refunded me the £7.99… so at-least they are helpful.", "stars": 4, "review_id": 86709}, {"category": "Media & Publishing", "title": "Great service use to pay for each…", "review": "Great service use to pay for each audiobook and thanks to their membership it’s way more economical - UX and recommandation are poor compared to Books from Apple", "stars": 4, "review_id": 86710}, {"category": "Media & Publishing", "title": "great concept", "review": "great concept, love using this and will continue to do so on now", "stars": 4, "review_id": 86711}, {"category": "Media & Publishing", "title": "Credits. Cool but be honest.", "review": "OK. Firstly, it was hard to find a way to communicate with you. All I want to say is that I find the ads irritating. \"Buy your credits now for less\". The credits have cost the same for years. £18. £6 a book. Never changed in the time I have been with you. I always buy the credits. Why not be honest? \"Buy another set of credits for the same price.\" As for my the rest, I love you. I am an Audible addict. So show me you read this and respond.", "stars": 4, "review_id": 86712}, {"category": "Media & Publishing", "title": "Love audible hate the app.", "review": "Love audible hate the app. I mean give me the option of folders to organise finished books, books in a series, genre etcI have the 24 book subscription didnt like the fact I couldnt just do it through the app and had to request a call customer services although the person was great and I was able to purchase during the call.", "stars": 4, "review_id": 86713}, {"category": "Media & Publishing", "title": "Books great, customer service poor", "review": "THe range of books is e excellent and good value if you take out a subscription. I’ve knocked off a star because if the often dismal customer service. If the question is not a simple one they don’t seem able to understand written English and give one fatuous formulaic replies. I’ve just had to contact them and got a reply that had missed the point of my question.", "stars": 4, "review_id": 86714}, {"category": "Media & Publishing", "title": "Wonderful service, glitchy app", "review": "The app itself is not the best - Audiobooks start to download then half will play and I'll get an error to say file corrupt. It can also be difficult when trying to locate a certain book because you have to search through every single file you've ever purchased. Some of the free content - the Audible Originals - are very good, but the reason for the four stars is that their customer service deserve the highest score. They really are a dream. Pausing membership is a breeze and they are very helpful. I only wish the app lived up to the service.", "stars": 4, "review_id": 86715}, {"category": "Media & Publishing", "title": "Flexible with subscription options", "review": "Their customer service is responsive and polite. I appreciate they let me switch plans and put my subscription on hold when I didn't have time to listen to many audiobooks. The range of content is much better than other audiobook sites.", "stars": 4, "review_id": 86716}, {"category": "Media & Publishing", "title": "Previews could be much better! ", "review": "I like my Audible overall, especially as I can frequently pause my account for three months. All it takes is sending them an email to ask. It would be better to be automated however.My main gripe are the  book previews - which used to be great. Now they are full of music intros and forewords - all of which I've already seen in the book description!! I've just listened to two book previews and in both I've not heard the actual content or style of the book, so I've not purchased! Sort that out Audible! Just a section of the book midway would do!! ", "stars": 3, "review_id": 86717}, {"category": "Media & Publishing", "title": "Need a better help system, otherwise I love it", "review": "I love the audible app & despite my best efforts cannot find a better one. The reason for only three stars is; today I wanted to set up an account for my partially sighted husband with Alzheimer's. It took sometime to navigate the help system & get to a text person, this person was neither helpful or polite, hence my efforts to find a better app, I couldn't.  I finally got through to an incredibly helpful nice man on the phone, he helped me set up a gift account for my husband, who is thrilled. It's very sad that one very ignorant person ruined an entire day. I am hopeful that audible sort out their \"help\" section on their app. Then five stars", "stars": 3, "review_id": 86718}, {"category": "Media & Publishing", "title": "Great app but …", "review": "I absolutely love the app but when you want to cancel the membership with Audible - it’s annoyingly difficult to find out how to do it. Please fix that @Audible!! I would have given 5 stars if it was easier to get out of the membership and I would also say I would be a returning customer at another time. ", "stars": 3, "review_id": 86719}, {"category": "Media & Publishing", "title": "Impossible to prevent spam mail.", "review": "Although I'm glad that it has provided 2 months of free subscription time and tokens to go with it (for free recordings), I'm displeased that despite having all notification boxes unchecked, I continue to receive marketing mail. That's a violation of the EU DMA and US CAN-SPAM acts.", "stars": 3, "review_id": 86720}, {"category": "Media & Publishing", "title": "Not so happy", "review": "I’m generally ok with Audible, but I spent ages on the phone trying to enter-cancel-enter-cancel my bank card until it finally worked. I have listened to just one book since and have the same problem!! I don’t have the time nor the inclination to be constantly messed around, entering and re-entering, cancelling and entering my card. Please sort this out Audible….I think I was lucky to find someone to actually talk to because I can’t find the link now, all I get is troubleshooting drop down lists 😡😡Unsatisfied customer…if you’re even bothered!!", "stars": 3, "review_id": 86721}, {"category": "Media & Publishing", "title": "The audiobook side is great but STICKERS?", "review": "The audiobook side is great. Hence the stars. But you cannot give them feedback. Having encouraging messages saying 'keep going your doing great' is really patronising and odd. I'm listening for pleasure. Also being interrupted with 'you've just earned a badge' is just bizarre. I've started getting cross when I look at the app. No idea how to turn it off or contact the company. What is the point of a feature which simply irritates you? When the books and audible plus selection are actually really good.", "stars": 3, "review_id": 86722}, {"category": "Media & Publishing", "title": "I was a long time subscriber", "review": "I was a long time subscriber, but today I have had two pre-orders rejected (after they were placed days/weeks ago) for failed payment (which is not correct as they were ordered using my existing paid for credits!) They may have cancelled the orders, but they HAVEN'T returned my paid for CREDITS used for the pre-orders. I have tried to call them over 10 times so far today, no answer, or I get through and then held in a queue and after 10-15 minutes they drop the call!Update: They did eventually fix the issue, but my trust in them is now very low. ", "stars": 3, "review_id": 86723}, {"category": "Media & Publishing", "title": "Audible Exhausted", "review": "Audible Exhausted. Having bought over two hundred books from Audible (not including freebies and podcasts) I find it harder and harder to find a book I like. So I get a little annoyed when Audible doesn't like me returning ones I cannot get on with. The problem is twofold. I seem to be exhausting books I like and hence experiment with books that are not my first choice. The second is Audible itself. Despite the vast catalogue, the recommendations do not usually match my tastes. (this is also true for Amazon Kindle books)So, Audible, given that I am keen to experiment a bit, and given your recommendations are rubbish. Why make it so hard to return?", "stars": 3, "review_id": 86724}, {"category": "Media & Publishing", "title": "Don't pre-order audible books", "review": "I have been a member for a few years now and am generally happy, thought it is too expensive. I have learned not to pre-order books as on two occasions I have been charged twice, which the company denies even though it appeared in my bank account.", "stars": 3, "review_id": 86725}, {"category": "Media & Publishing", "title": "Noreturn policy", "review": "I recently purchsed a title from audible using my credits. It was from a great author who writes science fiction, but when I started listening I found that it was a serial killer story. I wished to return it but was not allowed.Buyer beware.", "stars": 3, "review_id": 86726}, {"category": "Media & Publishing", "title": "I have a monthly subscription", "review": "I have a monthly subscription. I listen to a lot of books and often buy more in the app outside of my subscription. I really think you should be able to return books as some narrators are boring and you end up giving up on the book due to a boring narrator but you can’t return the book.", "stars": 3, "review_id": 86727}, {"category": "Media & Publishing", "title": "Good service, but big problems with the subscription experience.", "review": "Good: Lots of titles, hearing a sample first, downloading and listening even after your subscription has run out.Bad: I have had several incredibly frustrating experiences with subscriptions. It's unbelievably clunky and hard to get anything done in this respect, when restarting a subscription (I often take 3 months off so I can use my credits without more building up).", "stars": 3, "review_id": 86728}, {"category": "Media & Publishing", "title": "Sadly far too expensive.", "review": "I really love listening to audio books - it's such a huge treat. But I do find them far too expensive. It's just greedy. If they had a low fee loads of people would subscribe, but while it's so expensive we can only do it occasionally. They don't send emails when your monthly subscription is about to be paid either which isn't useful. Please lower your price or go back to free with Prime.", "stars": 3, "review_id": 86729}, {"category": "Media & Publishing", "title": "Good service but frustrating cancelation of credits if payment details expire.", "review": "I've been using this service for a long time and have mostly been enjoying it. I'm writing this review however as I've had an issue twice now where my payment card has changed and I haven't updated it because I had enough Audible credits to last me for a while and as a result Audible erased all my credits that I had already paid for. I spoke to customer service both times and they were immediate in restoring them but regardless as a policy this seems a bit forceful. Coupled with the fact that it is difficult to pause your membership for more than 3 months this isn't great. If as the customer I want to only listen to 1 audiobook every few months and not pay for credits credits faster than I can use them then I should be able to do this easily.", "stars": 3, "review_id": 86730}, {"category": "Media & Publishing", "title": "Ratings/reviews are misleading through omission.", "review": "I've been an Audible user for many, many years. The ability to listen to unabridged audiobooks at 1.5x or faster speed helps tremendously with my ADHD and means I can get through so many more books I want to 'read'. The customer service is good and I've not really had any issues.However, they lose 2 stars in my book as their ratings are falsely skewed. They have a policy of being able to return a book you don't like, but they remove the reviews of books by people who make use of that policy, which means that all the reviews on the website exclude people who really didn't like the book. This is a misleading and false review/rating system.", "stars": 3, "review_id": 86731}, {"category": "Media & Publishing", "title": "Good but with limitations for UK", "review": "I have been an audible subscriber for some time now and I really enjoy listening to books. I have experienced some dropouts but generally I have learned how to deal with these! I have long shared my Kindle books with a household account and assumed this would be possible with my audible purchases as implied in various links. After spending sometime trying to achieve this I eventually called audible (who have a very good support service) I then discovered that while you can share in the USA this facility is not available for UK residents. The reason for this difference is not clear; it would be helpful if this limitation were made clear as it would have saved me considerable time! Overall, I would say the audible subscription is worth it- and it is always possible to cancel if you can’t find anything you fancy.", "stars": 3, "review_id": 86732}, {"category": "Media & Publishing", "title": "Audible membership fee", "review": "I have used Audible on and off for years but now only use it if I get a special offer, eg, 4 months for half price. Everytime I use this offer I have to check each month what has been taken from my account. Again like in previous offers after 3 months they have taken the full membership price off me instead of the £3.99. It use to be very easy to contact them via email now I can't find an email address. There is a number but I'd rather have everything in writing.I received a reply from Audible stating where their email could be found but there is no email I've been all round the site and it just keeps taking you to helpful topics but no email just chat facility", "stars": 3, "review_id": 86733}, {"category": "Media & Publishing", "title": "chapters out of sync", "review": "I’ve used Audible a few times now but currently I am on a title that is frankly, messed up and I’m shocked that Audible doesn’t seem to have a quality assurance team to prevent things like this from happening.  I’m reading Churchill by Andrew Roberts. This book has 34 chapters so the problem it has is evident for quite a long time.  The chapter that is playing at any given moment is out of sync with the chapter being read. This is because the first part of the book which was read was the introduction however the software being used to record this book lists the introduction as being chapter 1. So then throughout the other 33 chapters in the book it’s always one chapter off. For instance if you go to the chapter list and you press chapter 10 it will tell you that it’s chapter 9 that it is reading to you.  It’s just an annoyance that shouldn’t be there. Someone mentioned this in a previous review of the book but it seems audible doesn’t care.", "stars": 3, "review_id": 86734}, {"category": "Media & Publishing", "title": "The \"hidden\" Library link when not a member anymore", "review": "Errr - stop hiding the \"Library\" link when you're not a member please.", "stars": 3, "review_id": 86735}, {"category": "Media & Publishing", "title": "Distorted reviews ratings", "review": "I like what they offer but the book review process is flawed as they only seem to publish good reviews.  Try writing a bad review - you probably won't see it.  And if you return a book because its really bad you can't then write a review about it.  I guess their view is that if you have not paid for it you can't share an opinion.", "stars": 3, "review_id": 86736}, {"category": "Media & Publishing", "title": "Lack of transparency", "review": "Lack of transparency. You sign up for a free trial and they don't say anywhere how long it lasts or what the next charge will be. I've deleted all payment methods and to be safe I've also removed them from my Amazon account. If you're interested in audiobooks, I advise you not to choose Audible but to evaluate any other competitor preferentially. If you still want to use Audible, don't leave money on your card.The Audible brand has reduced the value I attributed to the Amazon brand by a quarter in just one day. ", "stars": 2, "review_id": 86737}, {"category": "Media & Publishing", "title": "Audible - who is your customer?", "review": "I have had an audible account since the pandemic and love the fact that i can listen to books and have access  to them 24/7. However i find that as an organisation and given where we are in terms of our techno evolution very lazy and backward looking company - especially given the fact that we are not dealing with hard copy books ( where there might be a case for ‘selling/pushing’ surplus stock) but their digital equivalent;why do i receive a ‘Daily Deal’ for ‘Warhammer’ books or ‘Games of Thrones’ type books where hell would need to freeze over before I would even consider these as an option. Where AI abounds on ever aspect of life why oh why where with not much effort could you not take advantage of your incredible ability to ‘profile’ your customers and ‘pitch’ books that at least have a fighting chance or attracting interest?? Do you not realise that every time you send me a ‘Daily Deal’ like these you alienate me further and the minute someone comes up with an alternative to ?Audible that actually cares about their customers I will be off ( although judging by the feedback given on doing so you even make this difficult) even if you only offered 3 or 4 daily deals which somehow come nearer to my preferences I would feel slightly more enthusiastic about how you manage your customer base but a one size fits all approach is a product of pure laziness and ineptitude.", "stars": 2, "review_id": 86738}, {"category": "Media & Publishing", "title": "Search function is diabolical", "review": "I've been using audible for 5 years but it's so difficult to find books in my library that the search function seems utterly useless .... I'm not sure who came up with this feature, but unless you intend to learn the title of every book you purchase in your library you'll never be able to listen to your favourites again!", "stars": 2, "review_id": 86739}, {"category": "Media & Publishing", "title": "Great books, shameful manipulative payment structure ", "review": "I liked the books and the App design. I felt conned by the membership approach. You have a maximum of 6 credits even if you keep paying monthly, so basically your ‘membership’ is just robbery after that point. Plus you ‘lose’ those credits if if you cancel so you delay cancelling till you have time to choose more books. But why on earth should you ‘lose’ what you paid cash for?? Overall the whole payment system seems manipulatively designed to tie you into ongoing memberships that are deliberately hard to get out of, because basically that’s how they make the most money out of you. Highly manipulative, lacking integrity, but that’s the corporate world. Sad when it colours the beautiful world of books they guard ", "stars": 2, "review_id": 86740}, {"category": "Media & Publishing", "title": "It’s a bit of a con it states that you…", "review": "It’s a bit of a con it states that you can listen to all of the audiobooks.This isn’t true at all there’s a lot that are available with the subscription but the best ones you need to use a credit for or buy a credit,you get 1 credit a month that’s it with the subscription or you need to buy them,", "stars": 2, "review_id": 86741}, {"category": "Media & Publishing", "title": "Good product but it's so hard to cancel", "review": "I like the experience; they have a vast catalog of books. However, I wanted to cancel because I wasn't listening to enough books to pay for the subscription, and it's a NIGHTMARE to cancel the subscription. The instructions they share don't work.", "stars": 2, "review_id": 86742}, {"category": "Media & Publishing", "title": "The cancellation process is…", "review": "The cancellation process is intentionally difficult. Eventually I found a number and called them. Amazed I got through as quickly as I did even though they say it’ll be a wait.. they try and upsell bit I literally shouted to cancel. Let’s see if it really worked! ", "stars": 2, "review_id": 86743}, {"category": "Media & Publishing", "title": "WHERE ARE THE WOMEN?????", "review": "There are good things about Audible, although inevitably they lean towards popular titles I have found interesting books, BUT there is an inbuilt GENDER DISCRIMINATION here. For example, for the biographer Claire Tomalin the ONLY books listed are her male biographies even though she is one of the very few biographers of both Jane Austen and Mary Wollstonecraft. WHERE ARE THE WOMEN?? I conclude that Audible is a discriminatory platform!!!! This is ludicrous in the 21st century. This could be easily rectified BUT there is NO WAY to easily give feedback to Audible.", "stars": 2, "review_id": 86744}, {"category": "Media & Publishing", "title": "Broken Offer Audible Plan", "review": "I was sent an email offering me three audible books over three months for £2.99.  First book went through fine but second one did not.  Before I ordered the second one I checked with audible customer service who affirmed the plan.  However when I ordered a book I was charged full price.  After at least half an hour chatting to one of the audible advisers and even giving them the confirmation from the previous advisor they agreed to give me a free credit and refunded the £7.99.  My advice would to be careful of any plan offers Amazon Audible offer you as they might not play out.", "stars": 2, "review_id": 86745}, {"category": "Media & Publishing", "title": "Misleading advertising and membership scam", "review": "There is a wide selection of titles and the platform runs smooth and seamless...HOWEVERThe company is grossly misleading, claiming you can listen to your books anytime, but you can only do so while you're an active member!So you have to *pay* for your books but have to keep paying if you want to actually access them...That means you don't own them, but rather just rent them...!I'm the meantime the books take up memory on your phone and if you don't renew the membership you lose your accumulated credits, too.Pretty much a scam, and misleading...", "stars": 2, "review_id": 86746}, {"category": "Media & Publishing", "title": "Unbelievably lazy and useless programmers team, created a very poorly designed app. ostile app", "review": "Unbelievably user hostile app. Lazy programming, lazy implementation - even vital basic features such as chapter names (where avialable) are mostly not in existance. I use it despite all the failings just because I am an avid reader of books - and the selection on offer  is not too bad. Still - if you look for a reasonable app - you will find it here. Oh - I just got an email telling me that I cannot use cards from within the app to purchase new titles. Incredible.", "stars": 2, "review_id": 86747}, {"category": "Media & Publishing", "title": "Foie gras marketing", "review": "Audiobooks have enriched my life. I have  600+ titles with audible, pay for the Premium Plus subscription- so you’ll guess I think the product worth the money BUT recently the whole thing has changed. I go to look at my books- for a re-read or to find a bookmark- and I’m just swamped with advertising. Majority of my phone screen display is taken up with what some marketing department wants me to see rather that what I’m looking for. I resent this. It is intrusive, vulgar and disrespectful. Ive paid for this stuff and want to enjoy it in peace.I joined at a time when the app provided a user-focussed intuitive and pleasant experience. No more.  If I could take my titles to another provider, I’d go like a shot (even if I had to pay a price). So if you’re thinking of joining, I’d recommend you investigate the alternatives first. ", "stars": 2, "review_id": 86748}, {"category": "Media & Publishing", "title": "Customer service do not understand English", "review": "You can not see how much you payed for different products when you log in to Audible.Customer service can't help you to get receipts. They suggested that I should contact my bank 😂😅🤣. My bank could help me. Such a joke. Very difficult to understand the Philippine dialect. The woman could not understand my problem. I guess they got payed by the number of customer they had. Awful experience. I GOT HELP FAST AFTER POSTING ON TRUSTPILOTI change the rating from 1 to 2 stars", "stars": 2, "review_id": 86749}, {"category": "Media & Publishing", "title": "Audible is a great idea but flaky tech lets it down", "review": "Audible is a great idea but not always well executedMy credits have showed up lateDeal of the day not always available to me when I try to buy it - it seems the technology is flaky Amazon have built a whole business on achieving operational excellence underpinned buy robust client focused tech - why does that not apply to Audible?", "stars": 2, "review_id": 86750}, {"category": "Media & Publishing", "title": "Not what i expected and not value for money", "review": "Was expecting unlimited access to audiobooks on a streaming model but the one book a month was not what I wanted. I listen to a lot of audio content and wanted more of the genres I enjoy only to find out it was all extra at premium cost and the only free content seemed to be podcasts which I have little interest in. I'd gladly pay a little more and not 'own' the content if I could listen to more (Spotify?) - but in my opinion premium plus is not value in it's current subscription offering.", "stars": 2, "review_id": 86751}, {"category": "Media & Publishing", "title": "I have a yearly plan", "review": "I have a yearly plan, and i didn't read the 12 books (credits) i paid for. I wanted to pause my subscription as they state it it possible in their help section.but the link to pause doesn't show in my billing page.I have contacted their chat agent online and she told me that pausing cannot be done for yearly paid subscription. It's a lie. Audible state in the help section \"No matter what plan you have, pausing your membership will also pause your payments. You can also resume or cancel your membership anytime.\"The agent was nice so 2 stars instead of 1.", "stars": 2, "review_id": 86752}, {"category": "Media & Publishing", "title": "Audible UK", "review": "Audible UK - why is there no way to contact you other than calling. That doesnt work for your customers outside of the UK. In order to get help with signing into my account, I first need to sign into my account - not what I expect from one of the biggest companies in the world. What do I do now?", "stars": 2, "review_id": 86753}, {"category": "Media & Publishing", "title": "Too hard to cancel membership.", "review": "Too hard to cancel membership.The cancel membership page was down.It feels like they deliberately make it very hard to cancel and want you to juts pause your account. I first paused my account as couldn’t find a way to cancel.I phoned the audible helpline and it was then cancelled. Though they did try and offer pausing it again.CALL the audible customer helpline to cancel, seemed like it was the only way to me.", "stars": 2, "review_id": 86754}, {"category": "Media & Publishing", "title": "They take a reoccurring payment from…", "review": "They take a reoccurring payment from your debit card as opposed to direct debit. I always have to call them to cancel my membership as it never works in app. Contacting someone is quite difficult but in my experience thats the only way to cancel your membership. if you are able to speak to  customer service, they are usually  very helpful. Once you cancel you lose all your credit tokens, to avoid losing your credits you have to pause service and not cancel it. The membership gives you access to a plus catalogue , I only ever found a few books from the plus catalogue of  interest, however once I started to listen  they were removed from the plus catalogue  and required a token to continue listening . ", "stars": 2, "review_id": 86755}, {"category": "Media & Publishing", "title": "99p 3 months then quit.", "review": "Did the 99p 3 month offer then cancelled you simple don’t get enough quality books it’s not like Spotify where you can download the music you want you’ll find the book you want will cost you an extra credit ( you get 1 a month) £8.99 if you’re lucky on top of the £7.99 a month subscription. You’d think the service would be included in an Amazon prime package.", "stars": 2, "review_id": 86756}, {"category": "Media & Publishing", "title": "What an awful company ", "review": "What an awful company . They make it impossible to cancel your membership. They customer service is none existent and they should be banned for being so deceitful. NEVER AGAIN ! Avoid like plague 🤬", "stars": 1, "review_id": 86757}, {"category": "Media & Publishing", "title": "£7.99 is a lot per month", "review": "£7.99 is a lot per month, especially as many books are cheaper than this, so buying them with a credit is a waste of money. Then the credits are maxed at 6, so I assume after this they bill you for just being a member with almost no value. ", "stars": 1, "review_id": 86758}, {"category": "Media & Publishing", "title": "A total disgrace of experience ", "review": "A total disgrace. Offers a free trial, removes a cancellation button from IPhone so have to do it on PC. About 5 screens of yes or no. Then an email with a discount after a few days with attached t and c. Awful company and practice. Avoid this company and buy the hard copies! Don’t waste and time on it. They don’t deserve any business treating customers like this. No ethics!!", "stars": 1, "review_id": 86759}, {"category": "Media & Publishing", "title": "Beware", "review": "Beware, if you buy a Kindle book you may receive the following email: Thank you for your recent purchase on amazon.co.uk. You have now unlockeda promotional offer for a free 60-day Audible trial.After 60 days, your Audible membership will automatically renew at7.99/monthly until cancelled. You will be billed monthly and will receive one credit each month.So you are given an offer you didn't choose and, unless you are careful, are debited after the free period.Dodgy practice.", "stars": 1, "review_id": 86760}, {"category": "Media & Publishing", "title": "Cancelled then they collected for months blaming the USA ", "review": "Very poor and after you've cancelled a membership they bill you then tell you you've created a US account which is nonsense. Currently spent over 20 minutes getting fobbed off and now I've to be transferred to the US. WHY? just deal with the issue but you're transferred to the Philippines and they don't help they in my opinion hinder so I'd say to you please please get your books elsewhere because this is a case of fraudulent billing and how many of you actually check ?? Don't fall into their trap folks but elsewhere. ", "stars": 1, "review_id": 86761}, {"category": "Media & Publishing", "title": "Completely inaccessible if you don't have uptodate tech", "review": "Completely inaccessible for people of a poorer background.If you don't have an up to date device don't bother. You won't be able to access your subscription unless you have an up to date phone, your purchases are only downloadable in aax format which can't be listened to without a compatible device as it needs an app (theirs). So if your planning on getting anything from them make sure you can download their app first because otherwise it's useless. I would use other methods of getting audio books in future.", "stars": 1, "review_id": 86762}, {"category": "Media & Publishing", "title": "Appalling", "review": "Appalling. They make cancellation hidden and impossible. Even if you chat they don’t give you an option to cancel. You have to complain via chat and then remarkably they send a cancellation link! Companies like this deserve to be closed down by the US authorities. ", "stars": 1, "review_id": 86763}, {"category": "Media & Publishing", "title": "No contact function…", "review": "I have been an Audible user for several years and love it. However, I tried to contact support recently (there is a contact us button) but it doesn’t work and needs fixing. So I am leaving this review in the hope that someone at Audible will read it and take action.", "stars": 1, "review_id": 86764}, {"category": "Media & Publishing", "title": "Device all of a sudden not compatible", "review": "I used to love Audible but as of last night the app is not working on my phone. It turns out, all of a sudden I need Android 9.0 or higher, my phone is only Android 8.0.0. So I have to buy a new phone to download the app, after years of using it, being a loyal customer? Not amused and will look around for a different app/book provider!", "stars": 1, "review_id": 86765}, {"category": "Media & Publishing", "title": "Pressure has the opposite effect", "review": "First an email which I first thought was a scam, as if by me purchasing a certain product (weedkiller) I was now eligible for a free trial which seemed to imply it had already started.Second, that advertising on my Kindle Fire. Guess what? If I tap on the ad, then tap \"not interested\" - it means I am NOT INTERESTED. Keeping the same ad coming back and back and back really annoys folk. It also means I will NEVER have anything to do with a service that treats me like somewhere between a \"mark\" and an imbecile. ", "stars": 1, "review_id": 86766}, {"category": "Media & Publishing", "title": "Find a different service.", "review": "Amazon will tie you in so I suggest you  use a different service.They make it impossible to cancel the subscription. You have to phone a call centre in the Philipines, who refuse to  answer any questions. I have 4 credits that I have paid for and if I cancel they remove the credits that I have paid  for! IT'S SHADY, A SCAM. Surely that is illegal?? Anyone know? Not surprising since Amazon is owner and Bezos has a gazillionaire lifestyle to keep up. ", "stars": 1, "review_id": 86767}, {"category": "Media & Publishing", "title": "Impossible to cancel!", "review": "The selection of books is good, but I'm forced to give Audible a bad rating because IT'S ALMOST IMPOSSIBLE TO CANCEL A SUBSCRIPTION. I thought I had managed to do so on a desktop (on a phone is not possible), but to my surprise, I was debited another 11.99 Euros a few weeks later!I tried again to cancel, following all the steps outlined by Audible, but could not find the cancellation link indicated by them, so I have been forced to delete my credit card from my account. Just awful!", "stars": 1, "review_id": 86768}, {"category": "Media & Publishing", "title": "Audible won’t communicate…", "review": "Audible have now become uncontactable!!!!  I wanted to email them about a complex issue and used an email address I had used before. But an automated reply said they did not monitor emails at that address. I tried other addresses but the only option to contact them was their very stupid chat bot. It offered limited choices but no free text. So I tried their phones. I was phoned virtually immediately but the automated message said that in order to speak to an associate I had to dial 3 specific numbers. I did that but it said nothing was received. I tried again with the same result and then they cut off the call.So they are taking £7.99 a month but will not communicate. I have no choice but to end my membership. ", "stars": 1, "review_id": 86769}, {"category": "Media & Publishing", "title": "Worst customer experience in my life", "review": "Allright, I tried buying an audible subscription but the customer experience was the worst I've ever had. Redirected me to the german website, then to the french one, I've paid for my subscription but it tells me that I'm not subscribed... Stay away from audible and try alternatives! Hope to get my money back!", "stars": 1, "review_id": 86770}, {"category": "Media & Publishing", "title": "I despise this company", "review": "I despise this company.  They will seize credits from you at random and the customer service is the worst I've ever seen anywhere.  Seriously I will often chose the free version on YouTube over these people despite the obvious problems on YouTube.  They are terrible.  If there was any competition, be it in North Korea, I would recommend it in a second.", "stars": 1, "review_id": 86771}, {"category": "Media & Publishing", "title": "A very nasty company indeed in my…", "review": "A very nasty company indeed in my opinion. Sneaked into my amazon account when I purchased a CD. Sent me a message saying my audible was unlocked and I was getting a 60 day free trial. After which my account would be debited. Without my consent of course. I want nothing to do with this company and they have no right to solicit me through amazon. Very angry with them.", "stars": 1, "review_id": 86772}, {"category": "Media & Publishing", "title": "AVOID", "review": "Extremely disappointed , awful service. I'd purchased audible as a gift to be emailed on 5th Nov for a friends birthday. By 7.30pm she hadn't received anything, so  I phoned, it's an international number, I was put on hold while the agent looked into it, nearly 15mins, i didn't think he'd come back. He said there was still 5 hours left of the day up to midnight so it could still arrive, so i was to wait and if it didn't come to phone the next day for a refund. I pointed out her birthday was nearly over it should've been at the start of a day surely ? Again he repeated there were still 5 hours left yadda yadda. So i came off the phone, contacted my friend to tell her and what would you know it had \"suddenly\" come through, which i believe he was doing while he'd gone for so long and if i hadn't of phoned she wouldn't have got it. When i click on my purchase it says it can't be found, but thankfully my friend has said my gift has been added to her account. But i certainly wouldn't use audible again for myself or purchase as a gift. ", "stars": 1, "review_id": 86773}, {"category": "Media & Publishing", "title": "Grand theft Audible", "review": "When you subscribe to Audible you purchase monthly credits, which can be switched into books. But if you for some reason are unable to continue your subscription, your credits will \"expire\". So what you payed for vanishes into thin air.It is not possible to email or chat with Audible, so you'll have a hard time sorting this out I can guarantee you! Horrible experience. Don't use!", "stars": 1, "review_id": 86774}, {"category": "Media & Publishing", "title": "Dont touch Audible", "review": "I tried Audible’s free trial and promptly canceled it, receiving a confirmation email for the cancellation. Despite this, I’ve been charged monthly for the past three months. I’ve spent an entire day trying to resolve this issue, only to be passed around between different representatives. The blame was shifted from Apple to Audible UK, and ultimately, no one seemed to take responsibility. This has been an incredibly frustrating and disappointing experience. It feels like a blatant  scam.", "stars": 1, "review_id": 86775}, {"category": "Media & Publishing", "title": "Account locked zero help ", "review": "I have been an Audible member for over 15 years. It’s been two weeks since my account has been locked and I can’t access my library. Numerous phone calls and emails. One hour phone call today, 3 different people. I passed security questions finally and still they can’t open my account and clear 2 step verification. I submitted my passport online twice and still no account. Customer service shoddy and no one can authorise things. ", "stars": 1, "review_id": 86776}]